{
  "type": "pdf",
  "source": "Appeals.pdf",
  "text": "OP 21\nAppeals\nOP 21 Appeals \n2005-10-25 \n \n1 \nUpdates to chapter........................................................................................................................................ 2 \n1. \nWhat this chapter is about.................................................................................................................. 3 \n2. \nProgram objectives............................................................................................................................. 3 \n3. \nThe Act and Regulations.................................................................................................................... 3 \n3.1. \nForms.............................................................................................................................................. 4 \n4. \nInstruments and delegations.............................................................................................................. 4 \n5. \nDepartmental policy............................................................................................................................ 4 \n5.1. \nHumanitarian and compassionate considerations.......................................................................... 4 \n5.2. \nHearings ......................................................................................................................................... 5 \n5.3. \nEvidence......................................................................................................................................... 5 \n5.4. \nDecisions ........................................................................................................................................ 5 \n5.5. \nReasons.......................................................................................................................................... 5 \n5.6. \nThe role of the Minister................................................................................................................... 6 \n5.7. \nApplications .................................................................................................................................... 6 \n5.8. \nLoss of appeal rights ...................................................................................................................... 6 \n5.9. \nConsenting to an appeal................................................................................................................. 6 \n6. \nDefinitions........................................................................................................................................... 7 \n7. \nProcedure: Roles and responsibilities................................................................................................ 7 \n8. \nProcedure: Family class sponsorship appeals................................................................................... 7 \n8.1. \nFamily class sponsorship appeals.................................................................................................. 7 \n8.2. \nNotice of appeal.............................................................................................................................. 8 \n8.3. \nProduction of the record ................................................................................................................. 8 \n8.4. \nProcedures upon receipt of new medical information during an appeal ........................................ 9 \n8.5. \nAppeal allowed ............................................................................................................................... 9 \n8.6. \nAppeal withdrawn ........................................................................................................................... 9 \n9. \nProcedure: Loss of residency status appeals .................................................................................. 10 \n9.1. \nOutside Canada............................................................................................................................ 10 \n9.2. \nRequests to return to Canada for the hearing.............................................................................. 10\nOP 21 Appeals \n2005-10-25 \n \n2 \nUpdates to chapter \n \nListing by date: \n \nDate: 2005-10-25 \nChanges were made to OP 21 in order to reflect the CIC and CBSA policy responsibility and \nservice delivery roles.\nOP 21 Appeals \n2005-10-25 \n \n3 \n \n1. \nWhat this chapter is about \nThis chapter provides an understanding of the process of appeals of decisions made under the \nImmigration and Refugee Protection Act (IRPA). This chapter deals specifically with overseas \ncases that are subject to an appeal before the Immigration Appeal Division (IAD). \n2. \nProgram objectives \nIRPA allows specific groups of people to appeal to the IAD in order to: \n• \nensure that persons ordered removed from Canada after an admissibility hearing have had \nthe benefit of a full hearing on the allegations against them. The Act recognizes an additional \ncommitment to permanent residents and protected persons by allowing them to appeal \nremoval orders to the IAD, not only on the basis of legal and factual questions relating to the \nallegations at the admissibility hearing, but also on the basis that special consideration may \nbe warranted;  \n• \nensure that the reunion in Canada of Canadians and permanent residents with their close \nrelatives from abroad is facilitated by providing a review, by way of appeal, of refusals of \nsponsored applications for permanent residence from members of the family class; and \n• \nensure that the rights of permanent residents are given due consideration by allowing an oral \nappeal to the IAD for loss of residency status determinations made both in and outside of \nCanada. \nThe right of appeal to the IAD is consistent with the objectives of IRPA in that it helps: \n• \nensure that families are reunited in Canada;  \n• \nprotect the health and safety of Canadians and maintain the security of Canadian society. \n3. \nThe Act and Regulations \nFor legislation regarding appeals see: \nRight to appeal - visa refusal of family class \nA63(1) \nRight to appeal - visa and removal order \nA63(2) \nRight to appeal - removal order \nA63(3) \nRight of appeal - residency obligation \nA63(4) \nRight of appeal – Minister of Public Safety and Emergency \nPreparedness (PSEP) \nA63(5) \nNo appeal - inadmissibility \nA64(1) \nNo appeal - serious criminality \nA64(2) \nNo appeal - misrepresentation \nA64(3) \nHumanitarian and compassionate considerations - Jurisdiction of the \nIAD \nA65 \nDisposition of an appeal \nA66 \nAllowing an appeal \nA67 \nEffect of allowing an appeal \nA67(2) \nDismissal of an appeal \nA69(1) \nRemoval order - permanent resident \nA69(3)\nOP 21 Appeals \n2005-10-25 \n \n4 \nIAD decision binding \nA70(1) \nReopening appeal \nA71 \nImmigration and Refugee Board \nA151 \nSole and exclusive jurisdiction \nA162(1) \nPresence of parties \nA164 \nProceedings - all Divisions \nA166 \nRight to counsel \nA167(1) \nAbandonment of proceeding \nA168(1) \nAbuse of process  \nA168(2) \nDecisions and reasons \nA169 \nIAD - Court of record \nA174(1) \nPowers of the IAD \nA174(2) \nProceedings - IAD \nA175(1) \nPresence of a permanent resident at a hearing \nA175(2) \nSpecified removal order - loss of permanent resident status \nR228(2) \n3.1. \nForms  \nNil. \n4. \nInstruments and delegations \nPursuant to A6(1) and A6(2), the Minister of Citizenship and Immigration (C&I) and the Minister of \nPublic Safety and Emergency Preparedness (PSEP) have designated persons or class of \npersons as officers to carry out any purpose of any provision, legislative or regulatory, and have \nspecified the powers and duties of the officers so designated.  These delegations may be found in \nchapter IL 3, Designation of Officers and Delegation of Authority. \n5. \nDepartmental policy \nThe Minister of C&I has the policy responsibility with respect to family class sponsorship refusal \nappeals and residency determination appeals. \nThe Minister of PSEP has the policy responsibility with respect to removal order appeals. \nIt is the Canada Border Services Agency (CBSA) that has the responsibility for the service \ndelivery of all appeals before the IAD on behalf of either Minister, depending on who has the \npolicy lead. \nFor more information, please refer to ENF 19, Appeals before the Immigration Appeal Division \n(IAD) of the Immigration and Refugee Board (IRB). \n5.1. \nHumanitarian and compassionate considerations \nThe IAD has an equitable jurisdiction, which allows it to consider factors that may warrant an \nappeal being allowed despite the fact that the decision being appealed is valid in law. IRPA sets \nout the test to be applied by the IAD in order to allow a case for reasons of equity. Under IRPA, \nthe test of equity which the IAD is to apply has been consolidated into one test for all types of \nappeals to the IAD by a party other than the Minister [A67(1)(c)]. When considering an appeal of \na family class sponsorship, the IAD may consider some of the following factors: \n• \nwhether the admission of the applicant would result in the reunion in Canada of the appellant \nwith close family; \n• \nthe strength of the relationship between the applicant and the appellant;\nOP 21 Appeals \n2005-10-25 \n \n5 \n• \nthe degree to which the applicant is established abroad; \n• \nwhether an applicant has demonstrated the potential to adapt to Canadian society; \n• \nwhether the parties to the application have obligations to one another based on their cultural \nbackground; \n• \nwhether the applicant is alone in their country; \n• \nthe availability of health services to the applicant in Canada and abroad (for refusals based \non medical grounds);  \n• \nwhether there is evidence of rehabilitation or the risk of the applicant reoffending (for refusals \nbased on criminal grounds). \nThe IAD will balance these factors against the grounds for the refusal under appeal, and if it finds \nin favour of the appellant, will set aside the decision. Where an appeal is based on an application \nas a member of the family class, the IAD must first be satisfied that the foreign national is a \nmember of the family class, and that the sponsor is a sponsor within the meaning of the \nRegulations before it can consider humanitarian and compassionate considerations [A65]. \n5.2. \nHearings  \nThe IAD is a court of record. It conducts public hearings on the basis of the adversary system and \nestablished judicial principles, rules and precedents. The IAD has all the powers, rights and \nprivileges vested in a superior court of record with respect to any matter necessary for the \nexercise of its jurisdiction, including the swearing and examination of witnesses, the production \nand inspection of documents, and the enforcement of its orders. \nThe IAD hearings are de novo, and therefore not limited strictly to reviewing the evidence that led \nto the refusal or removal order. In Kahlon v. Minister of Employment and Immigration (1989), 7 \nIMM LR (2d) 91, the Federal Court of Appeal established that the IAD must hear the whole case, \ntaking into consideration any additional facts brought to its attention.  \n5.3. \nEvidence  \nThe IAD has broader powers regarding the admission of evidence than regular courts, as it is not \nbound by any legal or technical rules of evidence. During a hearing, the IAD may base a decision \non evidence it considers credible or trustworthy in the circumstances, even if the strict rules of \nevidence have not been met.  \n5.4. \nDecisions  \nThe IAD may dispose of an appeal by allowing it or dismissing it. In the case of an appeal against \na removal order, the IAD might instead direct that the execution of the order be stayed for a set \nperiod of time, with terms and conditions attached. A66 requires the IAD to impose mandatory \nconditions specified in the Regulations for every stay. Additional conditions may be imposed at \nthe IAD’s discretion [R251].  The IAD can reconsider a decision to stay a removal order at any \ntime. A review of a stay may be initiated either by application or on the IAD’s own initiative.  \n5.5. \nReasons  \nThe IAD is required to provide written reasons for all decisions regarding an appeal by a sponsor \nand for decisions that stay a removal order. For all other decisions, the person concerned or the \nresponsible Minister may request written reasons within 10 days after the day they receive the \ndecision. [IAD Rule 54(2)]\nOP 21 Appeals \n2005-10-25 \n \n6 \n5.6. \nThe role of the Minister \nThe Minister is party to all appeals filed with the IAD. In most cases the Minister's representative \nis the respondent, taking a position supporting the decision under appeal. The Minister may also \nfile appeals with the IAD, as the appellant, to challenge favourable decisions of members of the \nImmigration Division.  \nFor the purposes of an appeal, hearings officers may represent either the Minister of PSEP or the \nMinister of C&I as IRPA is the legislation for both departments. The CBSA's  hearings officers \nrepresent the Minister of C&I during sponsorship refusal appeals as well as residency obligation \nappeals with respect to decisions made abroad. They represent the Minister of PSEP in all other \nmatters before the IAD, i.e., removal order appeals. \n \nHearings officers represent the Minister of C&I and the Minister of PSEP. On occasion, lawyers of \nthe Department of Justice (DOJ) are assigned to provide this representation.  \nHearings officers and DOJ lawyers present cases and take positions in accordance with \ninstructions channelled through Admissibility Branch, Legislative and Regulatory Policy Division, \nCIC, and Inland Enforcement, the CBSA at NHQ. These instructions may be specific to an \nindividual case, or be in the form of general policy instructions applicable to the various categories \nof cases.  \n5.7. \nApplications  \nThe IAD Rules specify that, unless the IAD Rules provide otherwise, requests made to the IAD \nmust be made in an application. Applications may be made either orally at a proceeding or in \nwriting [IAD Rule 42]. Procedures for applications made orally at an appeal will be determined by \nthe IAD at the proceeding. \n. \n5.8. \nLoss of appeal rights \nA64 specifies the circumstances under which a foreign national, a sponsor or a permanent \nresident loses their right of appeal. No appeal may be made to the IAD by a foreign national or \ntheir sponsor or by a permanent resident in respect of a decision that was based on a \ndetermination that the foreign national or permanent resident has been found to be inadmissible \non grounds of security, violating human or international rights, serious criminality or organized \ncriminality.  Serious criminality is further defined in A64(2). \nA64(3) also provides for the loss of appeal rights in respect of a decision that was based on a \nfinding of inadmissibility on the ground of misrepresentation, unless the foreign national in \nquestion is the sponsor’s spouse, common-law partner or child. \n. \n5.9. \nConsenting to an appeal \nThe role of the hearings officer as the Minister’s counsel (Minister of C&I or Minister of PSEP) is \nto ensure the correct decision is made by the IAD. In most circumstances, this requires the \nhearings officer to defend the decision of the officer or the Minister’s delegate or Immigration \nDivision to issue a removal order.  However, exceptions may arise where the original decision is \nnot tenable.  \nWhen a decision is made to consent to allowing an appeal, it is vital that the hearings officer \ninform the visa office of the reasons for consent. Lines of communication with visa offices must be \nkept open in order to assist officers in identifying ways to strengthen decisions and avoid potential \ntrends from developing.\nOP 21 Appeals \n2005-10-25 \n \n7 \n6. \nDefinitions \nNil. \n7. \nProcedure: Roles and responsibilities \n \nThis role/office: \nIs responsible for: \nThe Immigration Appeal \nDivision  \nThe Immigration Appeal Division is an administrative tribunal that \nprovides an independent review of decisions made under the \nimmigration program. The IAD examines cases before it for possible \nerrors in law, in fact, and in mixed law and fact; or for failure to observe a \nprinciple of natural justice. It also has the authority to reverse valid \ndecisions on equitable grounds. This Division is part of the IRB and is \ncompletely independent of CIC, PSEPC and their respective Ministers. \nThe principal matters that may be brought before the IAD are:  \n• \nrefusal of a sponsorship application for members of the family class;\n• \nrefusal of an immigration application by a member of the family \nclass; \n• \nremoval orders made against permanent residents and protected \npersons at an examination or admissibility hearing;  \n• \nMinister’s appeal of a decision made by a member of the \nImmigration Division; and  \n• \nappeals of overseas decisions on loss of permanent resident status.\nLegislative and \nRegulatory Policy \nDivision, Admissibility \nBranch, CIC, NHQ \nThe Director,Legislative and Regulatory Policy Division, CIC, NHQ is \nresponsible for all admissibility policies, except security, war crimes and \norganized crime. The Director is also responsible for policies related to \nappeal rights and grounds to appeal. \nLitigation Management Litigation Management (BCL) is situated in the Case Management \nBranch, NHQ, and is responsible for the management of CIC and the  \nCBSA’s cases involving litigation in the federal courts of decisions made \nunder IRPA and for Ministerial Appeals before the IAD pursuant to \nA63(5). BCL provides instructions to DOJ lawyers with respect to \npending litigation. \n(For more information on BCL and judicial reviews, see OP 22, Judicial \nReview.) \nInland Enforcement, \nCBSA, NHQ \nThe Director of Inland Enforcement, the CBSA, NHQ is responsible for \nadmissibility hearings as well as appeals of a removal order by a \npermanent resident, a protected person or a holder of a permanent \nresident visa. \n8. \nProcedure: Family class sponsorship appeals \nCIC has the policy responsibility with respect to family class sponsorship and the Minister of C&I \nis the respondent. \n8.1. \nFamily class sponsorship appeals \nIf a Canadian citizen or permanent resident makes an application to sponsor a foreign national as \na member of the family class, and the application is refused, the sponsor may appeal the refusal\nOP 21 Appeals \n2005-10-25 \n \n8 \nof the application to the IAD [A63(1)]. The sponsor must be given the reasons for the refusal and \nalso told of their right to appeal the decision to the IAD. \nDetails regarding loss of appeal rights and exceptions can be found in section 5.8 above. \n8.2. \nNotice of appeal \nWhen an appeal has been filed with the IAD, CIC has 120 days to produce the official record. \nWhere the record is not produced in 120 days, the IAD may schedule the hearing and proceed \nwithout the record. Production of the record for the IAD is a joint process between the visa office \nand the hearings office. It is crucial for all parties with a stake in production of the record to \ncooperate. The following measures would ensure that records are handled more efficiently: \n• \nin the case of family class sponsorship refusals, the notice of appeal will be sent by the IAD to \nthe visa office, with a copy to the appropriate hearings office.  In the case of residency \ndetermination appeals, the IAD will advise the appropriate hearings office which will in turn \nadvise the visa office;  \n• \nthe visa office will acknowledge receipt of the notice by e-mail to the hearings office and \nrecord receipt of notice in CAIPS. The CAIPS notes will indicate receipt of the notice of \nappeal, the IAD file number and the hearings office concerned;  \n• \nthe hearings office will correlate acknowledgments of receipt with notices in order to identify \nundelivered mail. \n8.3. \nProduction of the record \nWhen a notice of appeal has been received, the visa office should complete the following: \n• \nmake a copy of the paper file to keep in the office; \n• \nsend the original file and a copy of the CAIPS notes to the hearings office. The visa office will \nuse a diplomatic bag where possible or a courier where operationally feasible. The file and \nCAIPS notes should be sent within four weeks of the visa office receiving the IAD notice; \nIn cases of family class medical refusals, send the medical file with the visa office file \nwhen the medical and visa officers are at the same visa office. However, photographs \nand x-rays should be kept at the visa office. Keeping the photographs on file will help \nspeed up the issuance of new medical instructions, should this become necessary later \non. For complete instructions for medical officers regarding the appeal process, see OP \n15, Medical Procedures. \nNote: For cases where the medical officer is at another visa office, the medical officer should send the \nmedical file directly to the hearings office. In such cases, the visa office is responsible for informing \nthe medical officer of the name of the sponsor, the file number and the address. The medical officer \nmust include the sponsor's name and the hearings office file number in a covering memorandum. \n• \nenter sending details into CAIPS when the record leaves the office, i.e., dip bag or waybill \nnumber and shipping date;  \nNote: Under IRPA, visa officers are no longer required to prepare a statutory declaration. Therefore, it is \nvital that the CAIPS notes and the refusal letter provide a complete account of the decision made in \nthe case. \n• \ndesignate addresses of appropriate contacts for reminders, i.e., Manager of Registry, \nProgram Manager.\nOP 21 Appeals \n2005-10-25 \n \n9 \nThe hearings office will check CAIPS if the record has not been received within four \nweeks after the visa office acknowledged receipt of the notice. If there is no indication \nthat the record has been sent, the hearings office will send a reminder e-mail to the visa \noffice. The visa office should respond immediately with a case status update. \n8.4. \nProcedures upon receipt of new medical information during an appeal \nIf new medical information is provided during the appeal process, and the medical officer \ndetermines that a new examination is warranted, the visa office must: \n• \ncontact the applicant to request photographs; \n• \nissue new medical instructions within 30 days; \n• \nadvise the applicant that a new medical examination must be conducted within 30 days or, if \nthat is not possible, that the visa office must be informed before the end of the 30-day period \nof a date of a medical appointment. Failure to comply will result in the termination of the \nmedical re-assessment process; \n• \nindicate in CAIPS the date on which the new medical instructions were issued;  \n• \nforward the new assessment by the medical officer to the hearings officer with a copy to the \nIAD;  \n• \nadvise the hearings officer if the applicant does not comply with the instructions to undergo a \nnew medical examination.  \n8.5. \nAppeal allowed \nAfter the 15-day period has elapsed to apply for an application for leave and judicial review, the \nIAD will provide hearings offices with copies of final decisions and reasons in each appeal of a \nrefusal of family class applicants. \nThe IAD forwards its decision to the appropriate hearings office and a copy is then put in the \noriginal client file.  The client file is then returned to the visa office, who may then resume \nprocessing as per the IAD’s decision. \nA70(1) obliges an officer to respect the decision of the IAD in re-examining an application. \nHowever, the officer must review the application to determine whether the application meets all \nother requirements of eligibility and admissibility. Sponsors and applicants are exempt from any \nrequirements that the IAD has set aside in its decision. In rare cases, if there are new grounds of \nineligibility or inadmissibility, or grounds that were not assessed in the first decision, the \napplication may be refused again. \nApplicants may be re-examined as part of a determination. However, re-examination is not \nalways necessary. An officer may not have reason to believe they are now inadmissible for new \ncauses (see OP 15, section 17, Procedure: Allowing appeals). \nIf an officer is satisfied that re-examination will not uncover new inadmissibility, the reasons are to \nbe recorded in the case notes. \nA Permanent Resident Visa is issued unless there are new reasons not to do so. A Temporary \nResident Permit is not issued to overcome the inadmissibility set aside by the IAD. \n8.6. \nAppeal withdrawn \nAppeals are de novo hearings. If the facts no longer support the refusal, the IAD must allow the \nappeal.\nOP 21 Appeals \n2005-10-25 \n \n10 \nHearings officers may resolve cases before the hearing stage; in which case, sponsors withdraw \ntheir appeals, and hearings officers instruct the visa office to resume processing. \nExamples of such instances include the improvement of an applicant's medical condition, a \npositive result from a DNA test of a relationship, or the death of an inadmissible family member. \nWhen a hearings officer instructs the visa office to resume processing because there are no \nlonger any grounds for refusal, the application is treated as if the appeal was allowed (see section \n8.5 above).  The hearings office sends the original file with a copy of the withdrawal or consent to \nthe visa office. \n9. \nProcedure: Loss of residency status appeals \nCIC has the policy responsibility with respect to loss of residency status and the Minister of C&I is \nthe respondent. \n9.1. \nOutside Canada \nA63(4) stipulates that permanent residents may appeal to the IAD against a decision made \noutside Canada on the residency obligation under A28. Pursuant to IAD Rule 9: \n• \nthe notice of appeal must be filed with the IAD Division registry  for the region in Canada \nwhere the appellant last resided;  \n• \nthe written reasons for the loss of status decision must be filed with the notice of appeal;  \n• \nappellants must indicate on the notice of appeal if they want to return to Canada for the \nhearing of the appeal;  \n• \nappellants have 60 days after they receive the written reasons for the decision to file a notice \nof appeal and the written reasons with the IAD Division registry. \nFor information on how to produce the record, see section 8.3 above. \n9.2. \nRequests to return to Canada for the hearing \nA31(3) provides that a permanent resident shall be issued a travel document if an officer is \nsatisfied that: \n• \nthey were physically present in Canada at least once in the last 365 days;  \n• \nthey have made an appeal under A63(4); or  \n• \nthe period for making an appeal has not expired. \nThe situation will arise where permanent residents who do not meet the residency requirement \nrequest a travel document during the 60-day appeal period though they have not filed an appeal. \nPersons in this situation are allowed to enter Canada during the 60-day appeal period even if they \nhave not yet filed an appeal. In cases such as this, the port of entry will notify the hearings office. \nHearings offices should monitor the file to determine if an appeal is filed. When an appeal is not \nfiled within the 60-day period, the file should be referred to investigations. \nWhen an appellant is not eligible for a travel document under A31(3), they may make an \napplication to the IAD requesting to return to Canada for their hearing [IAD Rule 46(1)]. \nApplications must be filed with the IAD and the Minister of C&I no later than 60 days after the \nnotice of appeal is filed. If the IAD is satisfied that the presence of the permanent resident at the \nhearing is necessary, they will order that the permanent resident physically appear at the hearing.\nOP 21 Appeals \n2005-10-25 \n \n11 \nWhere the IAD has ordered that the appellant be physically present, an officer shall issue a \nfacilitation visa for that purpose [A175(2)]. \nFor more detailed information on loss of residency status appeals, see ENF 19, section 12, \nProcedure: Loss of residency status appeals, and see ENF 23, Loss of Permanent Resident \nStatus. \nFor more detailed information on processing residency determination cases, see OP 10, \nPermanent Residency Status Determination."
}