{
  "type": "pdf",
  "source": "Application for Canadian Citizenship_ Adults - Subsection 5(1) CIT 0002 - Canada.ca.pdf",
  "text": "Canada.ca\n \nImmigration and citizenship\n \nIRCC applications\nFind an IRCC application package or form\n\n\n\nApplication for Canadian Citizenship:\nAdults - Subsection 5(1) CIT 0002\nApplications received at our Case Processing Centre (CPC) in Sydney,\nNS March 1, 2021 or later must use forms from October 2020 or later\n(indicated on the lower left corner of the form). Application forms that\nare not up-to-date will be returned as incomplete. IRCC does not\nconsider the date of signatures or mailing to be deciding factors.\nEligibility\nThis form for an application under subsection 5(1) is intended primarily for\npermanent residents aged 18 and over who want to apply for Canadian\ncitizenship.\n\nTo be eligible for Canadian citizenship, you:\nmust be 18 years of age or older on the day you sign the application\nmust be a permanent resident (landed immigrant) of Canada\nmust have been physically present in Canada for at least 1,095 days in\nthe 5 years immediately before you apply\nmay need to file personal income taxes for at least 3 years within the 5-\nyear period\nFind out if you need to file your taxes\nmust demonstrate adequate knowledge of English or French (if you are\nbetween 18 and 54 years old when you apply)\nmust demonstrate you have knowledge of Canada and of the\nresponsibilities and privileges of citizenship (if you are between 18 and\n54 years old when you apply - this is assessed after you apply)\ncan’t have any unfulfilled conditions relating to your permanent\nresident status\ncan’t be under a removal order (asked by Canadian officials to leave\nCanada)\ncan’t be inadmissible or prohibited on criminal or security grounds\nUse this tool to check if you’re eligible to apply.\nIf you are not sure whether you have Canadian citizenship or not, see if you\nmay already be a citizen.\nApplication Package\nMost applicants can now apply online to become a Canadian citizen.\nThe application package includes an instruction guide and all the forms you\nneed to fill out.\nThe application package includes:\n1. Instruction Guide\n2. Application for Canadian Citizenship – Adults (CIT 0002) \n3. Document Checklist (CIT 0007) \n4. Citizenship Photo Specifications\nIf required:\n5. Residence Outside Canada (CIT 0177) \n6. Use of a Representative (IMM 5476) \n\nRecord your trips outside Canada. It will help you calculate your physical\npresence in Canada.\nTravel journal\n\n\n\n\n7. Request to Correct a Date of Birth for a Permanent Resident Document\nor Citizenship Certificate [IRM 0003] (PDF, 2.4 MB)\n8. Request form for a Change of Sex or Gender Identifier (IRM 0002) \nPrepare a complete application\nTo make sure you submit all the pages of the application form with your\napplication package, follow these steps:\n1. Click the “Validate” button at the top or bottom of the form.\nNote: Validating the form before printing makes sure that you have\nanswered all the questions. This will help you to avoid delays in\nprocessing your application.\n2. A last page with barcodes will automatically be created.\n3. Print and sign the form.\nNote: For best results print on white, bond-quality, non-glossy paper\nusing a laser printer.\n4. Place the barcode page on top of your package. If you have more than\none package, place a separate barcode page on each one.\nFind out more about the barcode form.\n Get help to open an application form or to fill one out in the Help Centre.\n\nTrack your application\nIf you’re submitting a paper application, we recommend you use a\npostal or courier service with tracking so you have proof your\napplication was delivered.\nFind out how to check if your application has been received\nDate modified:\n\nSave Time: Send a\nComplete\nApplication\nHow-to video\nCome to Canada\nFind out if you\nare eligible\n2025-01-29"
}