{
  "type": "pdf",
  "source": "Apply for permanent residence through Express Entry - Canada.ca.pdf",
  "text": "Canada.ca\n \nImmigration and citizenship\n \nLive in Canada\nImmigrate through Express Entry\n\n\n\nExpress Entry\nWho can apply\nCheck your score\nGet your documents ready\nCreate your profile\nGet your documents ready\nRounds of invitations\nApply for permanent residence\nAfter you apply\nApply for permanent residence\nOn this page\n1. Fill out the application form\n2. Upload your documents\n3. Pay the fees\n4. Submit your application\n1. Fill out the application form\nIf we invite you to apply for permanent residence, you'll get a message\nin your account telling you:\nwhich program you've been invited to apply for\nwhat to do next\nYour invitation to apply is valid for 60 days only. Start filling out the\napplication form right away, so that you can get all the information and\ndocuments you need before your invitation expires.\nIf we approve your application\nTo fill out the application form:\n1. Sign in to your account.\n2. Go to “Continue my profile / application, not yet submitted”.\n3. On the right-hand side of the row with “application type” as\n“permanent residency,” choose the blue “Continue application”\nbutton.\nSign in to your IRCC secure account\nHelp filling out the application form\nThe form will ask if you’ve applied to IRCC before. This means a\nfull application – for example, for a visa, a work permit, another\nimmigration program. Filling out an Express Entry profile doesn’t\ncount.\nIt will also ask if you’ve applied for Express Entry before.\nSimilarly, you should only answer “yes” if you filled out a\npermanent residence application and submitted it electronically. A\nprofile on its own, even if you got an invitation to apply, doesn’t\ncount as applying.\nIf you're not invited to apply\nIf you’re not invited to apply within 12 months of submitting your\nExpress Entry profile, it will automatically expire. You can see this\ndate in your account.\nWhen your profile expires, it will be removed from the system. You\nwill get a message in your account.\nYou can still create a new profile. If your profile is about to expire,\nyou can print out screen shots of your profile to make it easier to\nre-enter your data.\nDon’t create a new profile until your existing profile expires. If you\ndo, you’ll need to withdraw your existing profile first.\nTo withdraw your profile:\n1. Sign in to your account.\n2. Go to “View the applications you submitted” on the main page.\n3. Click the “Withdraw profile” link.\n4. Click the “Continue” button below the “Warning!” text.\nIf you don’t submit a new profile, you can’t mention Express Entry\nin your profiles on any job boards.\nIf you submit a new profile, you’ll get a new:\nExpress Entry profile number\nJob Seeker validation code for Job Bank\nOther ways to immigrate\nYou may consider applying directly to a province or territory\nthrough the Provincial Nominee Program or find out about other\noptions to immigrate to Canada.\nIf you decline your invitation to apply\nIf you decline an invitation, you'll be put back into the Express Entry\npool of candidates. You'll be considered in future rounds of\ninvitations, if you’re still eligible.\nThe cut-off score varies from round to round. If your score isn’t\nhigh enough, you might not be invited to apply again. In some\ncases, you may have to take steps to be invited to apply again. For\nexample, you may need to:\nimprove your score\nupdate your Express Entry profile\nThere is no guarantee that you'll be invited to apply again.\nHowever, if you choose to re-enter the pool, declining an invitation\nwon't affect whether or not you’re invited to apply later.\nIf you don't decline an invitation and you don't apply within 60\ndays, the invitation will expire and your profile will be removed\nfrom the pool. To be considered in future rounds of invitations\nyou'll have to:\nfill out and submit a new Express Entry profile\nmeet the eligibility\nbe accepted into the pool again\nIf your personal situation changes\nIf your situation (or that of your spouse or common-law partner)\nchanges, you should re-calculate your score before applying online\nfor permanent residence.\nIf your recalculated score is less than the lowest score in your\nround of invitations, you should decline the invitation. If you decide\nto apply anyway, we may:\nrefuse your application\nnot refund your application fee\nSome examples of changes that could lower your score:\nyou no longer have a valid job offer\nyou no longer have a provincial nomination\nyour language test scores:\nhave expired\nare lower after you were retested\nIf your work permit expires before you apply\nIf your work permit expires before you apply, your score may\ndrop. For example, this could happen if you got points for a job\noffer based on the expired work permit.\nIf your score drops below the minimum cut-off:\nYou should decline the invitation.\nIf you submit your application anyway, we’ll refuse it.\nAfter you decline:\nYou’ll be put back in the pool.\nUpdate your Express Entry profile to show the change in your\nwork status.\n2. Upload your documents\nGet the right documents\nYou’ll need to upload copies of the documents you used for your profile. The\nsystem gives you a personalized document checklist once you’ve completed\nthe online form.\nMost applicants will also need to upload:\npolice certificates\nproof of funds\nbirth certificate, if you’re declaring dependent children\nUse of a Representative form [IMM 5476], if you’ve hired a\nrepresentative\ncommon-law union form [IMM 5409], if you’ve declared your marital\nstatus as “common-law”\nmarriage certificate, if you’ve declared your marital status as “married”\ndivorce certificate and legal separation agreement, if you’ve declared\nyour marital status as “divorced”\ndeath certificate, if you’ve declared your marital status as “widowed”\nadoption certificate, when a dependent child is listed as “adopted”\nOther documents you might need\nYou only need to submit these if we included them in your\npersonalized document checklist:\nproof of relationship to a relative in Canada\ndigital photos to confirm your identity\nother name to confirm aliases\nauthority to release personal information to a designated\nindividual form [IMM 5475]\nany other documents that you feel are relevant to your application\nYour application may be refused or rejected if you don’t submit these\ndocuments. They’re used to check if you meet the requirements of the\nprogram you’re applying for.\nTranslation of documents\nIf one of your documents is in a language other than English or French,\nyou must also upload:\nan English or French translation that’s:\nstamped by a certified translator\nThe translator should photocopy your original document\nand stamp it if that’s what they based the translation on.\nAll stamps and seals that aren’t in English or French must\nalso be translated.\nYou can include a scanned copy of a letter explaining that\nyou don’t need an affidavit because you used a certified\ntranslator.\nor\naccompanied by an affidavit from the person who completed\nthe translation\nUse this option only if a translation cannot be completed\nby a certified translator.\nBoth the translated document and the original document\nthe translator worked from must be referred to in the\naffidavit.\nand\na scan of the original document, or a scan of a certified photocopy\nof the original document that the translator worked from\nYou only need to provide a scan of a certified photocopy of\nthe original document if the translation was based on the\ncertified photocopy.\nHow to sign PDF forms\nHand signature (also called a wet signature): Print and sign the\nform by hand.\nDigital signature: Insert on PDF forms. You can type your name,\nuse DocuSign or use secure signatures.\nScan and upload\nGather all the documents on your checklist and make electronic copies using\na scanner or camera. Make sure you use one of the formats we accept.\nOnce you have your documents ready, upload them in your document\nchecklist.\nGet a medical exam, if you need one\nAn immigration medical exam (IME) from a panel physician is a requirement\nfor permanent residence. Your family members must also have a medical\nexam, even if they aren’t coming with you.\nIf you've never had a medical exam\nIf you've had a medical exam before\n3. Pay the fees\nOur permanent residence fees increased on April, 2024\nIf you paid your fees before April 30, 2024, but have not yet\nsubmitted your complete application, you will need to pay the\ndifference.\nThe system will show you a list of fees you need to pay, including:\nprocessing fee for you and your family members\nright of permanent residence fee\nbiometrics fee\nFind out how much you can expect to pay\nPay your fees through your IRCC secure account. You’ll need a debit or\ncredit card to do this.\nAt a minimum, you must pay your processing fees when you submit\nyour application. Avoid delays by paying all of your fees now (including\nyour right of permanent residence fee).\nRefunds\n\nAfter you apply\nPaying fees after you apply\n4. Submit your application\nBefore you submit your application, make sure you:\nfill out all mandatory fields on the form\npay your processing fee and biometrics fee\ninclude clear scans of all documents listed in your checklist\nThe system won’t let you submit the application unless you include all the\nrequired documents and fill out all the mandatory form fields.\nSign in to your IRCC secure account\nDate modified:\n2025-02-13\n"
}