{
  "type": "pdf",
  "source": "Biometrics When to give your fingerprints and photo – permanent resident applicants - Canada.ca.pdf",
  "text": "Canada.ca\n \nImmigration and citizenship\n \nBiometrics\nIRCC sign in\n\n\nBiometrics\nWho needs to give their biometrics\nWhen to give your biometrics\nWhen to give your biometrics – temporary resident applicants\nWhen to give your biometrics – permanent resident applicants\nHow to give your biometrics\nWhere to give your biometrics\nWhat happens after you give your biometrics\nWhen to give your biometrics –\npermanent resident applicants\nYou must give your biometrics every time you apply for permanent\nresidence, even if you’ve already given them.\nThere are some special cases where you may not need to give your\nbiometrics. If your case is not the same as one of these special cases, you\nmust give your biometrics.\nSpecial cases\nIf you’ve given your biometrics and you want to\napply for temporary residence\nYou don’t need to give your biometrics when you apply for\ntemporary residence if you already gave them when you applied for\npermanent residence.\nWe will reuse your permanent resident biometrics in support of your\ntemporary resident application while your permanent resident\napplication is open.\nIf your permanent resident application is refused, you can’t use your\nbiometrics for any future applications.\nPermanent resident card applicants\nYou don’t need to give your biometrics when you apply for a\npermanent resident card unless the example below describes your\nsituation.\nExample:\nYou must give your biometrics when you initially apply for, or when you\nrenew your PR card in the following case:\nYou were exempt from giving biometrics when you initially applied for\npermanent residence because you were under 14 years of age. You are\nnow 14 or older and you’ve either\narrived in Canada or\nyou applied to renew your PR card\nPermanent resident travel document applicants\nYou don’t need to give your biometrics when you apply for a\npermanent resident travel document.\nDate modified:\n2024-10-23"
}