{
  "type": "pdf",
  "source": "Biometrics Who needs to give their fingerprints and photo - Canada.ca.pdf",
  "text": "Canada.ca\n \nImmigration and citizenship\n \nBiometrics\nIRCC sign in\n\n\nWho needs to give their fingerprints\nand photo\nBiometrics\nWho needs to give their biometrics\nWhen to give your biometrics\nHow to give your biometrics\nWhere to give your biometrics\nWhat happens after you give your biometrics\nOn this page\nWho needs to give their fingerprints and photo (biometrics)\nWho’s exempt from giving their biometrics\nIf you’re not sure whether you need to give your biometrics\nWho needs to give their fingerprints and\nphoto (biometrics)\nUnless you’re exempt, you need to give biometrics when you apply for\na visitor visa\nan initial work or study permit or extension (excluding US nationals)\nan extension of your stay in Canada (visitor record) unless you’re from a\nvisa-exempt country\nIf you’re visiting from visa-exempt country, you’re exempt from\ngiving biometrics when you apply to extend your stay.\npermanent residence\na new PR card, for applicants who were previously exempt because of\ntheir age (i.e. they were 13 years of age or younger when they applied\nfor PR)\nrefugee or asylum status\nTemporary resident applicants\nIf you’ve given your biometrics before\nyou may not need to give your biometrics when you apply\nwe can’t issue you a visa or permit for longer than 10 years from the last\ndate you gave your biometrics.\nIf you’d like a visa or permit for longer than your current biometrics are\nvalid for, you can choose to give your biometrics again, even if they’re still\nvalid.\nLearn how to give your biometrics voluntarily.\nForeign nationals applying with a travel document\nthat’s not a passport\nYou need to give your biometrics, regardless of the country of issue, if\nyou’re applying with one of the following:\na refugee travel document\na certificate of identity or\na valid US Refugee Travel Document (alien’s passport) and official proof\nof your lawful permanent resident status\nfor lawful permanent residents of the US only\nWho’s exempt from giving their\nbiometrics\nYou don’t need to give your biometrics if you’re\na Canadian citizen or citizenship applicant (including passport\napplicants)\nan existing permanent resident\na visa-exempt national coming to Canada to visit only\na head of state or head of government\nan applicant who qualifies for or holds a diplomatic or official visa\nUS visa holder transiting through Canada\nan applicant applying for a visitor visa, a study permit or a work permit\nwho has already provided biometrics for a permanent resident\napplication that’s still being processed\na child under the age of 14\nan applicant over the age of 79\nThere is no upper age exemption for asylum claimants.\nHow we assess the age of the applicant\nWe use the age you were when you submitted your application. If your child\nwas 13 or under when you submitted the application, the child doesn’t need\nto give biometrics. If you were 79 or younger on the date you submitted\nyour application, and you are now 80, you must give your biometrics.\nIf you’re not sure whether you need to\ngive your biometrics\nYou can answer a few questions to find out if you need to give biometrics.\nDate modified:\n2025-02-26"
}