{
  "type": "pdf",
  "source": "Biometrics When to give your fingerprints and photo – Temporary resident applicants - Canada.ca.pdf",
  "text": "Canada.ca\n \nImmigration and citizenship\n \nBiometrics\nIRCC sign in\n\n\nBiometrics\nWho needs to give their biometrics\nWhen to give your biometrics\nWhen to give your biometrics – temporary resident applicants\nWhen to give your biometrics – permanent resident applicants\nHow to give your biometrics\nWhere to give your biometrics\nWhat happens after you give your biometrics\nWhen to give your biometrics –\nTemporary resident applicants\nOn this page\nIf you haven’t given your biometrics before\nIf you’ve given your biometrics before\nIf your application was refused because you didn’t give biometrics\nIf you haven’t given your biometrics\nbefore\nYou must give your biometrics when you apply for your visitor visa, study or\nwork permit, unless you’re exempt.\nFind out how to give your biometrics.\nIf you’ve given your biometrics before\nYour biometrics are valid for 10 years. If you gave your biometrics within the\nlast 10 years\nthey’ll be automatically attached to your new visitor visa, work or study\npermit, or extension\nyou don’t need to give them every time you apply for temporary\nresidence\nHowever, we can’t issue your visa or permit beyond the expiry date of your\nbiometrics. If you want a visa or permit for a longer period of time, you can\nextend the validity of your biometrics by giving them again when you apply,\neven if they’re still valid.\nCheck the status of your biometrics\nFind out if your biometrics are still valid and when they expire using\nthe Check status tool.\nHow to extend the validity of your biometrics\nEven if your biometrics are still valid, you can choose to give them again so\nyour visa or permit is valid for a longer period of time.\nFollow these steps when you apply for your visa or permit:\n1. Pay the biometrics fee when you apply, unless you’re exempt.\n2. Wait for your biometric instruction letter (BIL). You must use the BIL\nthat was issued for this application.\n3. Follow the instructions on your new BIL to book an appointment to give\nyour biometrics again.\nYou must give your biometrics at an official biometric collection\nlocation either inside or outside Canada.\nIf your visa or permit has been issued for a shorter\nperiod of time because of your biometrics validity\nWe can’t issue a visa or permit more than 10 years from the last time you\ngave your biometrics.\nOnce your visa or permit has been issued, you can’t give your biometrics\nagain to extend the validity of your document.\nIf you want to have a visa or permit with a longer validity, you must\napply for a new visa or apply to extend your stay as a visitor, worker or\nstudent\npay the associated fees (including the biometrics fee)\ngive your biometrics again\nIf your application was refused because\nyou didn’t give biometrics\nIf your application has been refused, don’t try to give your biometrics.\nGive your biometrics only if you\nreapply\npay the associated fees, including the biometrics fee\nreceive a new BIL\nIf you use your old BIL, there may be delays in your application processing,\nor your application may be refused.\nDate modified:\n2024-09-05"
}