{
  "type": "pdf",
  "source": "Biometrics What we do after you give us your fingerprints and photo - Canada.ca.pdf",
  "text": "Canada.ca\n \nImmigration and citizenship\n \nBiometrics\nIRCC sign in\n\n\nWhat we do after you give us your\nfingerprints and photo\nBiometrics\nWho needs to give their biometrics\nWhen to give your biometrics\nHow to give your biometrics\nWhere to give your biometrics\nWhat happens after you give your biometric\nOn this page\nSharing information\nHow your information is stored and transmitted\nYour rights\nWho to contact for privacy concerns\nAfter you give your biometrics, your fingerprints and photo will be\nencrypted and sent electronically to a secure Government of Canada\ndatabase. Encryption stops anyone from accessing the information unless\nthey’re given access.\nSharing information\nWhile we process your application, we’ll share your biometric information\nwith the Royal Canadian Mounted Police (RCMP). They’ll check your\nfingerprints against the fingerprint records of:\ncriminals\nrefugee claimants\ndeportees\ntemporary resident applicants\nThis information is used support an decision on your application.\nWe may also share your biometrics information with\nother law enforcement agencies in Canada to enforce any Canadian or\nprovincial law or\nCanadian government institutions or foreign governments according to\nCanada’s privacy laws\nYour fingerprints and photo may also be shared with the US, the United\nKingdom (UK), Australia and New Zealand in a way that respects\nprivacy laws\ncivil liberties\nhuman rights (including the Canadian Charter of Rights and Freedoms)\nYour fingerprints and photo will be shared with the Canada Border Services\nAgency so that they may verify your identity upon arrival in Canada.\nHow your information is stored and\ntransmitted\nBiometrics collection service locations, (VACs, ASCs and Service Canada\nlocations) don’t keep your biometric information. Your information is\ndeleted from the collection system once it’s sent to IRCC.\nYour rights\nYou can refuse to give your biometrics. However, if you decide not to give\nyour biometrics, we may refuse your application.\nCanada’s Privacy Act protects you. You have the right to\naccess and\ncorrect errors in your information\nOur Personal Information Bank (PIB) stores your personal information.\nYou can see or update your information by sending us an access to\ninformation request. You must include the following PIB numbers with\nyour request:\nPIB IRCC PPU 039, 068 and 042 for personal information\nPIB RCMP PPU 030 for fingerprints\nFind out more about our PIBs.\nWho to contact for privacy concerns\nIf you have concerns about the collection or control of your biometrics (as it\nrelates to Canada’s Privacy Act and privacy policies), contact the Office of\nthe Privacy Commissioner of Canada:\nAddress\n30 Victoria Street\nGatineau QC K1A 1H3\nTelephone\nToll free in North America: 1-800-282-1376\nFrom anywhere in the world: 819-994-5444\nTTY: 819-994-6591\nDate modified:\n2024-10-23"
}