{
  "type": "pdf",
  "source": "Biometrics_ How to give your fingerprints and photo - Canada.ca.pdf",
  "text": "Canada.ca\n \nImmigration and citizenship\n \nBiometrics\nIRCC sign in\n\n\nHow to give your fingerprints and\nphoto\nBiometrics\nWho needs to give their biometrics\nWhen to give your biometrics\nHow to give your fingerprints and photo\nWhere to give your biometrics\nWhat happens after you give your biometrics\nIf you need to give biometrics as part of your application, follow the steps\nbelow.\nOn this page\nStep 1: Pay the biometrics fee\nStep 2: Get the biometric instruction letter\nStep 3: Go to an official biometric collection site\nStep 1: Pay the biometrics fee\nYou must pay the biometrics fee when you apply, or you may experience\ndelays.\nBiometrics fees\nThe fee you pay depends on your situation:\nIndividual applicant: CAN$85\nFamilies applying at the same time (2 or more members of a\nfamily): maximum total fee of CAN$170\nFamily members eligible for this fee include\nyour spouse and common-law partner\nyour dependent children or their dependent children\nCheck if your child is a dependant.\nGroups of 3 or more performing artists and their staff applying for\nwork permits at the same time: maximum total fee of CAN$255\nTransit visa applications: There is no fee to give biometrics for a\ntransit visa.\nPay your biometrics fee\nStep 2: Get the biometric instruction\nHow to pay the biometrics fee after you’ve applied\nTo pay for your biometrics fee after you already applied:\nIf you applied online, you should\npay online\nupload your receipt in your IRCC secure account or by using\nour web form\nIf you applied on paper, you should\npay online\nupload your receipt using our web form\nletter\nAfter you pay the biometric fee, you’ll get a biometric instruction letter (BIL)\nthat\nconfirms that you need to give your biometrics\ntells you how to book a biometrics appointment\nWhen you go to your biometrics appointment, you must bring both of the\nfollowing documents:\nyour BIL\nyour valid passport\nAsylum claimants and protected persons with no passport\nIf you’ve been issued a biometric instruction letter but you don’t have a\npassport, you must bring one of the following documents to your\nappointment:\nyour refugee protection identity document (or refugee protection\nclaimant document) (valid or expired) with your photo attached\na certified copy of your passport\nThis exception applies to you if you’re\nan asylum claimant, and your claim\nis in process\nUse the BIL you received as part of your current\napplication\nIf you try to give your biometrics with a BIL from a previous application\nthere may be delays in the processing of your current application or\nyour current application may be refused\nStep 3: Go to an official biometric\ncollection site\nThere are 4 things you need to know before you give your biometrics:\n1. You must give your biometrics in person.\n2. You need to make an appointment to give your biometrics.\nhas been found ineligible\nhas been rejected by the Immigration and Refugee Board of\nCanada (IRB)\na protected person, including people\nwhose asylum claims have been accepted by the IRB\nwho have been successful in a Pre-Removal Risk Assessment\napplication\na. If you’re visiting a visa application centre, booking ahead is best.\nHowever, some walk-in or emergency appointments may be\naccommodated.\nb. For biometric collection at a designated Service Canada office or a\nU.S. application support centre, an appointment is required.\nc. Booking an appointment is free.\n3. Book your appointment as soon as you get your BIL.\n4. To avoid fraud, use our official website to find your local visa application\ncentre, Service Canada (Canada only) or a United States (U.S.)\nApplication Support Center (U.S. only) location.\nFind a collection site close to you\nTips to get the best photos and fingerprints during\nyour biometrics appointment\nglasses\nYour eyes must be clearly visible.\nThere must be no glare on the lenses.\nhair down or up\n  What can be included\nYour hair must be off your face so that the edges of your\nface are visible.\nhats and head coverings worn daily for religious beliefs or\nmedical reasons\nYour full face must be clearly visible.\nThe head covering must not create shadows on your face.\na wheelchair, if you place a white blanket behind your head\nYour facial features and the edges of your face must both be\nclearly visible.\nsunglasses or tinted eye glasses\nThis includes prescription lenses, even when your eyes are\nclearly visible.\nhats and head coverings not worn daily for religious beliefs or\nmedical reasons\nhands must be henna-free\nTemporary hand injuries such as cuts, cracks on your fingers\nmust be healed before giving your biometrics.\n  What can’t be included\nDate modified:\n2025-07-15\nNote: If we can’t get high-quality fingerprints during your appointment,\nyou may need to give your biometrics again at a later date."
}