{
  "type": "pdf",
  "source": "Detention.pdf",
  "text": "1 \n \n \n \n \n \n \n \n \n \n \n \n \n \nENF 20 \nDetention\n2 \n \nTable of contents \nUpdates to chapter - Listing by date......................................................................................................... 3 \n1. \nWhat this chapter is about ........................................................................................................ 7 \n2. \nDefinitions ................................................................................................................................ 7 \n3. \nProgram objectives................................................................................................................... 8 \n4. \nThe act and regulations ............................................................................................................ 9 \n4.1. \nAuthority to arrest and detain a person ...................................................................................... 9 \n4.2. \nRegulatory factors and conditions ........................................................................................... 11 \n4.3. \nForms and publications ........................................................................................................... 14 \n5. \nInstruments and delegations ................................................................................................... 16 \n6. \nDepartmental policy ................................................................................................................ 16 \n6.1. \nPrinciples ............................................................................................................................... 16 \n6.2. \nGeneral .................................................................................................................................. 17 \n6.3. \nNational immigration detention standards ................................................................................ 17 \n6.4. \nAlternatives to Detention ........................................................................................................ 18 \n6.5. \nDetention of minor children (under 18 years of age) ................................................................ 18 \n6.6. \nVulnerable persons ................................................................................................................ 24 \n6.7. \nLong-term detention and jurisprudence ................................................................................... 25 \n7. \nDetention facilities .................................................................................................................. 26 \n8. \nDetentions program monitoring ............................................................................................... 27 \n8.1. \nCanadian Red Cross .............................................................................................................. 27 \n8.2. \nUnited Nations High Commissioner for Refugees (UNHCR) .................................................... 29 \n9. \nProcedure: Detention ............................................................................................................. 29 \n9.1. \nData entry .............................................................................................................................. 30 \n9.2. \nOrder for Detention................................................................................................................. 32 \n9.3. \nDetainee medical needs ......................................................................................................... 32 \n9.4. \nProcedure: National risk assessment for detention – initial and subsequent assessments ....... 33 \n9.5. \nTriage: IHC review of the initial NRAD – placement and classification...................................... 38 \nOngoing classification and placement of detainees within detention facilities ........................... 39 \n9.6. \nManagement review of detention cases for quality assurance ................................................. 40 \n9.7. \nReview of Detention ................................................................................................................ 41 \n9.8. \nDetention review after 48-hours and informing the IRB ............................................................ 41 \n10. \nCare of detainees ................................................................................................................... 42 \n10.1. \nProcedure: Request for personal items or blankets while in a short-term detention room or \ncell.......................................................................................................................................... 42 \n10.2. \nProcedure: suicidal and self-harmful detainee ......................................................................... 43 \n10.3. \nIn-custody death or life threatening condition ........................................................................... 44 \n11. \nTransfer of detainees to an IHC .............................................................................................. 45 \n11.1. \nWhen a detainee placement or transfer should be considered ................................................. 47 \n11.2. \nRequirements ........................................................................................................................ 47 \n11.3. \nPlacement and transfer refusal ............................................................................................... 48 \n11.4. \nNotification ............................................................................................................................. 49 \n11.5. \nTransport ............................................................................................................................... 50 \n12. \nProcedure: release by officer before the first detention review ................................................. 51 \n12.1. \nRelease: mandatory arrest and detention of a designated foreign national............................... 53 \n12.2. \nTemporary releases ............................................................................................................... 53 \nAnnex A – Detention Oversight Form ..................................................................................................... 54 \nAnnex B – Child protection services and family centres .......................................................................... 56 \nAnnex C – Provincial definitions of a minor ............................................................................................ 58 \nAnnex D – Language Profile of Provincial Correctional Facilities ............................................................ 59 \nAnnex E – Protocol Regarding the Death of an Individual Detained Pursuant to the Immigration and \nRefugee Protection Act ......................................................................................................... 65\n3 \n \nUpdates to chapter - Listing by date \n \n2023-01-16 \n \nSection 1: Amended Chapter description. \nSection 2: Updated definitions. \nSection 3: Added a third objective which supports CBSA’s responsibility for the enforcement of the IRPA. \nSection 4.1: Changed title to Authority to arrest and detain a person. \nSection 4.3: Removed the BSF508 detention notes form. Added form BSF920, Review of Detention. \nAdded the new form BSF921, Detention Oversight Form. \nSection 6: Removed reference to A34(2) which was repealed. Removed the following sections: Grounds \nfor Detention; Factors: danger to the public; Factors: unlikely to appear; Factors: identity not established; \nFactors: detention on entry to complete the examination; Factors: detention on entry for suspected \ninadmissibility on grounds of security, violating human or international rights, serious criminality, \ncriminality or organized criminality; Factors: mandatory arrest and detention of designated foreign \nnational; Other regulatory factors and best interest of the directly affected child. Added vulnerability factor \nto address GBV+ considerations \nSection 6.6: Include requirement for an assessment of the files of all vulnerable individuals to determine \nsuitability for CCMS referral, and for vulnerable individuals to have daily interaction with CBSA staff at \nIHCs if appropriate. \nSection 7: Detention facilities, has been updated following the opening of BC IHC and new location of the \nLaval IHC. An updated list of provincial agreements has been provided. \nSection 8.1: Updated to reflect changes in the updated agreement with the Canadian Red Cross. \nSection 9: Removed references to the Detention Notes form. Added the requirement to notify the duty \nmanager, Hearings, and Detentions (CLO/DLO) of any new detention. Removed section on the detention \nnotes form. \nSection 9.3: Include timelines for completed DMNs to be uploaded into GCMS. \nSection 9.4: Placement: NRAD has been revised. The review of the initial detention placement has been \nrevised for IHC regions (Québec, Greater Toronto Area and Pacific) and for non-IHC regions. Include \nrequirement for supervisor to review subsequent re-assessments. Form BSF754 has been updated. \nAdded definition of major breach. Added requirement to consider the detainee’s preferred language of \nservice. Include timelines for completed NRADs to be uploaded into GCMS. Include requirement for an \nassessment of the files of all vulnerable individuals to determine suitability for CCMS referral, and for \nvulnerable individuals to have daily interaction with CBSA staff at IHCs if appropriate. \nSection 9.5: Triage Policy added. \nSection 9.6: Management review of detention cases has been revised. Management review of the \ndetention to be recorded on the Detention Oversight Form. Instructions included for correcting errors on \ncompleted forms. \nSection 10: Update to care of detainees \nSection 10.1: Added procedure on the use of personal items or blankets for detained individuals in short \nterm care. \nSection 10.2: Updated language for improved clarity on monitoring of individuals on enhanced watch. \nInclude requirement for an assessment of the files of all vulnerable individuals to determine suitability for \nCCMS referral, and for vulnerable individuals to have daily interaction with CBSA staff at IHCs if \nappropriate. \nSection 10.3: Updated for clarity.\n4 \n \nSection 11: Section updated to improve readability. IHCs and areas served now includes the BC IHC. \nUpdated note that contracted security guards cannot transport detainees by air. \nSection 12: Added the Review of Detention Form (BSF920). \nSection 12.2: Updated the Authority to Release from Detention form BSF566 to facilitate short temporary \nreleases. \nAnnex:  Removed National Directive for the Detention or Housing of Minors. Text incorporated into \nSection 6. \nAnnex A: Changed to Detention Oversight Form \nAnnex D: Language Profile of Provincial Correctional Facilities \nAnnex E: Protocol Regarding the Death of an Individual Detained Pursuant to the Immigration and \nRefugee Protection Act \n \n2020-03-23 \n \n6.7, Factors: detention on entry to complete the examination, clarifications have been added regarding \nurgent medical treatments. \nSection 6.10: Other regulatory factors and 6.11, Detention of minor children (under 18 years of age), \nhave been updated following the introduction of two IRPR amendments. \nSection 7: Detentions facilities has been updated. \nSection 9: Procedure: detention, the table has been updated. \nSection 9.1: Multiple sections have been reorganized to ease the reading. \nSection 4.3: Forms and publications, Detention Cell Log and Instructions (BSF481) and Detention Cell \nLog (BSF481-1) have been merged. The BSF508, previously named Review of Detention by Officer, has \nbeen revised and renamed to Detention Notes. \nSection 6.6: Factors: identity not established, paragraphs on cooperation have been revised. \nSection Data entry has been updated. \nSection 9.3: Order for Detention has been created. \nSection 9.4: Detainee medical needs, subsequent assessment requirements and section 9.5, \nPlacement: National risk assessment for detention have been revised. \nSection 9.6: Management review of detention cases has been revised to streamline the reviewing \nprocess. \nSection 10.2: In-custody death or life threatening condition notification has been created. \nSection 11 to 11.6: created to clarify the placement and transfer of detainees from a non-IHC regions to \nan IHC. \nSection 12: Procedure: release by officer before the first detention review, the table has been updated. \nSection 13: Transitional measures, has been erased. \nAnnex A: Detentions check list has been created. \nAnnex B: National directive for the detention or housing of minors has been updated following the \nintroduction of two IRPR amendments. \n \n2018-11-20 \n \nSection 3.1: Authority to detain a person, Section 3.2 Regulatory factors and conditions, Section 5.3 \nGrounds for detention and section 5.8 have been updated with the coming into force of the Protecting \nCanada’s Immigration System Act. \nSection 3.3: Forms and publications, available gender identities has been clarified. \nSection 5.4 to 5.8: have been moved and updated with new detention factors. \nSection 5.9, Factors: mandatory arrest and detention of designated foreign national has been created.\n5 \n \nThe section on the Alternatives to Detention has been removed and transferred to the ENF 34. \nSection 5.12: housing of minor children (under 18 years of age), has been added. \nSection 5.13: vulnerable groups, the term “vulnerable groups”, has been renamed ‘’vulnerable persons’’. \nSection 5.13 and 5.14: redundant text have been moved and a new jurisprudence case has been added. \nSection 7, Detention: procedure, has been reshaped to facilitate its use by officers. \nSection 7.2: Officer’s detention notes, has been moved. \nSection 7.3: Management review of detention decision, has been updated. \nSection 8: Care of the detainee while awaiting transfer and Section 8.1 Procedure: suicidal and self- \nharmful detainee have been added. \nSection 9.1: National risk assessment for detention, clarifications have been added regarding offences \nwhere a detainee was found not guilty and common crime examples have been added. \nSection 9.3: Vehicular transport of detainees has been added. \nSection 10: Procedure: release by officer before the first detention review, has been modified and section \n10.1 has been added with information regarding release of designated foreign nationals. \nSection 12.1: Canadian Red Cross, has been updated to add information regarding the CBSA \nnotification requests. \nAnnex A: Detentions check list has been created \nAnnex C: Child protection services and family centres, was been updated with information for Atlantic \nand Prairies regions. \n \n2018-02-12 \n \nENF 20 has been updated to reflect changes to the “National Risk Assessment” and “Detainee Medical \nNeeds” forms. Further, changes have been made to reflect the decision-making process regarding \ndetention. These changes will ensure that officers have clear guidance regarding detention decisions and \nplacement of a detainee in a Canada Border Services Agency Immigration Holding Centre or provincial \ncorrectional facility. \nSection 1, “What this chapter is about”, has been updated to add contact information. \nSection 3.3, “Forms and publications”, has been amended, and the brochure titled “Information for People \nDetained Under the Immigration and Refugee Protection Act” has been added. \nSection 5.8, “Identity”, has been amended to remove information contained in other sections. \nSection 5.10, “Detention of minor children (under 18 years of age)”, has been amended, and a new \nreference to the “National Directive for the Detention or Housing of Minors” has been added in Annex A. \nSection 5.11, “Vulnerable groups”, has been moved and updated to include new vulnerable groups. \nSection 5.12, “Alternatives to detention”, and section 5.13, “Third party risk management programs”, have \nbeen removed as their content will be in ENF 34. \nMultiple sections have been updated to reflect the name change of Citizenship and Immigration \nCanada (CIC) to Immigration, Refugees and Citizenship Canada (IRCC) and of the Minister of Citizenship \nand Immigration to the Minister of Immigration, Refugees and Citizenship. \nSection 6, has been updated with new definitions for “alternatives to detention”, “best interests of the \nchild” and “unaccompanied minor”. \nSection 8.1, “Procedure: Review of Detention Decision”, has been created to clarify when the officer’s \ninitial detention decision must be reviewed by another officer. \nSection 8.2, “Informing the Immigration and Refugee Board of a Detention review”, has been created. \nSections 9, 9.1, 9.2 and 9.3, “Transfer of a detainee”, have been rewritten to include new directives \nregarding the national risk assessment for detention form, the detainee medical needs form and the \nvehicular transport of detainees.\n6 \n \nSection 10, “Procedure: Release by officer”, has been updated to remove information contained in other \nsections. \nSections 11, 11.1, 11.2 and 11.3, “Place of detention”, have been moved and revised to include types of \ndetention facilities, levels of risk and new detention agreements with provincial governments. \nSection 12, “Detentions Program Monitoring”, has been added. \nSection 13, “Transitional measures”, has been moved. \n \n2015-12-22 \n \nThe detention forms have been updated and converted to the CBSA numbering system (BSF304, 579, \n507 E, 508 E, 566, 524, 481, 481-1, 578, 754, 754-1, 674 and 735). \nSection 8, “Procedure: Detention”, has been updated to remove information contained in other chapters. \nSection 9, “Procedure: National risk assessment for detention”, and section 9.1, “National risk \nreassessment for detention”, have been created to include a new requirement to ensure the safety and \nwell-being of detainees. \nSection 12, “Place of detention”, has been amended to reflect the closure of the Kingston Immigration \nHolding Centre and the maximum length of detention at Vancouver – IHC has been reduced to 48 hours. \nMultiples sections have been updated following the Field Operations Support System (FOSS) \ndecommissioning.\n7 \n \n1. What this chapter is about \n \nThis chapter offers guidance to Canada Border Services Agency (CBSA) officers on how to manage \nimmigration detention cases once a decision has been made by a designated official to arrest and detain \nunder IRPA. It also states the principles underlying CBSA’s detention policy and describes the \nadministrative and legal framework within which detention operates. \n \nReferences to IRPA appear in the text with an \"A\" prefix followed by the section number. References to \nthe Immigration and Refugee Protection Regulations (IRPR) appear with an \"R\" prefix followed by the \nsection number. \n \nRequests for clarification, questions and comments in relation to this manual should be addressed to the \nCBSA Detentions Unit Programs Branch’s generic mailbox at Detention-Programs@cbsa-asfc.gc.ca. \n \n \n \n2. Definitions \n \nAlternative Arrangement for \nMinors (AAM) \nThe transfer of custody of an accompanied or unaccompanied non- \ndetained minor to a family member or a trusted friend/community member \n(who is not under CBSA custody), child protection services or a \ncommunity based organization. AAM is a process in the CBSA’s \nNational Case Management System (NCMS). \nAlternatives to \nDetention (ATDs) \nAn alternative to detention is any condition that may be imposed on an \nindividual to offset a risk they represent to the enforcement objectives \nand the mandate of the Canada Border Services Agency (CBSA). Refer \nto ENF 34, Alternatives to Detention \nBest Interests of the \nChild (BIOC) \nAn international principle to ensure children enjoy the full and effective \nbenefit of all their rights recognized in Canadian law and the Convention \non the Rights of the Child. It is also a rule of procedure that includes an \nassessment of the possible impact (positive or negative) of a decision \nregarding the child or children concerned. \nCriminal organization within \nthe meaning of A121.1(1) \nmeans a criminal organization as defined in subsection 467.1(1) of the \nCriminal Code. \nDetainee or Detained \nAn adult or minor subject to an Order for Detention under A55 of the \nIRPA \nFamily \nConsists of a parent(s) or legal guardian(s) (p/lg) and a dependent minor. \nThis may also include family members as defined by IRPR and situations \nwhere siblings are traveling together without their p/lg. \nHoused Minor \nA foreign national, permanent resident or Canadian citizen who, after the \ncompletion of a BIOC interview, is kept with their detained p/lg at an IHC \nat the latter’s request. A housed minor is not subject to an Order for \nDetention and is free to remain and re-enter the IHC subject to the p/lg \nconsent in accordance with the rules and procedures of that facility.\n8 \n \nReasonable grounds to \nbelieve \nReasonable grounds are a set of facts and circumstances that would \nconvince a normally prudent and informed person. They are not mere \nsuspicions. The opinion must have an objective basis. \nReasonable grounds to \nsuspect \nReasonable grounds to suspect, a lower standard than to believe, is a set \nof facts or circumstances that would lead the ordinarily cautious and \nprudent person to have a hunch or suspicion. \nProtected person under \nA95(2) \nA protected person is a foreign national on whom refugee protection is \nconferred under A95(1), and whose claim or application has not \nsubsequently been deemed to be rejected under A108(3), A109(3) or \nA114(4). \nMinor (child) \nA minor is defined under the IRPA and the Convention on the Rights of \nthe Child as a person under the age of 18. In some provinces, a youth \naged 16 and 17 is not considered a minor (see Annex B). However, they \nare considered to be a minor in the federal context (R249). \nNon-Compliance \nFailure or refusal to comply, as with a law, regulation, or term of a \ncondition. \nIsolation (Administrative) \nThe isolation of persons to prevent association with others. \nUnaccompanied minor \nA person under the age of 18 who is in Canada (at POE or Inland) and is \nnot accompanied by a parent or a legal guardian. \n \n \n \n3. Program objectives \n \nA3(1) & (2) of IRPA which outlines the objectives of the Act lists three objectives that are directly linked to \nthe CBSA’s responsibility for the enforcement of IRPA regarding both immigration and refugee programs: \n \nto maintain, through the establishment of fair and efficient procedures, the integrity of the \nCanadian immigration system; \n \nto protect the health and safety of Canadians and to maintain the security of Canadian \nsociety; and \n \nto promote international justice and security by fostering respect for human rights and by \ndenying access to Canadian territory to persons who are criminals or security risks. \nThe detention of permanent residents and foreign nationals meets these objectives by: \n \nprotecting Canadian society by detaining those who pose a danger to the public or security \nrisk \n \nsupporting the removal of those who have been denied access to Canadian territory including \nthose who are criminals, security risks, or who are inadmissible for crimes against humanity; \nand \n \nsupporting the examination and investigation processes which are key elements in ensuring \nthe enforcement of IRPA.\n9 \n \n4. The act and regulations \n4.1. Authority to arrest and detain a person \n \nThe following legislative sections identify the grounds on which an officer may arrest and/or detain a \npermanent resident or foreign national. For further information on how to exercise the authority to arrest \nand/or detain please see ENF 7 Immigration Investigations and IRPA s.55 Arrests/Detention. \n \n \n \n \nFor information about: \nSection of \nIRPA \nArrest and detention with warrant \n \nAn officer may issue a warrant for the arrest and detention of a permanent resident or a \nforeign national who the officer has reasonable grounds to believe is inadmissible and: \n \n \nis a danger to the public; or \n \nis unlikely to appear for examination, an admissibility hearing, for removal from \nCanada or at a proceeding that could lead to the making of a removal order by the \nMinister under subsection 44(2). \nA55(1) \nArrest and detention without warrant \n \nAn officer may, without a warrant, arrest and detain a foreign national, other than a \nprotected person, \n \n \nwho the officer has reasonable grounds to believe is inadmissible; and \no \nis a danger to the public; or \no \nis unlikely to appear for examination, an admissibility hearing, removal \nfrom Canada, or at a proceeding that could lead to the making of a \nremoval order by the Minister under subsection A44(2); or \n \nif the officer is not satisfied as to the identity of the foreign national in the course of \nany procedure under this Act. \nA55(2) \nDetention on entry \n \nA permanent resident or a foreign national may, on entry into Canada, be detained if an \nofficer \n \n \nconsiders it necessary to do so in order for the examination to be completed; or \n \nhas reasonable grounds to suspect that the permanent resident or foreign national \nis inadmissible on grounds of \nA55(3)\n10 \n \no \nsecurity, \no \nviolating human or international rights, \no \nserious criminality, criminality or \no \norganized criminality. \n \nMandatory arrest and detention — designated foreign national \n \nIf a designation is made under subsection 20.1(1), an officer must \n \ndetain, on their entry into Canada, a foreign national who, as a result of the \ndesignation, is a designated foreign national and who is 16 years of age or older \non the day of the arrival that is the subject of the designation; or\n \n \narrest and detain without a warrant — or issue a warrant for the arrest and \ndetention of — a foreign national who, after their entry into Canada, becomes a \ndesignated foreign national as a result of the designation and who was 16 years of \nage or older on the day of the arrival that is the subject of the designation.\nA55(3.1) \nNotice to the Immigration Division \n \nIf a permanent resident or a foreign national is taken into detention, an officer shall without \ndelay give notice to the Immigration Division. \nA55(4) \nRelease: officer \n \nAn officer may order the release from detention of a permanent resident or a foreign \nnational before the first detention review by the Immigration Division if the officer is of the \nopinion that the reasons for the detention no longer exist. The officer may impose any \nconditions, including the payment of a deposit or the posting of a guarantee for compliance \nwith the conditions, that the officer considers necessary. \nA56(1) \nMinor children \n \nIt is affirmed as a principle that a minor child shall be detained only as a measure of last \nresort, taking into account the other applicable grounds and criteria including the best \ninterests of the child. \nA60 \nMinisters’ warrant \n \nThe Minister and the Minister of Citizenship and Immigration may issue a warrant for the \narrest and detention of a person who is named in a certificate if they have reasonable \ngrounds to believe that the person is a danger to national security or to the safety of any \nperson or is unlikely to appear at a proceeding or for removal. \nA81\n11 \n \n4.2. Regulatory factors and conditions \n \nRegulations on detention and release have been developed under A61. Part 14 of the Immigration and \nRefugee Protection Regulations (the Regulations) is constructed as follows: \n \nFactors to be considered \n \n244 For the purposes of Division 6 of Part 1 of the Act, the factors set out in this Part shall \nbe taken into consideration when assessing whether a person \n \n \n(a) is unlikely to appear for examination, an admissibility hearing, removal from \nCanada, or at a proceeding that could lead to the making of a removal order by the \nMinister under subsection 44(2) of the Act; \n \n(b) is a danger to the public; or \n \n(c) is a foreign national whose identity has not been established. \nR244 \nFactors: Flight risk \n \n245 For the purposes of paragraph 244(a), the factors are the following: \n \n \n(a) being a fugitive from justice in a foreign jurisdiction in relation to an offence \nthat, if committed in Canada, would constitute an offence under an Act of \nParliament; \n \n(b) voluntary compliance with any previous departure order; \n \n(c) voluntary compliance with any previously required appearance at an \nimmigration or criminal proceeding; \n \n(d) previous compliance with any conditions imposed in respect of entry, release or \na stay of removal; \n \n(e) any previous avoidance of examination or escape from custody, or any \nprevious attempt to do so; \n \n(f) involvement with a people smuggling or trafficking in persons operation that \nwould likely lead the person to not appear for a measure referred to in paragraph \n244(a) or to be vulnerable to being influenced or coerced by an organization \ninvolved in such an operation to not appear for such a measure; and \n \n(g) the existence of strong ties to a community in Canada. \nR245 \nFactors: Danger to the public \n \n246 For the purposes of paragraph 244(b), the factors are the following: \n \n \n(a) the fact that the person constitutes, in the opinion of the Minister, a danger to \nthe public in Canada or a danger to the security of Canada under paragraph \n101(2)(b), subparagraph 113(d)(i) or (ii) or paragraph 115(2)(a) or (b) of the Act; \nR246\n12 \n \n \n(b) association with a criminal organization within the meaning of subsection \n121(2) of the Act; \n \n(c) engagement in people smuggling or trafficking in persons; \n \n(d) conviction in Canada under an Act of Parliament for \no \n(i) a sexual offence, or \no \n(ii) an offence involving violence or weapons; \n \n(e) conviction for an offence in Canada under any of the following provisions of \nthe Controlled Drugs and Substances Act, namely, \no \n(i) section 5 (trafficking), \no \n(ii) section 6 (importing and exporting), and \no \n(iii) section 7 (production); \n \n(f) conviction outside Canada, or the existence of pending charges outside \nCanada, for an offence that, if committed in Canada, would constitute an offence \nunder an Act of Parliament for \no \n(i) a sexual offence, or \no \n(ii) an offence involving violence or weapons; \n \n(g) conviction outside Canada, or the existence of pending charges outside \nCanada, for an offence that, if committed in Canada, would constitute an offence \nunder any of the following provisions of the Controlled Drugs and Substances Act, \nnamely, \no \n(i) section 5 (trafficking), \no \n(ii) section 6 (importing and exporting), and \no \n(iii) section 7 (production); \n \n(h) conviction for an offence in Canada under any of the following provisions of \nthe Cannabis Act, namely, \no \n(i) section 9 (distribution), \no \n(ii) section 10 (selling), \no \n(iii) section 11 (importing and exporting), and \no \n(iv) section 12 (production); and \n \n(i) conviction outside Canada, or the existence of pending charges outside \nCanada, for an offence that, if committed in Canada, would constitute an offence \nunder any of the following provisions of the Cannabis Act, namely, \no \n(i) section 9 (distribution), \no \n(ii) section 10 (selling), \no \n(iii) section 11 (importing and exporting), and \no \n(iv) section 12 (production). \n \nFactors: Identity not established \n \n247 (1) For the purposes of paragraph 244(c), the factors are the following: \n \no \n(a) the foreign national’s cooperation in providing evidence of their identity \nor assisting the Department or the Canada Border Services Agency in \nobtaining evidence of their identity, in providing the date and place of their \nbirth as well as the names of their mother and father, in providing detailed \ninformation on the itinerary they followed in travelling to Canada or in \ncompleting an application for a travel document; \nR247\n13 \n \no \n(b) in the case of a foreign national who makes a claim for refugee \nprotection, the possibility of obtaining identity documents or information \nwithout divulging personal information to government officials of their \ncountry of nationality or, if there is no country of nationality, their country of \nformer habitual residence; \no \n(c) the foreign national’s destruction of their identity or travel documents, \nor the use of fraudulent documents by the foreign national in order to \nmislead the Department or the Canada Border Services Agency, and the \ncircumstances under which the foreign national acted; \no \n(d) the provision of contradictory information by the foreign national with \nrespect to their identity during the processing of an application by the \nDepartment or the Canada Border Services Agency; and \no \n(e) the existence of documents that contradict information provided by the \nforeign national with respect to their identity. \n \nMarginal note: Non-application to minors \n \n(2) Consideration of the factors set out in paragraph (1)(a) shall not have an adverse \nimpact with respect to minor children referred to in section 249. \n \nOther factors \n \nIf it is determined that there are grounds for detention, the following factors shall be \nconsidered before a decision on detention or release: \n \n \nthe reason for detention; \n \nthe length of time in detention; \n \nwhether there are any elements that can assist in determining the length of time \nthat detention is likely to continue and, if so, that length of time; \n \nany unexplained delays or unexplained lack of diligence caused by the Canada \nBorder Services Agency (CBSA) or the person concerned; and \n \nthe existence of Alternatives to Detention (ATDs). \nR248 \nBest interests of the child \nFor the purpose of paragraph 248(f) and for the application, in respect of children who are \nunder 18 years of age, of the principle affirmed in section 60 of the Act, that a minor child \nshall be detained only as a measure of last resort, the following factors must be considered \nwhen determining the best interests of the child: \no \n(a) the child’s physical, emotional and psychological well-being; \no \n(b) the child’s healthcare and educational needs; \no \n(c) the importance of maintaining relationships and the stability of the family \nenvironment, and the possible effect on the child of disrupting those relationships or \nthat stability; \nR248.1\n14 \n \no \n(d) the care, protection and safety needs of the child; and \no \n(e) the child’s views and preferences, provided the child is capable of forming their own \nviews or expressing their preferences, taking into consideration the child’s age and \nmaturity. \n \nMarginal note: Degree of dependence \nFor the purpose of paragraph 248(f), the level of dependency of the child on the person for \nwhom there are grounds to detain shall also be considered when determining the best \ninterests of the child. \n \nSpecial considerations for minor children \n \nFor the application of the principle affirmed in section 60 of the Act that a minor child shall \nbe detained only as a measure of last resort, the special considerations that apply in \nrelation to the detention of minor children who are less than 18 years of age are \n \nthe availability of alternative arrangements with local child-care agencies or \nchild protection services for the care and protection of the minor children; \n \nthe anticipated length of detention; \n \nthe risk of continued control by the human smugglers or traffickers who \nbrought the children to Canada; \n \nthe type of detention facility envisaged and the conditions of detention; \n \nthe availability of accommodation that allows for the isolation of the minor \nchildren from adult detainees who are not the parent of or the adult legally \nresponsible for the detained minor children; and \n \nthe availability of services in the detention facility, including education, \ncounselling and recreation. \nR249 \n \n \n \n4.3. Forms and publications \n \nSeveral forms require the gender identity of detainees to ensure their safety and well-being. Detention \nforms will progressively be updated to reflect all available gender identities as follows: male, female and \nnon binary (X) options. The X identifier is an option that may be chosen by individuals who do not identify \nexclusively as male or female, as well as two-spirit individuals. \n \nForm title \nForm number \nOrder for Detention \nBSF304 \nDetention Cell Log \nBSF481 \nReview of Detention \nBSF920\n15 \n \nMinister’s Opinion Regarding the Foreign National’s Identity (under subsection \n58(1)(d) of the Immigration and Refugee Protection Act) \nBSF510 \nRequest for Admissibility Hearing/Detention Review Pursuant to the Immigration \nDivision Rules \nBSF524 \nNotice of Arrest and/or Detention \nBSF561 \nAuthority to Release from Detention \nBSF566 \nDetention (stickers) \nBSF578 \nDetainee Medical Needs \nBSF674 \nRequest for Release from Mandatory Detention – Exceptional Circumstances \n(pursuant to paragraph 58.1(1) of the Immigration and Refugee Protection Act) \nBSF735 \nNational Risk Assessment for Detention \nBSF754 \nNotice of Rights Conferred by the Canadian Charter of Rights and Freedoms and \nby the Vienna Convention Following Section 55 of the Immigration and Refugee \nProtection Act Arrest or Detention \n \nBSF776 \nDetention Oversight Form \nBSF921 \n \n \n \n \n \n \n \n \n \n \nInformation for people detained under the Immigration and Refugee Protection Act \n(brochure) \nBSF5012 \n \n \nEnglish \n \nFrench \n \nArabic \n \nChinese \nSimplified \n \nChinese \nTraditional \n \nHindi \n \nJapanese \n \nKorean \n \nFarsi \n \nPortuguese \n \nPunjabi \n \nRussian \n \nSpanish \n \nTagalog \n \nTamil \n \nUrdu \nAcknowledgement of Conditions - Immigration and Refugee Protection Act (IRPA) BSF821 \nRequest to Transfer Detainee to an Immigration Holding Centre \nBSF915\n16 \n \n5. Instruments and delegations \n \nThe Minister of Immigration, Refugees and Citizenship is responsible for the administration of the Act with \nthe exception of the areas for which the Minister of Public Safety has assumed responsibility as described \nbelow A4(2). \n \n4(2) The Minister of Public Safety is responsible for the administration of the Act as it relates to the \nfollowing: \n \n \nexaminations at ports of entry; \n \nthe enforcement of the Act, including arrest, detention and removal; \n \nthe establishment of policies respecting the enforcement of the Act and inadmissibility on grounds \nof security, organized criminality or violating human or international rights; or \n \ndeclarations under 42.1 regarding determinations under any of A34, A35(2) and A37(2). \n \nIRPA provides officers with the discretionary authority or power to arrest and detain under A55. A56 \ndesignates to officers the authority, prior to the first detention review, to release a person from detention \nif, in their opinion, the reasons for detention no longer exist. \n \nIn order to confirm which CBSA officials have the authority to arrest and detain under IRPA, consult t he \nCBSA Designation of Officers and Delegation of Authority document found in IL 3. \n \n \n \n6. Departmental policy \n6.1. Principles \n \nThe CBSA is guided by the following principles governing the treatment of persons detained under the \nAct: \n \nimmigration detention is an administrative detention and must not be punitive in nature; \n \npersons detained under IRPA are treated with dignity and respect at all times; \n \npersons are detained in an environment that is safe and secure; \n \npersons are treated in a manner that is commensurate with the level of risk they pose to public \nsafety or the integrity of the immigration program; \n \npersons are duly and appropriately considered for ATD throughout the detention continuum, \nwhich includes before every detention review. \n \ndetention operations are conducted in a transparent manner, while respecting the privacy of the \ndetained persons; \n \na minor child shall be detained only as a measure of last resort, taking into account the other \napplicable grounds and criteria including the best interests of the child; \n \npeople who are detained are informed of their legal rights, are given an opportunity to exercise \ntheir rights and are informed of the status of their case; \n \nfeedback is welcomed by the CBSA and all detainees have access to a feedback process; \n \nfor Immigration Holding Centres (IHC), the CBSA maintains national detention standards that \nincorporate international standards; \n \nmonitoring of the CBSA compliance with these standards will be conducted regularly by an \nexternal agency; \n \nin CBSA IHC’s, the CBSA makes reasonable efforts to meet the physical, emotional and spiritual \nneeds of detained persons in a way that is culturally appropriate.\n17 \n \n6.2. General \n \nThe CBSA recognizes that to deny individuals their liberty is a decision that requires a sensitive and \nbalanced assessment of risk. In exercising their discretionary authority to detain, officers must consider \nATDs, individual assessment of the case and the impact of release. Additionally, it requires a risk \nmanagement approach that supports decision making within the context of the following priorities: \n \n \nWhere safety or security concerns are identified (including criminality, terrorism or violent \nbehaviour); \n \nTo support removal where removal is imminent and where a flight risk has been identified; \n \nWhere there are significant concerns regarding a person’s identity including multiple identity \ndocuments, false documents, lack of travel documents or non-cooperation in assisting an officer \nto establish their identity. \n \n6.3. National immigration detention standards \n \nThe CBSA has developed enhanced National Immigration Detention Standards. These guidelines \ndescribe the treatment of detainees in immigration holding centers and non-CBSA detention facilities. The \nstandards reflect the CBSA’s ongoing commitment to improving immigration detention conditions. This \nmeans ensuring that all individuals are treated in a dignified and humane manner. The standards aim to \nensure national consistency in the administration of the detention program. \n \nThe CBSA prepared the standards under section 5(1)(a) of the Canada Border Services Act, which \nprovides support for the enforcement of border legislation, allowing the CBSA to manage the immigration \ndetention process. The CBSA will review and revise the standards as needed, to reflect any issues that \narise from their application and to ensure they continue to align with future policies and programming. \n \nThe national detention standards were developed to: \n \n \nGuide the administration of the detention program and the care of individuals detained under \nIRPA, \n \nReflect the CBSA’s ongoing commitment to improving immigration detention conditions, ensuring \nthat all individuals are treated in a dignified and humane manner, commensurate with their level \nof risk, while ensuring a safe and secure environment for staff and detainees, \n \nEnsure national consistency in the delivery of the detention program across Immigration Holding \nCentres (IHCs) and non-CBSA detention facilities where possible, \n \nEnhance program transparency, by their publication on the CBSA website, and \n \nMirror CBSA’s vision of immigration detention as it evolves. \n \nThe standards provide guidance under the following six themes: Safety, Security, Order, Care, Activities, \nAdministration and Management. Each region develops Post Orders and Standard Operating \nProcedures that align with the detention standards, and incorporates the different regional operational \nrealities. \n \nPlease see the National Immigration Detention Standards for additional guidance.\n18 \n \n6.4. Alternatives to Detention \n \nThe CBSA’s application of its detention authorities is risk-based and supports the selective use of \ndetention. Nevertheless, detention is a last resort and Alternatives to Detention (ATD) are always \nconsidered, with the CBSA relying on various alternatives to detaining individuals in an Immigration \nHolding Centre (IHC) or a provincial facility. Within the first 48 hours of detention the CBSA, and \nthereafter the Immigration and Refugee Board (IRB), can impose conditions on an individual and release \nthem from detention where any identified risk can be mitigated. \n \nVarious ATDs are available and officers must consider them prior to detention and while the individual \nremains in detention. Officers should consider the individual’s immigration history and potential risk \nagainst the maximum risk that can be mitigated through each ATD. Of note remains the fact that, \naccessibility to ATDs may differ between ports of entry and inland enforcement offices. The availability of \nATDs may be impacted by the time or day of the arrest as some of them require involvement from third \nparties (e.g. guarantor and service provider). For more information on the ATD Program, see ENF 34 \nAlternatives to Detention. \n \nShould an ATD be considered appropriate but was not accessible/available at the time of the detention \n(i.e. a potential guarantor was identified but could not appear at the office), it should be included in the \nnotice of arrest because hearings officers may make an application for an early detention review if \ncontinued detention is no longer justified. \n \nFor more information on deposits and guarantees, see the ENF 8 Deposits and Guarantees. \n \n \n \n6.5. Detention of minor children (under 18 years of age) \n \nA minor child may be detained if grounds for detention exist under section A55. Section A60 affirms the \nprinciple that the detention of a minor must be a measure of last resort, taking into account other \napplicable grounds and criteria, including the best interests of the child (BIOC). \n \nThe United Nations Convention on the Rights of the Child (CRC), to which Canada is a party, states that \nthe BIOC shall be a primary consideration in all state actions concerning children. In recognizing the \nvulnerability of children and research on the detrimental effects of detention and family separation on \nchildren, the CBSA developed the National Directive for the Detention or Housing of Minors for \noperational use, to achieve better and consistent outcomes for minors affected by Canada’s immigration \ndetention system. Canada’s international obligations and domestic legislative and policy frameworks are \nthe broad underpinnings of this Directive. \n \nThe objectives of the National Directive or the Detention or Housing of Minors are: \n \n1. To stop detaining or housing minors, and family separation except in extremely limited \ncircumstances. \n2. To actively and continuously seek ATDs or AAMs when unconditional release is inappropriate. \n3. To preserve the family unit for overall well-being and continuity of care. \n4. To ensure that the detention or housing of a minor or the separation of a minor from his/her \ndetained p/lg is for the shortest time possible.\n19 \n \n5. To never place minors in isolation (or isolate them) at an IHC, provincial or any other facility. \n \nFundamental considerations \n \n1. Detention of a minor is a measure of last resort (A60 above). Detention is to be avoided to the \ngreatest extent possible and applied for the shortest period possible. \n2. ATDs must always be considered first for minors and their p/lg and be actively pursued until \nrelease. \n3. The unity of families is to be highly factored in all detention-related decisions. \n4. The BIOC are a primary consideration and may only be outweighed by other significant \nconsiderations such as public safety (i.e. R245 Flight Risk (a) (f) and R246 Danger to the Public), \nor national security. \n5. Detention may be considered when historic, consistent and willful breaches of IRPA or IRPR are \ndemonstrated. \n6. The BIOC assessment is to be conducted prior to any decision to detain or house a minor or \nseparate a minor from his/her detained p/lg; and should also be conducted on a continual basis \n(Section 8(2)). \n7.  Only in extremely limited circumstances may a minor be detained or housed if no suitable ATDs \ncan be found: \na) if it is in the BIOC to be housed with their p/lg; \nb) there are well-founded reasons to believe the minor is a danger to the public; \nc) when identity is a serious concern but only insofar as there are well-founded reasons to \nbelieve the minor or his or her p/lg may represent a risk to public safety and national \nsecurity; and \nd) the family is scheduled or can be scheduled for removal within seven days and has \ndemonstrated a consistent pattern of non-compliance and willful breaches of conditions \nor violations of the Act or Regulations elevating the risk of unlikely to appear for removal. \n8. Where detention is warranted: \na) detention or housing must be for the shortest period of time; \nb) ATDs will be reviewed by a CBSA officer in consultation with the minor's p/lg, and \ncounsel where applicable, on a weekly basis to prevent prolonged detention; \nc) an unaccompanied minor should never be housed for more than 48 hours at an IHC \nexcept where danger to the public considerations have been raised. \nd) there shall be no comingling of unaccompanied minors and other non-familial adult \ndetainees. \ne) no minor (accompanied or unaccompanied) shall be placed in isolation or be \nisolated  \nf) \nfamilies must not be separated within the detention facility where possible; and \ng) there shall be access to education, recreation, medical and counselling services, and \nproper nutrition in accordance with detention standards and international obligations. \n \n \n6.5.1. The best interests of the child (BIOC) \n \nR248(f) requires that the best interests of a directly affected child who is under 18 years of age shall be \nconsidered before a decision is made on detention or release. There is no limitation regarding the directly \naffected child location (i.e. in Canada or abroad) or whether the minor is detained, housed or is released. \nMental health evidence is clear that both detention and family separation have detrimental consequences \nfor children's well-being. The BIOC are best achieved where children are united with their families in \ncommunity-based, non-custodial settings where possible. To assess the best interests of a directly \naffected child or the BIOC when the child is detained, R248.1(1) provides a non-exhaustive list of factors \nthat officers and Immigration Division members must consider:\n20 \n \n1. On all detention decisions that affect minors, CBSA officers must consider the BIOC as a primary \nconsideration. \n2. To facilitate decision-making, the BIOC is to be determined separately and prior to the decision to \ndetain the p/lg. It needs to be reviewed on an ongoing basis (includes observations and day to \nday interactions) based on the legal situation of the minor and their p/lg and their well-being. \n3. Officers shall use, but are not limited to, the list of factors to determine the BIOC: \na. the child's physical, mental and emotional needs \nb. the child's educational needs \nc. the preservation of the family environment and maintaining relationships \nd. the care, protection and safety of the child \ne. the level of dependency between the child and the parent or guardian; \nf. \nthe child's views, if they can be reasonably ascertained; and \ng. any other relevant factor. \n4. The BIOC is to be determined on a case-by-case basis taking all relevant information related to \nthe minor's situation into account; the interests and rights of the p/lg are taken into consideration \nsubsequent to the BIOC determination. \n5. CBSA officers must give minors capable of forming their own views the opportunity to express \nthose views freely in all matters regarding their detention, housing or family separation. Their \nviews should be given due weight in accordance to their age and level of maturity. Although t he \nofficer is not bound by their views, they must be considered and duly noted in the determination \nof what is in the BIOC. \n \n6.5.2. Family unity \n \n1. Every effort must be made to preserve the family unit for overall well-being and continuity of care. \n2. Families must be released with or without conditions to the greatest extent possible. Where \nunconditional release is not possible, an ATD should be used. \no When p/lg are detained, and public safety (i.e. R245 Flight Risk and R246 Danger to the \nPublic) and/or national security are not an issue, officers must make every effort to find \nan appropriate ATD. \no Where public safety (i.e. R245 Flight Risk and R246 Danger to the Public) and/or national \nsecurity are raised, every effort shall be made to find an ATD that sufficiently mitigates \nthe concerns. \n3. Though it is crucial to maintain the family unit, there may be exceptional circumstances where it is \nnot possible. Where an ATD is not appropriate for the family or either parent following a \nthorough review of community based options and release conditions, CBSA officers with the p/lg \nand relatives or CBO shall find a solution for the temporary care of the minor if this is in the BIOC. \nContact information of the organization and/or person charged with temporary care of the minor \nmust be indicated in the minor's file (or the p/lg file if the minor is a Canadian citizen). Subject to \ntheir level of comprehension, the minor should be given Legal Aid and Provincial Child Advocate \ncontact information. \n4. If a minor is separated from their family, access to the p/lg must be facilitated and the CBSA \nofficer must inform them of the steps being taken, unless the provision of the information is \ncontrary to the BIOC and compromises the safety and well-being of the minor. \n \n6.5.3. Child protection services (CPS)\n21 \n \n1. CPS are responsible for the safety, well-being and familial stability of children, which may involve \ninvestigations into abuse or neglect of children. They can also connect families to community \nresources to address issues like mental health, settlement, temporary accommodations, and \nprovide guidance / advice on the BIOC. Most CBOs are equipped to provide the aforementioned. \n2. CBSA officers shall consult the p/lg prior to contacting CPS unless the situation falls within the \nduty to report under child welfare legislation. Accordingly, CBSA officers must contact CPS if \nabuse, neglect or other serious concerns are suspected or identified. Additional reasons for CPS \ncontact are as follows: \na. A trauma experienced by a minor; \nb. Identified safety issues while in custody due to p/lg abuse and/or neglect; and \nc. Parents may be facing criminal charges and due to the nature of the charges, may be \nseparated from their children (i.e. incarcerated in a separate institution). \n \nRefer to Annex B for a list of Child protection services. \n \n6.5.4. Arrest and detention of a minor \n \n1. Upon the decision to arrest and detain a minor (accompanied or unaccompanied), the CBSA \nofficer must advise his/her supervisor immediately. The officers must note all the ATDs that they \nconsidered before concluding that detention is absolutely necessary and cannot be avoided. \n2. Another officer must review the officer's initial detention decision. This officer is responsible for \nreviewing the case considering any new information and for authorizing release under A56 if \njustified. If, upon internal review, the detention decision is upheld, then the Immigration Division of \nthe IRB will review the reasons for continuing with the detention within 48 hours following the start \nof the detention or as soon as possible thereafter. Of note, the CBSA will continue to conduct the \nBIOC assessments to inform the position taken at IRB reviews until release. \n3. Where possible, the initial decision-maker shall take the lead in the active case management of \nthe minor's file throughout the immigration enforcement stream for the best case oversight. \n4. CBSA officers must ensure the security, safety, and protection of the minor under \narrest/detention. In addition, \na. Minors shall not be handcuffed except in extreme circumstances. Officers must assess \nthe risk and act on reasonable grounds when deciding to handcuff a minor. Extreme \ncircumstances are limited to danger to the public, threat posed to an officer(s), the public \nor self-harm; \nb. CBSA officers will not handcuff detained p/lg in front of their children other than under \nextreme circumstances (as above) or if the detained person has a violent criminal past; \nand \nc. CBSA officers will not conduct personal searches or frisking of a detained p/lg in front of \na minor other than under extreme circumstances (as above), or if the detained person \nhas a violent criminal past. Officers must make every effort to conduct searches outside \nthe view of the minor, unless doing so would cause more distress to the child. \n5. Regardless of the age of the person arrested, a Notice of Arrest and/or Detention, Order for \nDetention (form) a National Risk Assessment for Detention and Detainee Medical forms must be \ncompleted for a detention made under A55 of the IRPA. Officers must clearly articulate reasons \nand grounds for arrest and detention when completing the documents, and be mindful of the \nimportance of taking thorough and complete notes supporting their decisions and actions. \n6. If the detention involves an unaccompanied minor, the CBSA must notify the Canadian Red \nCross Society (CRCS) immediately following the first 48hr detention review by the IRB.\n22 \n \n6.5.5. Unaccompanied minors \n \nFor appearances before the Immigration and Refugee Board (IRB) in situations where an unaccompanied \nminor is detained, A167(2) provides that a representative shall be designated for any person who is under \n18 years of age or who, in the opinion of the Division, is unable to understand the nature of the \nproceedings. For more information on detention review, see ENF 3, Admissibility Hearings and Detention \nReview Proceedings. \n \n1. Unaccompanied minors shall never be detained or housed at an IHC unless it is for an \noperational reason (e.g. POE arrival at 03:00, outside of normal business hours) and an ATD \ncannot be found. In the event that an unaccompanied minor is held at an IHC for more than \n24 hours, a CBSA officer must conduct an assessment of the BIOC that includes a thorough ATD \nreview for the purpose of release. Unaccompanied minors shall also have heightened supervision \n(IHC staff), and access to guards, NGO staff and/or other supports as necessary. \n2. If the presence of smugglers or traffickers is a concern, the matter must be discussed with CPS to \nensure that adequate protection is provided (refer to Annex B). \n3. In most cases, unaccompanied minors are to be released in the care of a CBO or CPS (e.g. local \nChildren's Aid Society where a MOU is established) if they do not have a relative or trusted \ncommunity link. While in their custody, the organization will make every effort to ensure that the \nminor meets CBSA's reporting requirements. Contact information of the organization, relative, or \ntrusted community member charged with the temporary care of the minor or an IRB Designated \nRepresentative or lawyer must be indicated in the minor's file. \n \n6.5.6. Housing - accompanied minors \n \nA housed minor is a foreign national, permanent resident or Canadian citizen who, after the completion of \na BIOC, is kept with their detained parent(s) or legal guardian(s) at an IHC at the latter’s request. \n \nA housed minor is not subject to an Order for Detention and is free to remain and re-enter the IHC subject \nto consent of the parent(s) or legal guardian(s) in accordance with the rules and procedures of that \nfacility. No detention related forms should be issued for a housed minor as they are not detained, \nincluding the Detainee Medical Needs, as these forms are only issued where the IRPA grounds for \ndetention of the minor are met. However, NCMS tracking of housed minor is required, see section 9.1, \ndata entry, for more details. \n \nThe National Directive for the Detention or Housing of Minors outline that: \n \n1. Accompanied minors shall be housed at an IHC (where available) only if it has been deemed to \nbe in the BIOC. The CBSA officer must note the ATDs considered for both or one of the p/lg \nbefore concluding that housing was absolutely necessary for the minor and/or family unity. \n2. The CBSA officer must explain to the p/lg their option to accept or to refuse housing, and that \ntheir decision will not affect their immigration case; interpreter services must be offered to the p/lg \nto enable clarity and full comprehension of the discussion. A CBSA Supervisor or Superintendent \nand the minor's p/lg must provide their written consent prior to housing at an IHC. \n3. A p/lg may withdraw their consent at any time by informing the CBSA in writing. The CBSA may \nalso withdraw their consent under extreme circumstances, such as: \no Inability of the p/lg to care and ensure control of the minor resulting in harm to the minor \nand subject to duty of care referral under the child welfare legislation; or\n23 \n \no An alternative to housing has become available for the accompanying the minor even \nafter the 48-hour detention review. \n4. If a CBSA officer considers withdrawing consent, they must justify this in writing, discuss with the \np/lg, and give them an opportunity to remedy the circumstances. \n5. CBSA officers shall conduct a weekly case review to reassess ATDs and the BIOC of \naccompanied minors. \n \n6.5.7. Services in an IHC \n \nIn accordance with international standards, IHCs offer a secure and sanitary environment, proper \nnutrition, access to fresh air, access to the health care servic es (e.g. psychology and psychiatric supports) \nand recreation. Furthermore, \n \n1. Minors shall be housed with both p/lg. to the greatest extent possible in order to preserve the \nfamily unity. \n2. The IHC shall adhere to National Detention Standards for accompanied and unaccompanied \nminors, and the IHC Manager will be responsible for verifying this. \n3. By provincial laws, minors must go to school starting at the age of five or six and until they are \nbetween 16 and 18, depending on the province or territory. Qualified teachers will provide in-class \neducation for minors who are at an IHC after seven-days until they are released. \n \n6.5.8. Transportation and travel \n \nThe CBSA Enforcement Manual's Part 6 Chapter 2 on the Vehicular Transport of Persons under Arrest or \nDetention is applicable to detained or housed minors. It guarantees the safety and security of individuals \nin CBSA custody and OB PRG-2015-34 Transportation of Non-Detained Persons in Agency Vehicles \nwhile Administering CBSA Program Legislation is also relevant. The p/lg is responsible for the care and \ncontrol of their children, therefore, they must be kept with them at all times that include situations when \nthe p/lg or minor must leave the IHC for various reasons: detention review, medical appointment, court \nproceeding, immigration examination, etc. NOTE: Section 10 applies to this section. \n \n6.5.9. Reporting \n \n1. All situations involving the detention, housing or separation of the family unit must be reported \nimmediately to the Border Operations Centre (BOC) as a significant event in the Incident \nReporting Criteria (IRC) of \"Child Welfare\". \na. The regional Single Reporting Tool (SRT) OB OPS-2017-03 to the BOC must contain the \nfollowing information regarding the case: \ni. \nTombstone data for the minor involved (UCI, age, gender, citizenship); \nii. \nUCI for accompanying parent or guardian (if minor is accompanied); and \niii. \nSynopsis of the case containing detailed information regarding the case including \nif the minor was accompanied or unaccompanied; detained (and grounds for \ndetention), housed or separated from a detained p/lg; and detention facility where \nthey are held. \nb. The SRT must contain the information that was considered during the decision-making \nprocess:\n24 \n \n \nInformation regarding how the BIOC was assessed and outcome of the \nassessment (this is relevant for all instances involving minors (whether minors \nare detained, housed or separated from their detained p/lg). \nc. The SRT must also contain the information considered regarding actions taken to \nmitigate detention of minors or their p/lg: \n \nInformation regarding how and which ATDs were considered in order to minimize \nthe detention or housing of children, or the separation of children from their p/lg. \nd. Once the BIOC has been conducted and ATDs have been considered, and a minor is \ndetained or housed in a detention facility, or separated from a detained p/lg, the CBSA \nOfficer (decision-maker) must report the case to the BOC as soon as possible. \ne. Superintendents/managers shall ensure that a notification is sent to the BOC as outlined \nabove. \n2. At first contact with an unaccompanied minor (under the age of 18), the CBSA officer will notify \nthe CRCS in writing as soon as possible by sending an email message \nto: IDMP@REDCROSS.CA On the Subject Line, indicate “Unaccompanied Minors” and the \nfacility or location where the minor is being held. For general information, refer to their \nwebsite:  http://www.redcross.ca/how-we-help/migrant-and-refugee-services/promoting-the-rights- \nof-immigration-detainees \n3. Aggregate reporting on minors will be part of the detention program statistics on-line quarterly \npublication that will also include the separation of minors. \n \n6.6. Vulnerable persons \n \nA vulnerable person in the detention context is defined as a person for whom detention may cause a \nparticular hardship and they must clearly be identified on the National Risk Assessment for Detention \n(NRAD) form (see section 9.5). For persons falling into one or more of these categories, officers should \napply the principle that where there is no danger to the public, detention is to be avoided, where possible. \nDetention of a vulnerable person is not precluded where the individual is considered a danger to the \npublic. However, it should be for the shortest period of time and should be focused on supporting \nimminent removal. Where a vulnerability has been identified on the NRAD, an assessment for referral to a \nCommunity Case Management and Supervision (CCMS) service provider must be completed within 72hrs \nof the vulnerability being noted. Unless advised otherwise by health professionals, IHC staff will engage \nwith vulnerable detainees daily and log these interactions in the Detention Activity Management System \n(DAMS). \n \nVulnerable persons may include but are not limited: \n \n \npregnant women and nursing mothers; \n \nminors (under 18 years of age) (see section 6.5, “Detention of minor children”); \n \npersons suffering from a severe medical condition or disability (see note 1 below); \n \npersons suffering from restricted mobility (see note 1 below); \n \npersons with a suspected or known mental illness (includes suicidal and self-harmful persons); \n \nvictims of human trafficking (see note 2 below); \n \npersons who may face hardship for sexual or gender based reasons or who may be victims or \nsurvivors of gender-based violence. \n \nNote 1: To assess if a person’s medical condition, disability or restricted mobility is severe enough to \ncause a particular hardship, the officer must take into account the detention facility and available services.\n25 \n \nThe officer must believe that the person cannot be properly managed within the detention facility in \ncomparison with another detainee without the vulnerability (for instance, a person requires a walker but \nthe detention facility does not offer this kind of service). When in doubt that a person can be satisfactorily \nmanaged within a detention facility, officers should make a decision in consultation with an officer who \nworks at an IHC, a detention liaison officer (DLO) or a designated regional representative. \n \nNote 2: Victims or suspected victims of human trafficking should never be kept or be in contact with their \ntrafficker, if known. \n \n6.7. Long-term detention and jurisprudence \n \nThe CBSA considers all detentions which have lasted over 99 days to be long-term detentions. As it is \ndone for each detention, officers should actively determine if ATDs could be available or suitable to \nmitigate the risk. In cases of long-term detentions, officers should carefully document each effort or \nprogress that has been made to reach an immigration purpose (e.g. to establish the identity or to remove \nan individual). A detention must come to an end if it no longer serves an immigration purpose. Pursuant to \nA58(1)(d), the Minister’s representative is required to demonstrate the possibility of establishing the \nidentity of the person concerned within a reasonable period of time to justify continued detention on such \ngrounds. Officers responsible for the identity investigation must follow each of the cases closely and \ndocument any efforts made to establish the person’s identity. This will demonstrate that the CBSA is \nmaking progress and that the individual’s detention is not indefinite. Long-term detentions are more \njustifiable where one of the following situations occurs: \n \n \nthe detained individual is a danger to the public; \n \nATDs and conditions cannot sufficiently mitigate the danger to the public or the unlikeliness to \nappear; or \n \nDelays can be attributed primarily to the detainee, as a result of their refusal to cooperate with \nCBSA in achieving the applicable enforcement outcome. \n \nJurisprudence \n \nIn Sahin v. Canada (Minister of Citizenship and Immigration), [1995] 1 F.C. 214, the Federal Court ruled \nthat persons cannot be held indefinitely under the provisions of the Immigration Act. There has to be an \nend to the process in view. This ruling has been quoted several times in several judgements, even if it \nrefers to the former Immigration Act. In this case, the reason for detention was that, in the opinion of the \nadjudicator, the subject would not report for removal if required to do so. The Court’s decision in this case \nset out a four part test regarding detention. These four factors have been integrated into R248. \n \n \nThe first is that there is a stronger case for justifying a longer detention for someone considered a \ndanger to the public. \n \nThe second concerns the length of future detention: if it cannot be ascertained, the facts would \nfavour release. \n \nThe third is a question of who is responsible for any delay: unexplained delay or even \nunexplained lack of diligence should count against the offending party. \n \nThe fourth is the availability, effectiveness and appropriateness of ATDs such as outright release, \nbail bond, periodic reporting, etc.\n26 \n \nIn Lunyamila v. Canada (Public Safety and Emergency Preparedness) 2016 FC 1199, the Federal Court \nruled that persons who are a danger to the public or a flight risk and who are not cooperating with the \nMinister’s efforts to remove them from Canada, must continue to be detained until such time as they \ncooperate with their removal, except in exceptional circumstances. However, release might be justified in \nan exceptional circumstance, such as where there have been unexplained and very substantial delays by \nthe Minister that are not attributable to the detained person’s lack of cooperation or to an unwillingness on \nthe part of the Minister to incur substantial costs that would be associated with pursuing non-speculative \npossibilities for removal. Where a person is a danger to the public, the greater the risk that the public \nwould be required to assume under a particular alternative to detention, the more this factor should weigh \nin favour of continued detention. \n \nIn Canada (Public Safety and Emergency Preparedness) v. Ismail, [2015] 3 FCR 53, 2014 FC 390, the \nFederal Court has determined that there is nothing in subsection A58(1) that ties the ability of the \nImmigration Division to continue to detain an individual under that provision to the original grounds of \ndetention under A55. It is thus apparent on the face of the legislation that an individual may originally be \ndetained by an officer for one reason, on the basis of one standard, but may later be denied release by \nthe Immigration Division on a different ground, and on the basis of a different standard. \n \n \n \n7. Detention facilities \n \nIn the administration of the immigration detentions program, the CBSA uses multiple detention facilities to \ndetain individuals under the IRPA. The placement and transfer of detainees in a detention facility, is \nguided by their NRAD score, factors of their case and location. \n \nA142 Every peace officer and every person in immediate charge or control of an immigrant station shall, \nwhen so directed by an officer, execute any warrant or written order issued under this Act for the arrest, \ndetention or removal from Canada of any permanent resident or foreign national. \n \nA143 A warrant issued or an order to detain made under this Act is, notwithstanding any other law, \nsufficient authority to the person to whom it is addressed or who may receive and execute it to arrest and \ndetain the person with respect to whom the warrant or order was issued or made. \n \nImmigration holding centres \n \nThe IHC should always be the default detention facility if risk can be mitigated, in regions where those \nfacilities are available. Individuals detained under the IRPA who have scored 0 to 4 points and 5 to 9 \npoints (if risk can be mitigated in an IHC) on the NRAD form [BSF754] should be held in an IHC. The \nCBSA operates three regional IHCs: \n \n \nThe Laval IHC has a maximum capacity of 152 detainees. It is located at 300 Montée Saint- \nFrançois, Laval, QC H7C 1S5, 450-661-2001, QUE_CPI_Agents_DL@cbsa-asfc.gc.ca. Laval \nIHC serves the following regions: Québec, Atlantic and Northern Ontario (Cornwall and Ottawa \nexclusively); \n \nThe Toronto IHC has a maximum capacity of 195 detainees. It is located at 385 Rexdale Blvd, \nToronto, ON M9W 1R9, 416-401-8505, CBSA-ASFC_GTAR_EIOD-Dist_Holding_Centre@cbsa-\n27 \n \nasfc.gc.ca . Near the Pearson International Airport. Toronto IHC serves the following regions: \nGreater Toronto Area, Southern Ontario and Northern Ontario (except Cornwall and Ottawa); \n \nThe BC IHC has a maximum capacity of 73 detainees. It is located at 13130 76th Avenue, \nSurrey, BC V3W 2V6, 778-591-4223, PAC-Dist_CBSA_EID_Detention_Operations@cra- \narc.gc.ca . Surrey IHC serves the following regions: Pacific and Prairies \n \nProvincial correctional facilities \n \nProvincial correctional facilities are used in regions where placement in an IHC is not suitable or not \navailable. Individuals detained under IRPA who have a total score of 5 to 9 points (if risk cannot be \nmitigated in an IHC) and 10 points and more on the NRAD form [BSF754] should be held in a provincial \ncorrectional facility. Please see Annex E for a list of commonly used detention facilities and the official \nlanguage of service available. \n \nThe CBSA has several arrangements and bilateral agreements with provincial governments to allow the \nuse of provincial correctional facilities by CBSA detainees. Currently, the CBSA has bilateral agreements \nwith the following provinces for the purpose of immigration detention: Alberta (2006), Ontario (2015) with \namending agreement (2017) and second amending agreement (2020), Quebec (2017), British Columbia \n(2017), New Brunswick (2019), Nova Scotia (2018). \n \n \n \nPolice stations \n \nIn some regions, detainees are detained at police stations or local RCMP detachment for a few days or \nless until transferred to a provincial correctional facility or pending transfer to CBSA custody. This is more \ncommon in isolated communities where no IHC nor provincial correctional facility is in near proximit y. \n \n \n \n8. Detentions program monitoring \n \nThe CBSA conducts internal reviews of its detentions program. These reviews help ensure operational \nalignment with national and international detention standards, adherence to CBSA national detention \npolicies and directives, as well as consistency in officer-decision making, enabling effective management \nof the program and continual process improvement. In addition, the CBSA’s detentions program is \nmonitored by other organizations. The regular independent and unbiased monitoring reports have been \nkey in ensuring that reviews and recommendations are transparent, impartial and in the best interest of \nimmigration detainees. \n \n8.1. Canadian Red Cross \n \nSince 1999, through arrangements with the federal government, the Canadian Red Cross (CRC) has \nbeen independently monitoring the CBSA’s immigration detention program to ensure that persons \ndetained pursuant to the IRPA are held and treated in accordance with applicable domestic standards \nand in compliance with international instruments to which Canada is signatory. During this time, the CRC \nhas conducted site visits to IHCs, provincial correctional facilities and other detention facilities across\n28 \n \nCanada and has provided important feedback and expert advice on policies and programs to the CB SA \nthrough their annual reports, detainee visits, communication and regular meetings. \n \nIn 2021, the contract was renewed with the CRC for the continued monitoring services of Canada’s \nimmigration detention program to ensure that the CBSA’s immigration detention program meets both \nnational and international immigration detention standards. Under the contract, the CRC conducts \nongoing site visits throughout the year, report on its findings and provide recommendations to the CBSA \nto help improve the overall immigration environment for detainees. To this end, the CBSA collaborates \nwith the CRC and both parties have agreed to the following: \n \n \nThe CBSA will provide the CRC unfettered access to all persons being held in detention facilities \nunder the control and management of the CBSA. As required, the CBSA will escort the CRC and its \nresources into IHC facilities and areas where they will meet with immigration detainees to conduct \ntheir confidential meetings. \n \nIn cases where the CRC is denied access to non-CBSA facilities, the CBSA Region or Headquarters \nwill endeavour, to the fullest extent possible and subject to any lawful limitations, to facilitate access \nto immigration detainees being held in detention facilities under the control and management of other \nfederal, provincial, territorial or municipal authorities. \n \nFollowing the initial detention review by the IRB and after 48 hours, in accordance with the legislative \nand/or procedural protocols established by the CBSA, the CBSA will notify the CRC’s established \npoint(s) of contact of unaccompanied minors being detained under the age of 18, or of any other \nsignificant event. \n \nThe CBSA will provide limited information regarding a detainee’s case history (e.g. country of \ncitizenship and/or country of origin, gender, and language spoken) that is required by the CRC to \neffectively conduct monitoring visits with detainees and which is relevant to assess detention \noperations. These data elements do not identify any individual(s) and are not considered personal \ninformation. \n \nThe CBSA will notify the CRC when an emerging issue or incident occurs (e.g. hunger strike, \nallegation of abuse, death in custody) so that the CRC may conduct a monitoring visit to ensure the \nwell-being of other detainees as well as the detention environment. \n \nCBSA Notification Requests \n \n \nUnaccompanied Minors: At first contact with an unaccompanied minor, the CBSA regional \nmanagement will notify the CRC in writing as soon as possible by sending an email message to: \nIDMP@REDCROSS.CA. On the subject line, the CBSA regional management is to indicate: “CBSA \nNotification Request: Unaccompanied Minors” and the facility or location where the minor is being \nheld. \n \nEmerging Issues: Following the same communication protocol, the CBSA regional management will \nalso notify the CRC when an emerging issue or incident occurs such as a hunger strike, protest, \nallegations of abuse, or lockdown. \n \nDeath in Custody: Following a death in custody, the CRC is not expected to intervene while the \nprovincial or responsible local authority undergoes its investigation. However, the CBSA regional \nmanagement will notify the CRC of the death in custody in order for the CRC to conduct a monitoring \nvisit of immigration detainees held in the detention facility to ensure their continued well-being and a \nhealthy detention environment following the incident.\n29 \n \n8.2. United Nations High Commissioner for Refugees (UNHCR) \n \nAll CBSA facilities are subject to independent monitoring of detention standards by the UNHCR. Canada \nis a signatory to the 1951 Convention Relating to the Status of Refugees and the 1967 Protocol Relating \nto the Status of Refugees. Under article 35 of the Convention, Canada is required to co-operate with the \nUNHCR in the exercise of its functions and will, in particular, facilitate its duty of supervising the \napplication of the provisions of this Convention. In order to enable the UNHCR to finalize performance \nmanagement reports, Canada is required to provide the UNHCR thorough information and statistical data \nrequested concerning the following: \n \n \nthe condition of refugees; \n \nprogress in implementing this Convention; and \n \nlaws, regulations and decrees that are, or may hereafter be, in force relating to refugees. \n \nRefugee claimants must be able to contact and be contacted by the local UNHCR office. \n \n \n \n9. Procedure: Detention \n \nArrest \n \nUnder sections A55(1), (2) and (3), an officer may arrest and detain a person. For complete information \non the procedures for arrest under the IRPA, see ENF 7, Immigration Investigations and IRPA s.55 \nArrests/Detentions. \n \nDetention \n \nThe following table includes tasks that must be completed once a decision is made that the person’s \ndetention will be continued and they will be placed in a detention facility. \n \nTask \nResponsibility and \nReferences \nUploaded to GCMS \nPaper copies \nCase file \nDetainee or \ndesignated \nrepresentative \nDetention \nFacility \nIRB \nUse an accredited interpreter where a detainee does not understand one \nof the Canada’s official languages to ensure procedural fairness and fill out \nform: Interpreter Declaration [IMM1265B]. \nOfficer \n \nSee Using the services of \nan accredited interpreter \n \nX  \n \n \nPhotograph and fingerprint the detainee, if not already done during the \narrest process. \nOfficer \n \nSee ENF 12 Search, \nSeizure, Fingerprinting \nand Photographing \n \nX  \n \n \nGive the detainee the brochure “Information for people detained under the \nImmigration and Refugee Protection Act” [BSF 5012] and any other \nregional detention facility information. \nOfficer \n \n \nX\n30 \n \n \nSee section 4.3 to select \none of the 16 languages \navailable. \n \n \n \n \n \nConduct a visual check or video monitoring of detainees while in short- \nterm detention rooms or cells at least once every 15 minutes. Fill out \nDetention Cell Log form BSF481. \n \nIf a detainee is believed to be suicidal or self-harmful, constant visual or \nvideo monitoring is required. \nOfficer or contracted \nsecurity guards \n \nSee section 10, Care of \ndetainees while in short- \nterm detention rooms or \ncells. \nX \nX  \n \n \nOnly for detentions where the identity of a foreign national has not been \nestablished, fill out form Minister’s Opinion Regarding the Foreign \nNational’s Identity (under subsection 58(1)(d) of the Immigration and \nRefugee Protection Act) [BSF510]. \nMinister’s delegate \n(Superintendent, Manager, \nhearings officer) \nX \nX  \n \nX \nData entry in GCMS and NCMS or make arrangement with the nearest \ninland enforcement office for the earliest possible data entry to NCMS. \nOfficer \n \nSee section 9.1 Data entry \n \n \n \n \n \nFill out form Detainee Medical Needs [BSF674]. \nOfficer \n \nSee section 9.4, Detainee \nmedical needs \nX \nX \nX \nX \n \nFill out form National Risk Assessment for Detention [BSF754]. \nOfficer \n \nSee section 9.5 \nPlacement: National risk \nassessment for detention \nX \nX \nX \nX \n \nFill out form Order for Detention form [BSF304]. \nOfficer \n \nSee section 9.3 Order for \nDetention \nX \nX  \nX \n \nIf the detainee will be transported by contracted security guards, notify the \ncontracted security guards of all transport request as soon as practicable \nto minimize any delay. Provide them with a copy of Forms BSF304, \nBSF674 and BSF754 so that they can provide them to the detention facility \nwhen transporting the inmate. \nOfficer \n \nSee section 11.6 \nTransport \n \n \n \n \n \nProvide in writing to the detainee the name, address, telephone number of \nthe detention facility with any other regional detention facility information. If \nthe detainee will be detained in a provincial correctional facility, also give \nthe DLO’s or designed officer’s contact information. \nOfficer \n \n \nX \n \n \nFill out form Request for Admissibility Hearing/Detention Review Pursuant \nto the Immigration Division Rules [BSF524] and notify the IRB – \nImmigration Divisi on and save in GCMS evidence (e.g. copy of the \nfacsimile receipt) that the IRB - Immigration Division has been informed. \nOfficer \nX \nX  \n \nX \nNotify the duty manager, Hearings, and Detentions (CLO/DLO) of new \ndetention by email. \nOfficer \n \nX  \n \n \nThe Detention Oversight Form [BSF921] must be completed and uploaded \ninto GCMS for each continued detention case. \nManagement \n \nSee section 9.6 \nManagement review of \ndetention cases \nX  \n \n \n \nNotify the Canadian Red Cross by sending an email to \nIDMP@REDCROSS.CA and keep the email for each case involving: \nunaccompanied minors, and emerging issues and death in custody. \nCBSA regional \nmanagement \n \nSee section 8.1 Canadian \nRed Cross \n \nX  \n \n \n \n9.1. Data entry \n \nDetention tracking information is very time sensitive and must be entered into the Global Case \nManagement System (GCMS) and the National Case Management System (NCMS) databases as soon \nas possible. Both systems are being used to track detainee cases and to produce statistics for the \ndetentions program management and for public reporting.\n31 \n \nGCMS \n \nMost detention forms, such as a detention order, are available in GCMS, which allows officers to fill them \nout electronically. To ensure consistency and the ability to track cases, all GCMS-generated detention \nforms must be saved in the associated activity (for example, examination, arrest). \n \nSome detention forms, such as the “National Risk Assessment for Detention” and “Detainee Medical \nNeeds” forms, are currently available only as a fillable PDF, which allows officers to fill them out \nelectronically. To ensure consistency and the ability to track cases, all filled-out detention forms that are \nnot available in GCMS must be saved in GCMS, under the detainee’s unique client identifier (UCI). \nMultiple forms may be simultaneously scanned and uploaded in the same attachment, as long that they \nare clearly identified: \n \n• \nNavigate to “Clients” > “Documents” > “ID Supporting Documents” sub tab. \n• \nCreate a new record. \n• \nSelect the following options: \n• \nType: CDN Immigration Doc \n• \nSub Type: Client Submission \n• \nDocument #: Form(s) BSF# \n• \nCountry of Issue: Canada \n• \nDocument Name: Name(s) of the form(s) \n• \nComplete the “Issue Date”. \n• \nAdd a new attachment in PDF format. \n \nNote: The ability to complete detention forms electronically does not mean that forms may be also be \nsigned electronically—staff must comply with current directives and policy concerning use of electronic \nsignatures. \n \nSee the Wiki GCMS reference materials, Arrest & Detain and Detained for Examination or MD Review, for \nmore details. It is essential that the request for detention review and the detention summary screens in \nGCMS be completed as soon as possible by either the officer or the minister’s delegate. If the detainee \ndetention facility or detention grounds change, it must be updated in GCMS. \n \nCompleted DMN and NRAD forms are to be uploaded into GCMS within 48 hours of an initial \nassessment, and within 7 days of a reassessment. \n \nNCMS \n \nThe NCMS must be used for tracking all detentions originating at ports of entry and inland offices. \n \nIf a detainee is being transferred to a detention facility, a National Risk Assessment for Detention event \nmust be completed under the ‘immigration hold’ tab in NCMS. Officers must create a new NRAD event, \nenter the total score in the disposition section and select a vulnerability category (if applicable). For \nprocedures on entering detention data into NCMS, please see the NCMS - User Guide. \n \nMost port of entry detention cases are forwarded to an inland enforcement office for ongoing case \nmanagement. The inland enforcement office will initiate the detention process in NCMS. However, if a \ndetention originates at a port of entry that does not have access to NCMS and the case does not need to\n32 \n \nbe managed by an inland enforcement office (e.g. a person is detained and released at a port of entry \nbefore the first detention review), then an e-mail request to initiate the detention process must be sent to \nthe nearest inland enforcement office for the earliest possible data entry to NCMS. \n \nFor NCMS tracking of minors on Alternative Arrangement, Housing or Detention, please see the Standard \nOperating Procedures. \n \n9.2. Order for Detention \n \nThe form Order for Detention [BSF304] is used when an individual is detained under A55 and needs to be \nplaced or transferred to a detention facility (i.e. IHCs, provincial correctional facilities and police stations). \nOfficers must fill out the form and the receiving detention facility staff must be given a copy. At the time of \nthe transport, the detainee must receive in writing: the name, address and telephone number of the \ndetention facility. If the detainee is detained in a provincial correctional facility, the DLO’s or designated \nofficer’s contact information must also be given to the detainee. The form is not required if the detainee is \nreleased before any placement or transfer to a detention facility has occurred. \n \n9.3. Detainee medical needs \n \nThe intent of the “Detainee Medical Need” (DMN form) [BSF674] is to ensure national consistency in \ngathering and sharing information regarding detainee medical needs with detention staff. The officer \nmaking the detention decision must complete the DMN form to safeguard the safety and well-being of the \ndetainee. This form is not required if the detainee is released before any placement or transfer to a \ndetention facility has occurred. An information session on the Detainee Medical Needs form is available to \nofficers in the following training and learning section: http://atlas/pb-dgp/res/toolkit-outils/detention/forms- \nformulaires/index_eng.asp \n \nInformation contained in the health condition section is based on information stated by the detainee, and \nits accuracy cannot be validated before a consultation with a health care professional. The form is not a \nmedical diagnosis but a tool for detention staff to note any information pertaining to the detainee’s self- \nidentified needs, before the detainee has their initial consultation with a health care professional. The \nform contains information on the detainee’s health needs (such as mobility impairment) and life- \nthreatening health conditions (such as heart disease, diabetes or allergies). In addition, the DMN form \n[BSF674] contains emergency contact information. If the detainee provided contacts in this section, the \nCBSA will contact the individual listed in the event of a life threatening health condition or death of the \ndetainee in CBSA custody or control during the detention period. If required, the detainee’s personal \ninformation will be shared with the emergency contact. See section 10.3, In-custody death or serious \ninjury notification, for more details. \n \nIn addition, the DMN form [BSF674] contains specific questions to capture self-identified mental health \nconditions (such as depression or bipolar disorder) and indicators (such as a previous suicide attempt), \nwhich may indicate a predisposition to suicide and self-harm. Mental health questions are of a sensitive \nnature and should be asked in a non-judgemental way. Officers should use a friendly and accepting tone \nand allow the person time to speak. If a person being detained is believed to be suicidal or self-harmful, \nsee section 10.1, Procedure: Suicidal and self-harmful detainee.\n33 \n \nThe DMN form [BSF 674] must be placed in the detainee’s case file, and a copy of the form must be \ngiven to the following: \n \n \nthe detainee or designated representative (by hand, by mail or electronically); \n \nthe detention facility personnel (to the health care professional). \n \nParagraph 8(2)(a) of the Privacy Act (consistent use) allows the disclosure of information where the \ndisclosure is made for the purpose for which the information has been obtained. The individuals are being \ndetained for IRPA purposes regardless if the detention facility is owned or not by the CBSA, and the \ndisclosure is to ensure detainee well-being and to assess health needs. \n \nSubsequent assessments \n \nUntil the person is released from detention, a subsequent assessment using the DMN form [BSF674] \nmust be completed: \n \n \nAt least once every 60 days after every assessment if detainees are detained in a provincial \ncorrectional facility; or \n \nsooner if the detainee self-identifies a change in their medical condition or if a possible change in \ntheir medical condition is observed by any custodial staff regardless of the detention facility. \n \n*IHCs with contracted medical services on-site are exempt from completing subsequent DMN \nforms. \n \nThe re-assessment is crucial to ensure up to date information regarding the detainee’s medical needs is \navailable in the event a transfer to another detention facility or in a circumstance that would require the \nCBSA to notify the emergency contact(s). For detainees in a detention facility elsewhere (such as a \nprovincial correctional facility), the responsibility lies with a DLO or an officer designated to perform this \nfunction. \n \nFor detainees in an IHC, the responsibility lies with officers working at the IHC. They are expected to \ncontinue an active dialog with on-site medical services as well as the detainee to have a clear \nunderstanding of the detainee’s needs and to assist in the on-going placement and classification. \n \nUnder the guidelines outlined in section 9.1, completed DMN forms are to be uploaded into GCMS within \n48 hours of an initial assessment, and within 7 days of a reassessment. \n \n \n \n9.4. Procedure: National risk assessment for detention – initial and \nsubsequent assessments \n \nThe placement or transfer of a detainee to a detention facility cannot be used as a form of punishment. \nThe intent of the initial NRAD [BSF754] assessment is to ensure a national consistent approach to \ndetention placement through a transparent and objective risk assessment, based on historical and \navailable data. The officer making the detention decision must complete the NRAD form and identify the \ndetainee’s risk and vulnerability factors to safeguard the well-being of the individual, other detainees,\n34 \n \ncontracted staff and CBSA employees. Accurate NRAD information is critical in every detention case \ndestined for a provincial correctional facility or IHC. Any transfer or placement to an IHC must be done in \nconsultation with IHC IEOs or IHC management. This includes transfers between non-IHC regions to an \nIHC. \n \n*The NRAD is not required if the detainee is released before any placement or transfer to a detention \nfacility has occurred. \n \nPlease refer to 9.5 Triage: IHC review of the initial NRAD – placement and classification for more \ninformation. \n \nPlease refer to 11. Transfer of detainees for non-IHC regions to an IHC for more information. \n \n \n \nInitial NRAD assessment by the arresting officer or officer assigned to the case \n \nOfficers must rely on facts and evidence for which there are reasonable grounds to believe or suspect, \ndepending on the IRPA allegation when assessing each risk and/ or vulnerability factor. The risk and \nvulnerability factors when completing the NRAD are as follows: \n \n \nRisk factors #1 and #2 allocate points if there are reasonable grounds to suspect a detainee is \ninadmissible due to security grounds or organized criminality. \n \nRisk factor #3 allocates points based on the number of years that have passed since the last \nknown offence (this does not apply to in Canada criminality) or conviction, if any, which may \ncause inadmissibility for serious criminality or criminality. Offences where an individual was found \nnot guilty or where charges have been withdrawn must not be counted in the assessment. \n \nFor the purpose of completing risk factors #4 and #5, an officer may consider the last \noutstanding charge if the person has been charged but the trial has not been concluded, or the \nconviction date set. These questions apply equally to persons who have committed violent acts \nassociated with inadmissibility pursuant to paragraph A35(1)(a). Offences where an individual \nwas found not guilty or where charges have been withdrawn must not be counted in the \nassessment. The following table offers a general overview of common non-violent crimes, violent \ncrimes and severely violent crimes: \n \nCrime types \nCommon crime examples (with Criminal Code of Canada \nreferences) \nNon-violent crime \n \nPossession of child pornography (section 163.1(4)) \n \nOperation while impaired (section 320.14) \n \nTheft (section 322) \n \nBreaking and entering with intent, committing offence or \nbreaking out (section 348) \n \nFraud (section 380) \n \nPossession of a controlled substance (section 4 of the \nControlled Drugs and Substances Act) \n \nTrafficking in substance (section 5 of the Controlled Drugs \nand Substances Act) \nThreats or violent crime \n \nUttering threats (section 264.1)\n35 \n \n \n \nAssault (section 265) \n \nSexual assault (section 271) \n \nIncludes all severely violent crimes (see below) \nSeverely violent crime \n \nAssault with a weapon or causing bodily harm (section \n267) \n \nSexual assault with a weapon, threats to a third party or \ncausing bodily harm (section 272) \n \nAggravated sexual assault (section 273) \n \nMurder (section 229) \n \nManslaughter (section 234) \n \nRobbery (section 343) \n \nTorture (section 269.1) \n \n \nRisk factor #6 allocates points if in the last two years, a detainee was involved in a serious incident \nduring the arrest or was involved in a disciplinary action as a result of a major breach of the detention \nfacility rules of an IHC, a provincial or a federal correctional facility or a port of entry or inland office \ncell. It includes disciplinary actions that have occurred in detention facilities outside Canada. The \nCBSA’s National Immigration Detention Standard on Prevention and Management of Breaches \ndefines a major breach as the following: An act whereby a person commits, attempts to commit, \nand/or incites behaviour or acts that are violent, harmful to others or cause an unsafe environment for \ndetainees and other persons. Disciplinary action: a response to detainee behavior associated with \na breach of the facility rules or Canadian law. \n \nRisk factor #7 allocates points if a detainee previously escaped or attempted escape from legal \ncustody (e.g. from a detention facility or from the custody of an officer). \n \nRisk factor #8 allocates points if a detainee remains the subject of an unexecuted criminal warrant \nfor arrest. When completing the NRAD, warrants issued under immigration or traffic laws or other \nsuch statutes are not considered as criminal warrants and would not be applicable for this risk factor. \n \nVulnerability factor #1 reduces points if a detainee is a vulnerable person. Only one vulnerable \ncategory can be selected even if the detainee is part of more than one vulnerable category. Where a \nvulnerability has been identified on the NRAD, an assessment for referral to a Community Case \nManagement and Supervision (CCMS) service provider must be completed within 72hrs of the \nvulnerability being noted. Unless advised otherwise by health professionals, IHC staff will engage \nwith vulnerable detainees daily and log these interactions in DAMS. \n \nFor information on vulnerable persons, see section 6.6. \n \nAdditional Information \n \nDetails and any additional information supporting the officer’s recommendation (e.g. details of key risk \nfactors, the detainee’s behaviour, details given by the detainee, incidents and changes in the facility type \nfor detention). This includes the official language in which the detainee prefers to receive services. \n \nPreferred Official Language of services \n \nUnder Section 3(3)(d) of the IRPA, and Part IV of the Official Languages Act (OL) the CBSA must \nconsider official language preference when deciding where to place an immigration detainee. Neither the \nIRPA nor the OL require that the placement decision be based solely on official language preference, but\n36 \n \nrather that preference be considered as one factor among others when determining in which facility to \nplace an immigration detainee. The proximity of a provincial detention facility offering services in the \npreferred official language will also be a factor in deciding where to place a detainee. To aid in these \nconsiderations, refer to the document Language Profile of Provincial Correctional Facilities in Annex E. \n \nOfficer Assessment \n \nBased on the total sum of points attributed to the risk and vulnerability factors, a detainee should be \ndetained in a detention facility according to the total score, as follows: \n \n \n0 to 4 points = IHC (where available) \n \n5 to 9 points = IHC or provincial correctional facility (default to IHC where risk can be mitigated) \n \n10 points or more = provincial correctional facility \n \n*In IHC regions, consultation with IHC managers or an IHC IEO should occur prior to placement of a \ndetainee within an IHC or provincial correction facility. For more information on triage, see section \n9.5.1. \n \nPorts of entry and inland offices in close proximity to an IHC must triage detainees for classification and \nplacement in an IHC or in a provincial correctional facility. Although ports of entry and inland enforcement \noffices not located in close proximity to an IHC can solely refer detainees for placement in a provincial \ncorrectional facility, officers will consult with a Superintendent or higher regional authority for port of entry \ncases, or an Inland Supervisor or higher regional authority for inland cases prior to transporting the \ndetainee. Inland enforcement offices may later refer detainees for transfer to an IHC based on the \ndetainee’s NRAD total score (see section 11). IHC managers or IEOs are the ultimate decision makers to \ndetermine if a detainee’s risk factors and behaviour can be appropriately managed within the IHC. \n \nTo ensure procedural fairness of each assessment or subsequent assessment, the detainee must be \ninformed of the risk and vulnerability factors taken into consideration, and officers must ask if there is \nanything the detainee would like to add that may impact the officer’s recommendation before completing \nthe assessment. The officer is not bound by the information given by the detainee; however, the \ninformation must be taken into consideration in compliance with procedural fairness. If a detainee refuses \nto speak with the officer, the officer should rely on the other information sources to complete the \nassessment (e.g. a file review, security guards’ observations, incident reports and a designated \nrepresentative). If the detainee was not afforded an opportunity to provide additional information, the \nofficer must provide the rationale on the NRAD. \n \nDetails of the key risk factors, criminal convictions, the detainee’s behaviour, preferred language of \nservice, or any other information supporting the officer’s recommendation must be recorded in the \nAdditional Information section of the NRAD. This section must be completed in full, statements such as \n\"refer to file\" are not acceptable notes to support the recommendation. \n \nThe decision must be communicated to the detainee, the NRAD must be placed in the detainee’s case \nfile and a copy of the form must be given to the following: \n \n \nthe detainee or designated representative (by hand, by mail or electronically); and \n \nthe detention facility personnel.\n37 \n \nParagraph 8(2)(a) of the Privacy Act (consistent use) allows the disclosure of information where the \ndisclosure is made for the purpose for which the information has been obtained. The individuals are being \ndetained for IRPA purposes regardless if the detention facility is owned or not by the CBSA, and the \ndisclosure is to ensure the safety of the detainee, other detainees and staff where the detainee is being \nheld. \n \nFor NRAD initial assessment, the detention placement recommendation shall be reviewed prior to the \nplacement of a detainee in a detention facility by the authorities outlined in section 9.6 (see section 9.6, \nmanagement review of detention decision, for more details). \n \n \nSubsequent assessments \n \nUntil the person is released from detention, a subsequent assessment using the NRAD form [BSF754] \nmust be completed: \n \n \nAt least once every 60 days after every assessment if detainees are detained in a provincial \ncorrectional facility; or \n \nSooner if new information or a change in circumstances has a repercussion on the detainee’s \ntotal score or the detention placement regardless of the detention facility. \n \nFor detainees held in an IHC, a NRAD reassessment should be completed if there is a change in \ncircumstances that could affect the NRAD score. \n \nSubsequent assessments must be supported by information to corroborate the status quo or the change \nin the facility type for detention. For detainees held in an IHC, the responsibility lies with officers working \nat the IHC. For detainees held in a detention facility elsewhere (such as a provincial correctional facility), \nthe responsibility lies with a DLO or an officer designated to perform this function and the assessment \nshall be reviewed by an Inland Supervisor or higher regional authority. Changes in the person’s risk and \nvulnerability factors, and the ability to mitigate that risk within an IHC should be considered at each \nassessment. Where a vulnerability has been identified on the NRAD, an assessment for referral to a \nCommunity Case Management and Supervision (CCMS) service provider must be completed within 72hrs \nof the vulnerability being noted. Unless advised otherwise by health professionals, IHC staff will engage \nwith vulnerable detainees daily and log these interactions in DAMS. \n \nRequests for an early subsequent assessment may be received from individuals (e.g. counsels and \ndetainees) from time to time. These requests must be responded to with notes to file and any new \ncircumstance must be taken into consideration. When a request is made, if the officer responsible for \nfilling out the subsequent assessment is of the opinion that no circumstance has changed (i.e. no impact \non the NRAD total score of the detainee) then, no early subsequent assessment is needed. However, a \nformal response must be sent to the requestor, which will explain the NRAD subsequent assessment \nprocess and the decision. \n \nDetainees medically unfit for placement or transfer \n \nIf a health care professional does not recommend moving a detainee because of a medical condition, the \ninformation must be communicated to an IHC manager. In the case of disagreement, the IHC manager is \nthe ultimate decision maker to authorize, or deny a detainee’s placement or transfer.\n38 \n \nThe decision to authorize or deny the placement or transfer should be made in consultation with IHC \nhealth care professionals and take into consideration the safety and well-being of the detainee, other \ndetainees and staff. Due to information privacy laws, health care professionals may not be authorized to \ndisclose details or personal information to CBSA staff. However, they can make recommendations on \nhow to facilitate a detainee’s placement or transfer or give advice regarding when a detainee should be fit \nfor transfer. If an IHC manager concurs that a detainee is not medically fit for transfer, it should be \ndocumented on the NRAD form [BSF754] in the additional information section. Regular follow ups should \nbe done with the health care professionals in case the detainee’s medical condition improves. \n \nIn accordance with the guidelines set out in section 9.1, completed NRAD forms must be uploaded to \nGCMS within 48 hours of the initial assessment and within 7 days of a subsequent assessment. In \naddition, the final score obtained during the NRAD and the vulnerability factors must be registered in \nGCMS as soon as possible by the officer or by a manager in the inland office (if the GCMS is done by an \nOfficer at the POE). \n \n \n \n9.5. Triage: IHC review of the initial NRAD – placement and \nclassification \n \nIn IHC regions (Québec, Greater Toronto Area and Pacific) all continued detention cases must have the \ninitial detention placement decision reviewed by an inland enforcement officer working at the nearest IHC \n(Laval, Toronto, Surrey) The review of the initial detention placement is not required in non-IHC regions \n(Atlantic, Northern Ontario, Southern Ontario and Prairies). \n \nIn the event, based on operational requirements that the review of the initial detention placement is done \nremotely (e.g. by phone or email) it must be done prior to the placement of a detainee in a detention \nfacility. In the unlikely event that this cannot be done the rationale must be notated on the NRAD. \n \nEvery effort must be made to use the IHC as the default detention facility for placement where the level of \nrisk posed by the detainee may be mitigated. While the NRAD provides for an initial assessment of \nplacement, each case must be further evaluated to maximize use of the IHCs and minimize to the \ngreatest extent possible the use of provincial facilities for immigration detention. \n \nThe inland enforcement officer working within the IHC should consider the following when triaging - \nclassifying and placing the detainee within the appropriate detention facility: National Risk Assessment for \nDetention [BSF754];\n39 \n \n1) Detainee Medical Needs Form [BSF674]; \n2) Notes on file (e.g., criminal history, circumstances and nature of offences, past violence, \nassaults and escapes), administrative summaries, available reports (i.e., GMCS, NCMS, \nDAMS, law enforcement, and open source); \n3) The IHC IEO must consider the totality of the case including extenuating circumstances \nrelated to personal history/past behaviour, medical/ psychiatric history and information \ngathered during conversations with the detainee; \n4) IHC IEOs should also speak with medical services following their initial assessment and \nconsider their placement recommendations prior to finalizing the decision; \n5) The IHC IEO should, where possible, interview the detainee to gain a better \nunderstanding of the risk the person may pose and if the risk can be mitigated within the \nIHC; \n6) Only where risk cannot be mitigated (with a high degree of certainty) should a detainee \nbe placed in a provincial facility. Classification and placement within a provincial facility \nis in accordance with provincial procedures. \n \nIt is also advisable to speak with the arresting officer about the NRAD risk and vulnerability factors in \ncases where additional information may assist in detainee classification and placement decision. Once \nthe initial NRAD placement decision has been reviewed by the IHC IEO, the name of said IEO must be \nrecorded on NRAD form. In a situation where significant amendments are required to the initial NRAD \ntotal score or detention placement, the IHC IEO is responsible for filling out a new NRAD form (BSF754). \n \nAn IHC IEO placement and classification may be audited by an IHC manager. The IHC manager is the \nultimate decision makers to determine if a detainee’s risk factors and behaviour can be appropriately \nmanaged within the IHC. \n \nOngoing classification and placement of detainees within detention \nfacilities \nIn IHC regions, every effort must be made to leverage the IHC as the default placement location. In \naddition, the General Living Units should be utilized as the default living area unless there is the presence \nof risk factors that could not be mitigated. \n \nThe detainees must be afforded the opportunity to discuss their classification and placement at \nadmission, during orientation, or any time while under Immigration detention. Should a detainee wish to \nspeak with an officer either within an IHC or at a provincial detention facility the officer should make \nthemselves available as soon as practicable. \n \nThe classification and placement of an individual is not static. It is dynamic and can evolve over time \nbased on observations and the assessment of behaviours exhibited within the IHC or provincial \ncorrectional facility. IHC IEO must reassess classification and placement regularly, in conjunction with the \nDLO (provincial facilities), and when any changes in detainee behaviour are noted or new information is \nreceived regarding the risk the detainee poses to themselves and/or others. The review of detainee \nclassification and placement continues until release regardless of placement (IHC or provincial facility). \nClassification and placement decisions must be communicated to the detainee in a language or manner \nthe detainee can understand, this may include the use of an interpreter. \n \nAs a matter of principle and for safety and security reasons the following must be applied when placing or \nclassifying individuals: \n \n \nMen and women are to be separated; \n \nUnaccompanied minors are to be separated from adults;\n40 \n \n \nFamily unity: children will remain with a parent/legal guardian within the IHC, unless it is in the \nbest interests of the child. \n \nOther separation criteria may be justified to protect detainees in situations of particular vulnerability due \nto: \no \nAge; \no \nHealth condition; \no \nEthnicity; \no \nSexual orientation or gender identity. \n \nFor information on vulnerable persons, see section 6.6. \n \n9.6. Management review of detention cases for quality assurance \n \nDespite not being a legislative requirement, the CBSA has established an administrative process to \nensure management visibility of all continued detention cases. This process will ensure that the term \n“continued detention” refers to the decision, following an arrest, to maintain detention and have the \nindividual placed in a detention facility. No management permission is needed for officers to initiate a \ndetention. In addition, no management review is needed if the arresting officer determines release is \nappropriate. \n \nAll continued detention cases shall be reviewed by one of the following members of management: \n \na Superintendent (FB05) or higher regional authority for all Port of Entry cases; or, \n \nan Inland Supervisor or Manager (FB05/FB06) or higher regional authority for all Inland cases \n \nThe management personnel conducting the review of the detention must have experience in the \napplication of the IRPA and to be aware of detention and release procedures. In addition, they must have \naccess to GCMS. \n \nThe Management Review must be done in person prior to the IRB’s first detention review. Management \nreviewing the detention case must consider any new information and be able to answer this question: \n \n \nDoes the legal authority exist in the IRPA for this detention? \n \nThe management review should focus on the legal authority of the detention and when clarification is \nnecessary, they should ask questions to better understand the relevant facts of the case. The following \npoints must be clarified: what is the detainee’s immigration status (permanent resident, protected person \nor foreign national)? Where the detention has occurred (in Canada or on entry into Canada)? What are \nthe applicable detention grounds? If there is no justification for continued detention, the reviewing \nmanagement must take the necessary steps to ensure the immediate release of the detainee. \n \nReviewing management must complete the Detention Oversight Form to confirm that all detention forms \nare properly completed, placed in the person’s file, and, required forms are uploaded in GCMS. They \nmust ensure that detention factors are clearly stated in the notice of arrest and/or detention [BSF561], \naligned with the selected detention grounds and supported by relevant facts. They must ensure that the \nbest interest of the child and ATDs have been considered and if they would be deemed appropriate at a \nlater time. Finally, reviewing management must confirm that data entry in NCMS is done or arrangements \nwere made for their completion. The Detention Oversight Form is to be uploaded into GCMS following\n41 \n \ncompletion by the manager or supervisor reviewing the file. See Annex A – Detention Oversight Form, \nfor more information. \n \nIf any error is noted on a form during the management review, the reviewing manager or supervisor \nshould undertake to provide immediate feedback to the officer, and take corrective measures as \nnecessary. If a minor error is noted after a form is completed and signed and prior to being uploaded into \nGCMS, the form should be returned to the original officer for correction. Minor errors include \ntypographical errors such as a spelling error in a name or incorrect date of birth. To correct the form, the \nofficer should draw a line through the incorrect entry, initial and date the entry, then document the correct \ninformation on the form. It isn’t necessary to complete a new form in order to correct a minor error. The \ncorrected form should then be uploaded into GCMS as required. \n \nOnce the detention paper file is completed and has been reviewed by management, it may leave the \noriginating port of entry or inland enforcement office. \n \n \n \n9.7. Review of Detention \n \nAlthough there is no legislated requirement to review a detention decision prior to the 48-hour review by \nthe IRB, the Review of Detention form [BSF920] was created to capture an officer’s decision to exercise \ntheir authority under A56 and facilitate situations in which a review of the reasons for detention is deemed \nnecessary. The form allows a designated officer to capture the rationale for continued detention or the \nrationale for release and outline any suitable ATD. Only those officers who have completed the Minister’s \nDelegate Review course should be conducting reviews under A56(1). The review should only be done \nprior to the 48-hour review by the IRB. \n \n \n \n9.8. Detention review after 48-hours and informing the IRB \n \nIf the detention continues, the Immigration Division of the IRB will review the reasons for continued \ndetention within 48 hours following the start of the detention or as soon as possible thereafter. As \nrequired under A55(4), the officer shall without delay give notice to the Immigration Division by sending \nthe form “Request for admissibility hearing/detention review pursuant to the Immigration Division rules” \n[BSF524] to the registry by facsimile. The officer will retain in the file evidence that the Immigration \nDivision has been informed. A copy of the facsimile receipt is evidence that the transmission has been \ncompleted. For more information on detention review pursuant to A57, as well as the rules applicable to \nthe Immigration Division, see ENF 3, Admissibility, Hearings and Detention Review Proceedings. See \nsection 9.1, data entry, for more information. \n \nShould an individual be subject to a 48-hour detention review and detention be maintained by the IRB \nmember, the detainee must be brought before the Immigration Division at least once in the seven-day (7) \nperiod following the first review, then at least every thirty (30) days following the preceding review. When \nthe Immigration Division has jurisdiction, that is, after the first detention review is held, hearings officers \nmay make an application for an early detention review if continued detention is no longer justified.\n42 \n \nThe process for a designated foreign national and an individual named in a security certificate are \ndifferent. For more information on detention review pursuant to the Immigration Division Rules, see \nENF 3, Admissibility, Hearings and Detention Review Proceedings. \n \n \n \n10. Care of detainees \n \nCBSA is responsible for ensuring that individuals who are detained under IRPA are detained in an \nenvironment that is safe and secure and that all reasonable efforts are made to meet the physical, \nemotional and spiritual needs of the detained individual. \n \nShort-term detention rooms or cells \n \nA short-term detention room or cell is an area that the CBSA has designated as secure at a POE office or \nan Inland Enforcement office pending the detainee placement or transfer to another location. A short-term \ndetention room or cell is not considered as a detention facility because it was not designed for long \ndetentions and few services are available to detainees. Every reasonable effort should be made to ensure \nthat a detainee does not spend more than 24 consecutive hours in a short-term detention room or cell \nbefore their release or transfer to a more suitable detention facility. \n \nOfficers or contracted security guards must conduct a visual check or video monitoring of detainees while \nin short-term detention rooms or cells at least once every 15 minutes by using the Detention cell log \n[BSF481]. Officers should consult and follow the EN manual Part 6 – Chapter 2: Care and Control of \nPersons in Custody. \n \n10.1. Procedure: Request for personal items or blankets while in a \nshort-term detention room or cell \n \nIf a detained individual requests a personal item of clothing or blanket for warmth, officers should conduct \na risk assessment to determine the level of risk or harm if an item is provided to the individual. \n \nConsiderations: \n \n \nRisk of self-harm \n \nMental health concerns \n \nUnderlying medical conditions \n \nRisk to officers \n \nCriminal history \n \nBehaviour (e.g. threat cues) \n \n*Risk assessment factors to be considered by the officer are non-exhaustive and are dependent on the \nsituation and/or circumstances \n \nOnce the risk assessment is completed and the officer has not identified any apparent safety concerns, \nthe officer should consider providing the individual with their own clothing first. It is important that officers \nexamine the clothing prior to providing it to the detainee for contraband or weapons. However, in the\n43 \n \nsituation where no additional clothing is available or suitable, the officer should then provide a disposable \nblanket. \n \nIn cases where the individual requests a personal item or blanket, officers should record the request and \naction(s) taken in their CBSA notebooks. \n \nOnly single use blankets are to be provided. Re-usable blankets provide additional risks related to the \ntransmittal of disease. \n \n \n \n10.2. Procedure: suicidal and self-harmful detainee \n \nThe IRPA does not authorize the detention of an individual for their own safety or protection, except with \nspecial considerations for minor children. Persons who are believed to be suicidal or prone to self-harm \nare considered vulnerable persons, see sections 6.6. If an officer has reason to believe an individual is \nsuicidal or prone to self-harm, the first intervention is for the officer to show concern and speak with the \nindividual. For more information, officers should complete the online training course entitled “Prevention \nof Suicide and Self-Harm among Detainees” (H2047-P) available through the CAS portal. \n \nMental health questions are of a sensitive nature and should be asked in a non-judgemental way. Officers \nshould use a friendly and accepting tone and allow the person time to speak. Contrary to common belief, \nasking someone if they are having thoughts of suicide will not make them suicidal. If an officer is \nconcerned about a risk of suicide, the officer must ask questions to the detainee. The following examples \ncan be used to determine if the detainee has thoughts of suicide: \n \n \nThe situation you describe sounds serious. I want to know if you have considered or are \nconsidering suicide? \n \nI can see you are feeling down or panicky. Sometimes when people feel like this, they have \nthoughts of killing themselves. Are you thinking of suicide? \n \nIf a detainee says that they are thinking about ending their life, the officer must acquire additional \ninformation from the detainee. The following examples can be used to investigate the detainee’s plan for \nsuicide: \n \n \nDo you have a plan for suicide? \n \nHow do you plan to take your life? \n \nWhere do you plan to do this? \n \nDo you have a means to do this? \n \nThose at the highest risk for suicide in the near future have a specific suicide plan, the means to carry out \nthe plan, a time set for doing it and an intention to do it. If a detainee has a plan and intends to end \nhis/her life soon, do not leave a suicidal person alone. Officers should call an IHC health care \nprofessional (if available) or Local Crisis Centres right away and put them in contact with the detainee.\n44 \n \nAt a port of entry or an inland enforcement office, if a detainee is believed to be suicidal or self-harmful, a \nconstant visual check or video monitoring by an officer or a contracted security guard is required by using \nthe Detention cell log [BSF481]. The detainee is to be kept under continuous monitoring until: \n \n \nit is discontinued by the immediate superintendent/manager on duty; \n \nthe detainee is released from custody; or \n \nthe detainee is transferred to an IHC or a provincial correctional facility. \n \nOnce the detainee has been transferred to an IHC or a Provincial correctional facility, the health care \nprofessional will make an assessment to determine if the monitoring should continue or not. If transferred \nto an IHC, and it is determined that enhanced monitoring is required, the detainee shall be monitored in \naccordance with the post orders of the facility and monitoring will include visual and verbal engagement of \nthe detainee by CBSA personnel or contracted guard services when and where necessary. \n \nWhere a vulnerability has been identified on the NRAD, an assessment for referral to a Community Case \nManagement and Supervision (CCMS) service provider must be completed within 72hrs of the \nvulnerability being noted. Unless advised otherwise by health professionals, IHC staff will engage with \nvulnerable detainees daily and log these interactions in DAMS. \n \n \n \n10.3. In-custody death or life threatening condition \n \nThe document, CBSA guidelines for responding to a serious incident and death in CBSA custody or \ncontrol, provides guidance to CBSA staff when there is a serious injury or death in CBSA custody or \ncontrol, ensuring consistency with the mandate of CBSA, and the objectives to demonstrate \nresponsibility, accountability, and transparency of CBSA’s activities. \n \nTimely and consistent responses to serious injury or death in CBSA custody or control are necessary to \nassure the public that the safety of the public, individuals within our care and custody, and staff is CBSA’s \ntop priority. This is done by: \n \n \nensuring the appropriate law enforcement agency has been contacted where appropriate; \n \ninitiating an internal administrative review when any serious injury or death occurs in CBSA \ncustody or control as soon as all immediate facility or safety issues have been addressed; \n \ndrafting a thorough and complete report with clear recommendations and taking appropriate \naction following an incident; \n \nsharing any findings that could reduce the likelihood or impact of a similar incident occurring in \nthe future; and \n \ncooperating with the Police, Coroner or other investigative Agency in their investigation of the \nincident, while ensuring that issues of jurisdiction are properly considered. \n \nRefer to CBSA guidelines for responding to a serious incident and death in CBSA custody or control for \ndetailed information. \n \nAnnex E: Protocol Regarding the Death of an Individual Detained Pursuant to the I mmigration and \nRefugee Protection Act provides instruction and operational guidance for CBSA staff and third- \nparty service providers working within a CBSA IHC or providing transportation services. In addition, it\n45 \n \nprovides guidance on situations where death occurs at a hospital, in a hearing room or any pre- \nhearing holding area, or during transfer between any of these aforementioned locations where an \nindividual is under detention pursuant to the IRPA. The second part of the protocol provides instruction \nand operational guidance for CBSA staff in situations where a death occurs in a federal, provincial or \nmunicipal correctional facility where the deceased was detained pursuant to the IRPA. \n \nNote: This protocol does not apply in situations where death occurs at a Port-of-Entry, during an inland \ninvestigation or within the removals stream pursuant to IRPA. \n \n \nNotification for in-custody death or of a life threatening condition \n \nIn case of in-custody death, where there is an investigative body (e.g. local police or RCMP) involved, the \nnotification of emergency contact will be undertaken by them. In cases where an investigative body is not \nundertaking the notification, it will be done by the regional director general. \n \nIn the event of a life threatening health condition to the detainee in CBSA custody or control during the \ndetention period, if requested by the detainee on the DMN form [BSF674], the duty manager has the \nresponsibility to contact the emergency contact. Phone calls to emergency contact(s) are only required in \ninstances where we have reasons to believe the condition is life threatening or death is imminent. \n \n \nProtocol for public communication in the event of a death or serious injury \n \nThe CBSA has developed a protocol concerning communications procedures when dealing with the \ndeath or serious injury of a detainee while in CBSA custody. The objectives are: \n \n \nTo adopt a clear, consistent and transparent approach within the CBSA for public \ncommunications related to deaths and serious injuries in CBSA custody, while respecting federal \npolicies and legislation such as the Privacy Act and to be in line with Public Safety \nportfolio partners. \n \nTo provide a common platform to communicate such occurrences in a transparent and \nconsistent manner; \n \nTo ensure that all CBSA communications align with the CBSA Communications Policy and the \nGovernment of Canada (GoC) Communications Policy; and comply with the Privacy Act, Official \nLanguages Act (OLA), CBSA policies, and other associated regulations. \n \nPlease refer to the Public Communications Protocol – In-custody Death or Serious Injury for more details. \n \n \n \n \n \n11. Transfer of detainees to an IHC \n \nThis section is intended to clarify options regarding placement and transfer of detainees to an IHC (i.e. \nLaval, Québec, Toronto, Ontario, and Surrey, British Columbia). Based on the detainee’s NRAD score, \nports of entry and inland offices near an IHC may refer detainees for placement in an IHC, if transport can \nbe easily facilitated the same day, or in a provincial correctional facility. Ports of entry and inland\n46 \n \nenforcement offices not located in close proximity to an IHC can solely refer detainees for placement in a \nprovincial correctional facility. However, inland enforcement offices may later refer detainees for transfer \nto an IHC based on the detainee’s total NRAD score. The guiding principles for achieving national \nconsistency in the placement and transfer of detainees from a non-IHC region to an IHC region are as \nfollows: \n \n \nIHCs play a key role in the effective management of the CBSA national detention program, and \nare available to all regions; \n \nBased on the NRAD assessment, IHCs must accommodate the maximum number of detainees \npossible, as to reduce reliance on provincial correctional facilities, regardless of where a \ndetention is originating from; \n \nDetainee placement and transfer requests from non-IHC regions must be accepted in the same \nway as if requests were originating from within the IHC region; \n \nWhere detainee transfer to an IHC is requested, all efforts must be made to facilitate detainee \nplacement and transfer to an IHC, and in case of disagreement, the IHC manager is the ultimate \ndecision maker. \n \n \nIHCs and areas served \n \n \nPlacement in an IHC \nTransfer to an IHC \n \nThe following ports of entry and inland \noffices are near enough to an IHC to expect \na same day detainee transport: \nThe following inland offices are further away \nfrom an IHC but may request a detainee \ntransfer to an IHC: \nLaval \nIHC \n \nNorthern Ontario Region: Cornwall, \nPrescott, Lansdowne and Macdonald- \nCartier International Airport ports of \nentry. \n \nNorthern Ontario Region: Cornwall, \nOttawa and Gatineau inland \nenforcement offices. \n \nAtlantic region: all inland enforcement \noffices. \nToronto \nIHC \n \nSouthern Ontario Region: Fort Erie, \nNiagara Falls Rainbow Bridge, \nQueenston Lewiston Bridge and London \nInternational Airport ports of entry. \n \nSouthern Ontario Region: London and \nNiagara Falls inland enforcement \noffices. \n \nNorthern Ontario Region: Kingston and \nThunder Bay inland enforcement \noffices. \n \nSouthern Ontario Region: Windsor and \nSarnia inland enforcement offices. \nBC IHC \n \nPacific Region: Vancouver and lower \nmainland International Airports port of \nentry. \n \nPacific Region: Vancouver and lower \nmainland inland enforcement offices. \nPrairies Region: All inland enforcement \noffices. \n \nPacific Region: All inland enforcement \noffices. \n \nTransfers to an IHC other than the identified serving IHC, may be considered on a case by case basis, \nbut should not be common practice. The form, Request to Transfer Detainee [BSF915] to an Immigration \nHolding Centre can be used to request a transfer to an IHC.\n47 \n \n11.1. When a detainee placement or transfer should be considered \n \nDetainees with a NRAD total score of 0 to 4 and 5 to 9 points (if risk can be mitigated) may be placed in \nor transferred to an IHC. In non-IHC regions, prior to making the placement or requesting the transfer of a \ndetainee to an IHC, officers must take into consideration any relevant factors including the following: \n \n \nthe expected length of detention; \n \nthe imminence of a release on an alternative to detention; \n \nthe case complexity; \n \noutstanding criminal court matters \n \nthe detainee’s opinion; \n \nthe detainee’s family location and relationships; \n \nthe detainee’s legal or designated representative’s opinion; \n \nother personal ties to a specific region. \n \nWhile efforts should be made, non IHC-regions have flexibility in determining if and when a detainee \nshould be placed or transferred to an IHC-region. It is expected that some cases can be deemed not \nappropriate for placement or transfer to an IHC region for one or several factors listed above. These \nfactors and any additional information supporting an officer’s decision not to request a transfer to an IHC \nmust be recorded in the NRAD narrative section. \n \n11.2. Requirements \n \nIn order to achieve national consistency, IHCs will consider requests for transfers from both within and \noutside the region where an IHC currently operates. The office requesting a transfer to an IHC will \ncomplete the Request to Transfer Detainee to an Immigration Holding Centre form [BSF915] and will \nsubmit this form to the IHC. The IHC manager or an assigned officer will review the form and all relevant \ninformation, and decide if the detainee is appropriate for transfer to the IHC. This information will be \ncommunicated back to the requesting office as soon as the decision is made. \n \nRequirements for the transfer to an IHC \n \nWhen a detainee is held in a provincial correctional facility, consideration for transfer to an IHC should be \ngiven by the DLO or an officer designated to perform this function. \n \nInland enforcement offices not located in close proximity to an IHC may refer detainees for transfer to an \nIHC based on the detainee’s NRAD total score. Requests for transfer to an IHC should not be undertaken \nbefore a 48 hour detention review. If the detention is maintained, transfers may be requested after the 48 \nhour detention review for detainees transported by land or, after the seven day detention review for \ndetainees transported by air. In order to ensure management oversight and visibility of all detention \ncases, all decisions to transfer a detainee to an IHC shall be reviewed prior to the transfer by an IHC \nmanager. Where detainee transfer to an IHC region is requested, all efforts must be made to facilitate \ndetainee transfer, and in cases of disagreement, the IHC manager is the ultimate decision maker. Here \nare examples where it would be appropriate to transfer a detainee to an IHC: \n \n \nIn a non-IHC region, the detention of an inadmissible foreign national has been maintained \nfollowing the seven-day detention review because the detainee is unlikely to appear for removal. \nThe DLO does not expect an early detention review prior to the 30 day review. In consultation\n48 \n \nwith the detainee, the DLO recommends a transfer to an IHC. The detainee’s NRAD total score is \n3 and, after review by an IHC manager or designate, the detainee will be transferred to the IHC \nonce the transfer arrangements have been confirmed. \n \nIn a non-IHC region, an inadmissible permanent resident’s detention has been maintained \nfollowing the 30 day detention review on the grounds of danger to the public. The officer \ndesignated to fill out the NRAD subsequent assessment does not expect that the detainee will be \nreleased at the next detention review and they continue to await a danger opinion from IRCC. \nThe officer also noted that the detainee would like to be transferred to an IHC and has relatives in \nthe IHC region. The detainee’s NRAD total score is 9. After discussion and review by an IHC \nmanager or designate, it is determined that the detainee’s risk factors and behaviour can be \nappropriately managed within the IHC. The detainee will be transferred to an IHC once transfer \narrangements have been confirmed. \n \nIn preparation for the detainee’s transfer and to ensure the safety and well-being of the detainee, other \ndetainees and staff, the requesting DLO or the officer designated to perform this function has the \nresponsibility to obtain the following information from the detention facility where the detainee is currently \nbeing detained prior to the transfer: \n \n \nInformation regarding the detainee’s behaviour, incidents involving the detainee and/or reported \nbreaches of security; \n \nInformation regarding physical and mental health needs and current treatments; \n \nThe contact information of the healthcare professional at the provincial correctional facility; \n \nComments and recommendations from the healthcare professional to ensure the detainee is \nsuitable for transfer. \n \n11.3. Placement and transfer refusal \n \nIn exceptional circumstances, an IHC manager or designate may request the detainee placement or \ntransfer be postponed due to circumstances outside their control such as: a shortage of available space \nin the requested IHC section (male, female, and family) because it has nearly reached maximum capacity \n(over 85% occupancy), or a significant event is in progress (e.g., major disturbances such as protests, ) \nwhich has temporarily reduced the IHC’s capacity. In addition, an IHC manager or designate may refuse \na detainee placement or transfer if the perceived risk posed by the detainee cannot be mitigated in the \nIHC. Transfers to an alternate IHC may be considered on a case-by-case basis, but should not be \ncommon practice. \n \nShould an IHC manager or designate be unable or unwilling to accept a detainee from a non-IHC region, \nthe rational and/or potential future transfer dates must be communicated by the IHC to the requesting \nregion and to NHQ Detentions Unit, Detention-Programs@cbsa-asfc.gc.ca.\n49 \n \nDetainee case management \n \nDetainee case management following placement in an IHC \n \nWhen possible, the detaining office should continue to manage the detainee’s case file (e.g. investigation, \ndetention reviews and removal), and leverage remote working tools as required (e.g. teleconference and \nvideoconference) even after the detainee has been placed in an IHC. The case management would \nremain the responsibility of the detaining office along with any required systems updates (e.g. GCMS, \nNCMS). Detainee management and any associated system update will be the responsibility of the IHC. \nThe IHC will manage detention responsibilities such as: detention placement, discipline, NRAD and \nDetainee Medical Needs subsequent assessments, communication and meetings with community liaison \nofficer, NGOs, legal representatives, and other interviews, as required. Where the IHC does not have \ninformation to respond to detainee’s requests they should liaise with the file holder to obtain the required \ninformation. \n \nIf the detaining office is unable to manage the detainee’s case file (e.g. the hearings officers in the region \nare not available) then the whole detainee file must follow the detainee and the IHC region must be \nnotified. The referring superintendent, inland supervisor or assistant director must notify the receiving IHC \nwith the following information: UCI, a case summary and the next detention review date. The notification \nmust be sent to the following emails: \n \n \nLaval IHC: QUE_CPI_Agents_DL@cbsa-asfc.gc.ca, \nQUE_Mtl_ASFC_Aud_Det_Immigration_Adjoints_DL@cbsa-asfc.gc.ca and ASFC.O.I-R.DA/I- \nR.AD.O.CBSA@cbsa-asfc.gc.ca \n \nToronto IHC: CBSA-ASFC_GTAR_EIOD-Dist_Holding_Centre@cbsa-asfc.gc.ca \n \nBC IHC: PAC-Dist_CBSA_EID_Detention_Operations@cra-arc.gc.ca \n \nDetainee case management following transfer to an IHC \n \nIf the office where a detention originated is unable to continue to manage the detainee case file once it \nhas been transferred to an IHC, the whole detainee file must be transferred with the detainee and the IHC \nmust be notified. The superintendent, inland supervisor or assistant director must make a formal request \nto the IHC regarding the file transfer at least two working days before the physical transfer of the \ndetainee(see above for notification emails) to allow for sufficient time to respond and make arrangements. \n \n11.4. Notification \n \nLegal Counsel \n \nIn the event of a transfer to another region or facility, the detainee has the responsibility to inform legal \ncounsel and family members of the transfer and new location, if so desired. The CBSA must inform \ndetainees of their responsibilities and afford them the opportunity to contact their legal counsel prior to the \nanticipated transfer. If a detainee requires legal aid assistance, he/she should be referred to the provincial \nlegal aid services in the region where he/she is currently detained.\n50 \n \nImmigration and Refugee Board of Canada \n \nDetainee placement and transfer to an identified serving IHC will not have significant repercussions on \nthe Immigration and Refugee Board (IRB) process because it aligns for the most part with the current IRB \nregional structure. \n \nA detainee transfer to an IHC outside the scope of the IRB regional office that originally heard the matter \nrequires a notification from the receiving region as soon as possible to the board for the scheduling of the \nsubsequent detention reviews, and any other upcoming IRB hearings (e.g. a detainee transferred from \nPrairie regions to the Toronto IHC). Any such request to the IRB must be processed in accordance with \nthese guidelines (see ENF 3 Admissibility, Hearings and Detention Review Proceedings for more details). \n \n11.5. Transport \n \nThe transport of a detainee for placement or transfer in an IHC shall be undertaken in line with National \nDetention Standards for transport and the Enforcement Manual, Part 6, Chapter 8, on the vehicular \ntransport of persons under arrest or detention. \n \nTransport by contracted security guards or CBSA officers \n \nTo the greatest extent possible, contracted security guards should be used for detainee transport to and \nfrom facility locations. Where contracted security guards are not in place (i.e. regions without contracts), \nrequests to use contracted security guards from another region may be supported with the advance \napproval of the IHC manager or detentions program manager (i.e. a detainee from Northern Ontario \nregion is being transported to the Toronto IHC, and contracted security guards from Greater Toronto Area \nregion are requested for the transport). Requests for transfer should be timely and all parties should be \ninformed as soon as practicable to enable efficient planning and logistics, as well as minimize the use of \novertime and extra duty pay. \n \nContracted security guard contracts are in place in the following regions: Greater Toronto Area region, \nQuébec region, Prairies region, and Pacific region. Where a transport is inter-provincial, the contracted \nsecurity contract must support the use of contracted security guards for transport between provinces. \nDiscussions with the IHC or detentions program manager responsible for the administration of the \ncontracted security guard contract, as well as the contracted security supervisor or operational manager \nmay be required, to ensure that licensing in each province is in place. \n \nTransport by land \n \nAll security guard statements of work contain a clause, which includes travel within Canada and their \ntravel is not limited to one region. Security guards can be from the originating region, the receiving region \nor a combination of both as appropriate and approved by the IHC or detentions program manager of both \nregions. \n \nTransport by air \n \nCurrently the use of contracted security guards for transport of detainees by air is not available. Where a \ndetainee is arrested and detained and requires transfer to an admitting facility within the same region,\n51 \n \ntransport by air may be a viable option. Where transport by airplane is needed, transport of detainees will \nbe done by CBSA officers. \n \nThe assignment of CBSA officers to transport detainees (e.g. by air or the security guards are unable to \nmitigate the risk posed by a detainee) must be authorized by a delegated manager. \n \nTransport upon release \n \nIt is against the CBSA policy to use a federal government vehicle to transport non-detained passengers \ndue to liability concerns. This applies to all provinces regardless if the province insures the vehicle. The \nenforcement manual, part 6, chapter 8, vehicular transport of persons under arrest or detention, says: \"It \nis the policy of the CBSA to transport persons under arrest or detention when required in support of the \nenforcement and/or administration of CBSA legislation.\" CBSA officers do not have the legislated \nauthority to transport a person where the proceeding is not related to CBSA business. CBSA officers \ncannot use powers under the IRPA and IRPR to achieve goals that are not in relation with the Act or \nRegulations. \n \nUpon release, the individual is free to remain in the IHC region or to return to his home community in a \nnon-IHC region as long it does not contravene an imposed condition. Although it is not required by \nlegislation, the IHC region will pay the cost of the individual returning home in order to ensure the \nindividual safely reaches his/her destination. Nevertheless, the individual may refuse the CBSA \nassistance and travel by his/her own means. After approval by an IHC manager, the individual including \ntheir personal effects, will be provided prearranged transport to the degree possible (or money) and \nitinerary to return to the final destination of: \n \n \nPlace of original detention; \n \nhome community in Canada; or \n \nany other destination no further in distance than the place of original detention, if the individual \nchooses. \n \nThe most economical means (e.g. public transit, bus, train or plane) and arrangements should be made to \navoid the need for overnight accommodation. However, when the individual’s intention is to remain in the \nIHC region, there is no need to do so. \n \n \n \n12. Procedure: release by officer before the first detention \nreview \nIn the event that the grounds for detention cease to exist before the Immigration Division has conducted \nthe first detention review (48-hours review), an officer or manager may release the person being detained \nunder A56(1). Detention may no longer be justified because an ATD that sufficiently mitigates the risk \nposed has been identified. The following table contains the main tasks that must be completed to release \nan individual before the first detention review.\n52 \n \nTask \nResponsibility and \nReferences \nUploaded to \nGCMS \nPaper copies \nCase file \nDetainee or \ndesignated \nrepresentative \nDetention \nFacility \nIRB \nComplete the Review of Detention form [BSF920] \nOfficer or member of \nmanagement team \nX \nX \n \n \n \nIf the detainee has already been placed or transferred to \na detention facility, f ill out form Authority to Release from \nDetention [BSF566] \nOfficer or member of \nmanagement team \nX \nX \n \nX \n \nIf any conditions applies, fill out the form \nAcknow ledgement of Conditions the Immigration and \nRefugee Protection Act [BSF821] \nOfficer or member of \nmanagement team \nX \nX \nX \n \n \n \nSee prescribed \nconditions below . \nSee ENF 8 Deposits \nand Guarantees \nSee ENF 34 \nAlternatives to \ndetention \n \n \n \nData entry in GCMS and NCMS or make arrangement \nw ith the nearest inland enforcement office for the earliest \npossible data entry to NCMS. \nOfficer or member of \nmanagement team \n \n \n \n \n \n \nSee section 9.1 Data \nentry \nUse the original form Request for Admissibility \nHearing/Detention Review Pursuant to the Immigration \nDivision Rules [BSF524], w rite on it : RELEASED and \nnotify the IRB – Immigration Division \nOfficer or member of \nmanagement team \nX \nX \n \n \nX \n \nA56 authorizes the officer to impose any conditions that the officer considers necessary. These conditions \nare imposed using the “Acknowledgement of Conditions – IRPA” form [BSF821]. Procedures for \nDeposits and Guarantees are found in ENF 8, Deposits and Guarantees and procedures for ATD are \nfound in ENF34, Alternative to detention. \n \n \n \nPrescribed conditions for A34 Inadmissibility \n \nA56(3) states that if an officer orders the release of a permanent resident or foreign national who is the \nsubject of either a report on inadmissibility on grounds of security that is referred to the Immigration \nDivision, or a removal order for inadmissibility on grounds of security, the officer must also impose the \nprescribed conditions on the person. The conditions that must be imposed on a foreign national or \npermanent resident are set out in (R250.1). The designated CBSA official should use the BSF798 to \nimpose prescribed conditions and can refer to ENF5 Writing 44(1) Reports for additional information.\n53 \n \n12.1. Release: mandatory arrest and detention of a designated foreign \nnational \n \nUnder sub-section A56(2) of IRPA, officers cannot release a designated foreign national who is detained \nand who was 16 years of age or older on the day of the arrival that is the subject of the designation in \nquestion until: \n(a) a final determination is made to allow their claim for refugee protection or application for \nprotection; \n(b) they are released as a result of the Immigration Division ordering their release under section 58; \nor \n(c) they are released as a result of the Minister ordering their release under section 58.1. \nFor more information on detention review process, see ENF 3, Admissibility, Hearings and Detention \nReview Proceedings. \n \n \n \n12.2. Temporary releases \n \nThe CBSA sometimes removes a detained individual from a detention facility on a temporary basis in \norder to facilitate a required procedure in the enforcement process. For example, a detainee could be \ntemporarily removed from a facility in order to attend an interview with the consular representative of their \ncountry of citizenship for the purpose of obtaining a travel document. In these cases, Officers may \ncomplete the Authority to Release from Detention form [BSF566] and check the option “Into the custody \nof the Canada Border Services Officer or security personnel presenting this authority if the person is to be \nreturned to the detention facility on the same day”. This will allow the detention facility to release the \nindividual without the requirement to undertake their full discharge procedure.\n54 \n \nAnnex A - Detention Oversight Form\n55\n56 \n \nAnnex B – Child protection services and family centres \n \nAtlantic \no \nNova Scotia Child Welfare Services (17 district offices) \no New-Brunswick child protection 1-888-992-2873 or after hours emergency services 1-800- \n442-9799 (8 regional sub-district). \no \nNewfoundland and Labrador Child Protection Services (4 Regional Health Authority) \n \nQuebec \no \nAssociation des centres jeunesse du Québec (16 administratives regions) \no \nCentre jeunesse de Laval, 450-975-4000 \no \nCentre jeunesse de Montréal, 514-896-3100 \no \nBatshaw Youth and Family Centers (Montréal), 514-935-6196 \no \nCentre jeunesse de l’Estrie, 819-566-4121 \no \nCentre jeunesse de la Montérégie, 450 679-0140 \no \nProgramme régional d'accueil et d'intégration des demandeurs d'asile, (PRAIDA) \n(514) 731-8531 \n \n \nNorthern Ontario \no Ontario Association of Children’s Aid Societies (Ottawa, Cornwall, Lansdowne and \nPrescott) \no Ontario Association of Children’s Aid Societies (Thunder Bay, Sault Saint Marie and Fort \nFrancis) \n \n \nGreater Toronto Area \no \nOntario Association of Children’s Aid Societies (47 provincial societies) \no \nChildren's Aid Society of Toronto, 416-924-4640 \no \nCatholic Children’s Aid Society of Toronto, 416-395-1500 \no \nJewish Family and Child (Toronto), 416-638-7800 \no \nPeel Children’s Aid Society, 888-700-0996 \n \n \n \nSouthern Ontario \no \nChatham-Kent Children's Services, 519-352-0440 (Chatham, Blenheim, Bothwell, \nChatham, Chatham-Kent, Dresdon, Erie Beach, Erieau, Highgate, Ridgetown, \nThamesville, Tilbury, Wallaceburg, Wheatley) \no \nChildren's Aid Society of London and Middlesex, 888-661-6167 (London, Adelaide, Ailsa \nCraig, Caradoc, East Williams, Ekfrid, Glencoe, London, Lucan Biddulph, McGillivray, \nMetcalfe, Middlesex, Middlesex Centre ,Mosa, Newbury, North Dorchester, Parkhill, \nStrathroy, Wardsville, West Nissouri, West Williams) \no \nChildren's Aid Society of Oxford County, 519-539-6176 (Woodstock, Blandford- \nBlenheim, East Zorra-Tavistock, Ingersoll, Norwich, Oxford, South-West Oxford, \nTillsonburg, Woodstock, Zorra) \no \nFamily and Children's Services Niagara, 888-937-7731 (St. Catharines, Fort Erie, \nGrimsby, Lincoln, Niagara, Niagara Falls, Niagara-on-the-Lake, Pelham, Port Colborne, \nSt. Catharines, Thorold, Wainfleet, Welland, West Lincoln) \no \nFamily and Children's Services of St. Thomas and Elgin County, 519-631-1492 (St. \nThomas, Aylmer, Bayham, Belmont, Central Elgin, Dutton-Dunwich, Elgin, Malahide, \nPort Stanley, Southwold, St. Thomas, Vienna, West Elgin, West Lorne)\n57 \n \no \nSarnia-Lambton Children's Aid Society, 519-336-0623 (Point Edward, Alvinston, Arkona, \nBosanquet, Brooke, Dawn-Euphemia, Enniskillen, Forest, Grand Bend, Lambton, Moore, \nOil Springs, Petrolia, Plympton, Point Edward, Sarnia, Sombra, Thedford, Warwick, \nWyoming) \no \nThe Children's Aid Society of Haldimand and Norfolk, 519-587-5437 / 888-227-5437 \n(Townsend, Delhi, Dunnville, Haldimand (town), Haldimand-Norfolk (regional \nmunicipality), Nanticoke, Norfolk, Simcoe (town)) \no \nWindsor-Essex Children's Aid Society, 800-265-5609 (Windsor, Amherstburg, Essex, \nKingsville, Lakeshore, LaSalle, Leamington, Pelee Island, Tecumseh, Windsor) \n \n \nPrairies \no \nAlberta Child and Family Services, 1-800-387-5437, (several service delivery locations) \no Saskatchewan social services offices (several social services offices). After hours crisis \ncentre: Prince Albert - 306-764-1011, Saskatoon - 306-933-6200, Regina - 306-569- \n2724. \no Manitoba Child and Family Services Contacts, 1-866-345-9241 (several Designated \nIntake Agencies) \n \n \nPacific \no \nMinistry of Children and Family Development (13 offices) \no Ministry of Children and Family Development, (Vancouver) 604 660-4927 or 310-1234\n58 \n \nAnnex C – Provincial definitions of a minor \nIn Canada, the definition of a minor child varies by province as indicated in the table below. \n \nProvince \nDefinition of minor child \nDefinition of minor for child \nprotection purposes \nBritish Columbia \nPerson under 19 years \nSame \nAlberta \nPerson under 18 years \nSame \nSaskatchewan \nUnmarried person under 16 \nyears \nSame \nManitoba \nPerson under 18 years \nSame \nOntario \nPerson under 18 years \n“child” means a person under the age \nof 16 \nQuebec \nPerson under 18 years \nSame \nNova Scotia \nPerson under 19 years \n“child” means a person under the age \nof 16 \nNew Brunswick \nPerson under 19 years \n“child” means a person under the age \nof 16 \nNewfoundland \nPerson under 16 years (youth \ndefined as a person who is 16 \nyears or older, but under the age \nof 18) \nSame \nPrince Edward Island \nPerson under 18 years \nSame \nNorthwest Territories \nPerson under 19 years \n“child” means a person under the age \nof 16 \nYukon \nPerson under 19 years \n“child” means a person under the age \nof 16 \nNunavut \nPerson under 19 years \n“child” means a person under the age \nof 16\n59 \n \nAnnex D – Language Profile of Provincial Correctional Facilities \n \n \n \n \nRegion \nProvince \nFacility \nContact Information \nLanguage \n \nAtlantic \n \n \n \n \n \n \n \n \n \n \nNew \nBrunswick \nDalhousie Regional \nCorrectional Centre \n265 Miller Blvd \nDalhousie, NB E8C 2A2 \nPhone: (506) 684-7517 \nFax: (506) 684-7519 \nBilingual \nMadawaska Regional \nCorrectional Centre \n15 Rue Fournier, \nSaint Hilaire, NB E3V 4W5 \nPhone: (506) 737-4510 \nFax : (506) 737-4520 \nBilingual \nNew Brunswick Women’s \nCorrectional Centre \n4 Airport Drive \nMiramichi, NB E1N 3W4 \nPhone: (506) 624-2000 \nBilingual \nSaint John Regional \nCorrectional Centre \n930 Old Black River Rd \nSaint John, NB E2J 4T3 \nPhone: (506) 658-5400 \nFax :(506) 658-6632 \nBilingual \nSoutheast Regional \nCorrectional Facility \n435 Lino Rd. \nShediac, NB E4P 0H6 \nPhone: (506) 532-7885 \nFax: (506) 532-7832 \nBilingual \n \n \n \n \n \n \nNewfoundland \nand Labrador \nHer Majesty’s \nPenitentiary \nP.O. Box 5459 \nSt. John’s, NL A1C 5W4 \nPhone: (709) 729-1200 \nFax: (709) 729-0409 \nEnglish \nNewfoundland and \nLabrador Correctional \nCentre for Women \n1 Duffitt Place \nClarenville, NL A5A 1E9 \nPhone: (709) 466-3101 \nFax: (709) 466-3664 \nEnglish \nSt. John’s City lockup \n309 Duckworth St \nSt. John's, NL A1C 1G9 \nPhone: (709) 729-3873 \nFax: (709) 729-0376 \nEnglish \n \n \n \nNova Scotia \nCentral Nova Scotia \nCorrectional Facility \n90 Gloria McCluskey Ave, \nDartmouth, NS B3B 2B9 \nPhone: (902) 460-5800 \nFax: (902) 460-5815 \nBilingual \nNortheast Nova Scotia \nCorrectional Facility \n10202 Sherbrooke Rd \nNew Glasgow, NS B2H 5C7 \nPhone: (902) 755-8547 \nBilingual\n60 \n \n \n \n \n \nPrince Edward \nIsland \nPrince Correctional \nCenter \n108 Central Street \nSummerside, PE C1N 3L4 \nPhone: (902) 888-8208 \nFax: (902) 888-8464 \nEnglish \nProvincial Correctional \nCentre \n508 Sleepy Hollow Rd, \nMilton Station, PE C1E 0Z3 \nPhone: (902) 368-4590 \nEnglish \n \nGreater Toronto Area \n \n \n \n \n \n \n \n \nOntario \nCentral East Correctional \nCentre \n541 Kawartha Lakes County Rd \n36, Lindsay, Ontario K9V 4S6 \nPhone: (705) 328-6000 \nFax: 705-328-6011 \nEnglish \nCentral North \nCorrectional Centre \n1501 Fuller Ave, \nPenetanguishene, Ontario L9M \n2H4 \nPhone: (705) 549-9470 \nFax: 705-549-0634 \nEnglish \nHamilton-Wentworth \nDetention Centre \n165 Barton St. E. \nHamilton, ON L8L 2W6 \nTel: 905-523-8800 \nFax: 905-529-0977 \nBilingual \nMaplehurst Correctional \nComplex \n661 Martin St., Milton, Ontario \nL9T 2Y3 \nPhone: (905) 878-8141 \nFax: 905-878-5363 \nEnglish \nToronto East Detention \nCentre \n55 Civic Rd., Scarborough, \nOntario M1L 2K9 \nPhone: (416) 750-3513 \nFax: 416-750-3345 \nEnglish \nToronto South Detention \nCentre \n160 Horner Ave, Toronto, \nOntario M8Z 0C2 \nPhone: (416) 354-4030 \nFax: 416-212-6412 \nEnglish \nVanier Centre for \nWomen \n655 Martin St., Milton, Ontario \nL9T 5E6 \nPhone: (905) 876-8300 \nFax: 905-876-7334 \nBilingual \n \nNorthern Ontario \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nOntario \nAlgoma Treatment and \nRemand Centre \n800 Great Northern Rd, \nSault Ste. Marie, ON P6B 0B5 \nPhone: (705) 946-0995 \nFax: 705-946-0314 \nBilingual \nBrockville Jail \n10 Wall Street \nBrockville, Ontario K6V 4R9 \nContact: Wanda Clement \nPhone: (613) 354-9701 ext. 212 \nFax : (613) 354-6128 \nEnglish \nMonteith Correctional \nComplex \nJunction Hwys 11 & 577, Box 90 \nMonteith, ON POK 1P0 \nTel: 705-232-4092 \nFax: 705-232-4530 \nBilingual \nNorth Bay Jail \n2550 Trout Lake Rd. \nNorth Bay, ON P1B 7S7 \nTel: 705-472-8115 \nFax: 705-472-3803 \nBilingual\n61 \n \n \n \nOttawa Carleton \nDetention Centre \n2244 Innes Rd. \nOttawa, Ontario K1B 4C4 \n \nContact: Elsa Sante \nPhone: (613) 341-2870 ext. 1231 \nEmail : elsa.sante@theroyal.ca \nFax : (613) 341-2881 \nRecords : (613) 341-2870 ext. \n1100 \n \nPLO: Tom Cooney \nEmail: tom.cooney@ontario.ca \nFax: (613) 824-2252 \nRecords: (613) 824-6080 \nFax: (613) 824-1297 \nSecurity: Scott Munro Inland \nBoardroom – \n(613)990-8885 (for cases by \nphone) \nHearings Fax: ( 613) 949-8315 \nBilingual \nQuinte Detention Centre \n89 Richmond Blvd. \nNapanee, Ontario \nK7R 3S1 \nContact: Connie Cardinal \nPhone: (613) 351-8116 \nFax: (613) 351-8463 \nEnglish \n \n \nSudbury Jail \n181 Elm St.W. \nSudbury, ON P3C 1T8 \nTel: 705-564-4150 \nFax: 705-564-4157 \nBilingual \n \nQuebec \n \n \n \n \n \n \n \n \nQuebec \nÉtablissement de \ndétention Rivière-de- \nPrairies \n11900, rue Armand-Chaput \nMontréal (Québec) H1C 1S7 \nTél. : 514 494-3930 \nTéléc. : 514 494-1423 \nFrançais \nÉtablissement de \ndétention \nMontréal/Bordeaux \n800, boulevard Gouin Ouest \nMontréal (Québec) H3L 1K7 \nTél. : 514 336-7700 \nTéléc. : 514 873-4605 \nFrançais \nÉtablissement de \ndétention Laval/Leclerc \n400, montée Saint-François \nLaval (Québec) H7C 1S7 \nTél. : 450 664-1234 \nTéléc. : 450 664-4779 \nFrançais \nÉtablissement de \ndétention de Saint- \nJérôme \n2, boulevard de la Salette \nCase postale 513 \nSaint-Jérôme (Québec) J7Y 5G5 \nTél. : 450 436-8144 \nTéléc. : 450 436-8444 \nFrançais\n62 \n \n \nSouthern Ontario \n \n \n \n \n \n \n \n \n \nOntario \nSouth West Detention \nCentre \n4819 8th Concession Road \nMaidstone, ON N0R 1K0 \nPhone: (519) 967-3100 \nFax: (519) 967-3154 \nBilingual \nNiagara Detention \nCentre \n1355 Upper's Ln \nThorold, ON L2V 4A6 \nPhone: (905) 227-6321 \nFax: (905) 227-0032 \nEnglish \nElgin Middlesex \nDetention Centre \n711 Exeter Rd \nLondon, ON N6E 1L3 \nPhone: (519) 686-1922 \nFax: (519) 686-0352 \nBilingual \nSarnia Jail \n700 Christina St N \nSarnia, ON N7V 3C2 \nPhone: (519) 337-3261 \nFax: (519) 336-6505 \nEnglish \n \nPacific \n \n \n \n \n \n \n \n \n \nBritish \nColombia \n(most \ncommonly \nused) \nFraser Regional \nCorrectional Centre \nPO BOX 1500 \nMaple Ridge, BC V4R 1C9 \nPhone: (604) 462-9313 \nFax: (604) 462-5186 \nEnglish \nAlouette Correctional \nCentre for Women \n24800 Alouette Rd \nMaple Ridge, BC V2X 7G4 \nPhone: (604) 476-2660 \nFax: (604) 476-2981 \nEnglish \nVancouver Island \nRegional Correctional \nCentre \n4216 Wilkinson Rd \nVictoria, BC V8Z 5B2 \nPhone: (250) 953-4400 \nEnglish \nOkanagan Correctional \nCentre \n200 Enterprise Way \nOliver, BC V0H 1T2 \nPhone: (236) 216-2000 \nEnglish \nKamloops Regional \nCorrectional Centre \n2250 Trans-Canada Hwy \nKamloops, BC V2E 2T1 \nPhone: (250) 571-2200 \nEnglish \n \n \n \n \nBritish \nColombia \nFord Mountain \nCorrectional Centre \n57657 Chilliwack Lake Rd \nChilliwack, BC V4Z 1A7 \nPhone: (604) 824-5350 \nEnglish \nNanaimo Correctional \nCentre \n3945 Biggs Rd \nNanaimo, BC V9R 5N3\n63 \n \n \n(Infrequently \nUsed) \n \nPhone: (250) 756-3300 \n \nPrince George Regional \nCorrectional Centre \n795 BC-16, \nPrince George, BC V2L 5P1 \nPhone: (250) 960-3001 \n \n \nPrairie \n \n \n \n \n \n \n \n \n \n \n \nAlberta \nCalgary Remand Center \n12200 85 St NW \nCalgary, AB T3R 1J3 \nPhone: (403) 695-2100 \nEnglish \nEdmonton Remand \nCenter \n18415 127 St NW \nEdmonton, AB T6V 1B1 \nPhone: (780) 638-5100 \nEnglish \nLethbridge Correctional \nCentre (aka: Lethbridge \nRemand) \n21123 AB-512 \nLethbridge, AB T1J 3Z3 \nPhone: (403) 388-3000 \nFax: (403) 388-2966 \nEnglish \nMedicine Hat Remand \nCenter \n874 2 St SE \nMedicine Hat, AB T1A 8H2 \nPhone: (403) 529-2111 \nFax: (403) 529-3132 \nEnglish \nRed Deer Remand \nCenter \n4720 49 Street \nRed Deer, Alberta T4N 1T7 \nPhone: (403) 340-3200 \nFax: (403) 340-7170 \nEnglish \n \n \n \n \n \n \n \n \n \n \nManitoba \nBrandon Correctional \nCentre \n375 Veteran's Way \nBrandon, MB R7C 0B1 \nPhone: (204) 725-3532 \nFax: (204) 727-3961 \nEnglish \nHeadingley Correctional \nInstitution \n6030 Portage Ave \nHeadingley, MB R4H 1E8 \nPhone: (204) 837-1351 \nFax: (204) 889-3033 \nEnglish \nMilner Ridge Correctional \nCentre \nPO Box 460 \nCorrection Facility Rd \nBeausejour, MB R0E 0C0 \nPhone: (204) 268-4011 \nFax: (204) 268-4833 \nEnglish \nThe Pas Correctional \nCentre \n300 3 St E \nThe Pas, MB R9A 1K7 \nPhone: (204) 627-8450 \nFax: (204) 623-7774 \nEnglish \nWinnipeg Remand \nCentre \n141 Kennedy St \nWinnipeg, MB R3C 4N5 \nPhone: (204) 945-3540 \nFax: (204) 948-2217 \nEnglish\n64 \n \n \n \n \n \n \nWomen’s Correctional \nCentre \n31 Routledge Ave \nHeadingley, MB R4H 0A9 \nPhone: (204) 948-8806 \nFax: (204) 948-8833 \nEnglish \n \n \n \n \n \n \n \n \n \n \n \n \nSaskatchewan \nRegina Correctional \nCentre \n4040E 9th Ave N \nRegina, SK S4P 3A6 \nPhone: (306) 924-9000 \nEnglish \nPrince Albert Provincial \nCorrectional Centre \n3021 1st Avenue West \nPrince Albert, SK S6V 5A7 \nPhone: (306) 953-3000 \nFax: (306) 953-3030 \nEnglish \nSaskatoon Provincial \nCorrectional Centre \n910 60 St E \nSaskatoon, SK S7K 2H6 \nPhone: (306) 956-8800 \nFax: (306) 931-0811 \nEnglish \nWhite Birch Female \nRemand Unit \nBox 1452 \nRegina, SK S4P 3C2 \nPhone: (306) 787-1985 \nFax: (306) 787-2118 \nEnglish \nPine Grove Correctional \nCenter \n1700 7 Ave NE \nSpruce Home, SK S0J 2N0 \nPhone: (306) 953-3100 \nFax: (306) 953-3108 \nEnglish\n65 \n \nAnnex E – Protocol Regarding the Death of an Individual \nDetained Pursuant to the Immigration and Refugee Protection \nAct \nIntroduction \n \nThis protocol has two parts. The first part provides instruction and operational guidance for Canada \nBorder Services Agency (CBSA) staff and third-party service providers working within a CBSA \nImmigration Holding Centre (IHC) or providing transportation services. In addition, it provides guidance on \nsituations where death occurs at a hospital, in a hearing room or any pre-hearing holding area, or during \ntransfer between any of these aforementioned locations where an individual is under detention pursuant \nto the Immigration and Refugee Protection Act (IRPA). The second part of this protocol provides \ninstruction and operational guidance for CBSA staff in situations where a death occurs in a federal, \nprovincial or municipal correctional facility where the deceased was detained pursuant to the IRPA. In \naddition, protocols are provided should a death occur during a transfer between an IHC and a correctional \nfacility. \n \nPlease be cognizant that this protocol does not apply in situations where death occurs at Port-of-Entry, \nduring an inland investigation or within the removals stream pursuant to IRPA. \n \nDefinitions \nImmigration detention \nis any detention pursuant to the Immigration and Refugee Protection Act (IRPA). \n \nImmigration Holding Centres \n \nare CBSA-managed detention facilities currently located in Laval, QC; Toronto, ON; and Richmond, BC. \n \nFederal, provincial or municipal correctional facilities \n \nare any government run correctional or detention facility where immigration detainees may be held. \n \nThird-Party Service Provider \n \nis a vendor that has been awarded a Government of Canada contract to provide the specific services of \nsecurity guards to assist CBSA in the daily management of the detention program. \n \nProtocol for Incidents at the IHC \n \nCanada Border Services Agency Responsibilities \n \nCBSA officers: \n \n1. CBSA officer who is first person on the scene: \n \n \nAssume the responsibilities of the first person on the scene, as it relates to the application of first \naid. \n \nContact emergency services (e.g. emergency medical technician [EMT], police, IHC medical sta f, \netc.)\n66 \n \n \nClear the area of other detainees and all non-essential personnel as soon as possible, while \nbeing mindful of the need to preserve evidence for any subsequent investigation. In some cases, \nthis may include controlling or segregating individuals depending on the nature of death. \n \nTake note of all persons present at the time of the incident. \n \nReport the incident immediately to the appropriate CBSA official (e.g. manager or supervisor). \n \nComplete a security incident report (BSF 152 (PDF, 634 KB) at the conclusion and provide a \ncopy to CBSA IHC manager or supervisor. Follow established procedures: Reporting of Security \nIncidents \n \n2. In an assisting role: \n \n \nFollow all instructions provided by the individual providing first aid and assist wherever possible. \n \nAssume scene management responsibilities from 3rd party service provider staff, if applicable. \n \nAssist in clearing the area of other detainees and all non-essential personnel as soon as possible, \nwhile being mindful of the need to preserve evidence for any subsequent investigation. In some \ncases, this may include controlling or segregating individuals depending on the nature of death. \n \nTake note of all persons present at the time of the incident. \n \nProvide any other required supporting role to the individual first on the scene. \n \nComplete a security incident report (BSF 152 (PDF, 634 KB) at the conclusion and provide a \ncopy to CBSA IHC manager or supervisor. Follow established procedures. Reporting of Security \nIncidents (PDF, 500 KB) \n \n3. The CBSA manager or supervisor will: \n \n \nEnsure that the appropriate emergency services were contacted (e.g. EMT, police, IHC medical \nstaff, etc.) and if not, contact them immediately. \n \nEnsure that the scene is secure to preserve evidence (this can be delegated to another CBSA \nofficer in situations where the CBSA manager or supervisor at the IHC is unable to be physically \npresent in a timely manner following the incident). \n \nBrief regional senior management immediately following confirmation of death. \n \nNotify the Border Operations Centre (BOC) of a \"significant event\"– (613-960-6001) \no \nFollow established procedures: Reporting of Security Incidents (PDF, 500 KB) \n \nIdentify next of kin and notify the Regional Director General (RDG). This should be done as soon \nas possible following the confirmation of death. \no In cases where there is an investigative body (e.g. local police or RCMP) involved. The \nnotification of next of kin will be undertaken by them. The CBSA manager or supervisor \nmust have confirmation from the investigative body that the notification of next of kin has \ntaken place. \n \nNotify the RDG once confirmation is received from the investigative body. \n \n4. The RDG will: \n \n \nIn cases where an investigative body is not undertaking the notification of next of kin (e.g. death \nas a result of natural causes); notify next of kin, this should be done in person, whenever \npossible. \no For overseas notification the template notification to next of kin – overseas (appendix A) \nshould be used. \n \nIn cases where next of kin notification was not possible. The RDG must ensure that the Embassy \nand / or Consulate of the deceased country of citizenship is notified. \no Always keep in mind the importance of not disclosing personal information beyond \ntombstone data or any particulars of the investigation or case to the authorities of the \ncountry of citizenship.\n67 \n \n5. The BOC will: \n \n \nNotify required NHQ senior management of the \"significant event\". \n \nNotify the Communications Directorate of the \"significant event\". \n \nThird-Party Service Provider Responsibilities \n \n1. The third-party service provider staff, first on the scene, will be required to: \n \n \nAssume the responsibilities of the first person on the scene, as it relates to the application of first \naid. \n \nContact emergency services (e.g. EMT, police, IHC medical staff, etc.). \n \nClear the area of other detainees and all non-essential personnel as soon as possible, while \nbeing mindful of the need to preserve evidence for any subsequent investigation. In some cases, \nthis may include controlling or segregating individuals depending on the nature of death. \n \nTake note of all persons present at the time of the incident. \n \nReport the incident immediately to the appropriate CBSA official (e.g. manager or supervisor). \n \nWhen CBSA officers arrive on scene, defer scene management responsibilities and assist as \nrequired. This does not include the application of first aid. \n \nComplete a security incident report (BSF 152 (PDF, 634 KB) at the conclusion and provide a \ncopy to CBSA IHC manager or supervisor. Follow established procedures: Reporting of Security \nIncidents (PDF, 500 KB) \n \n2. In an assisting role: \n \n \nFollow all instructions provided by the CBSA officer; or third-party service provider staff or \nsupervisor that is responsible for the scene. \n \nAssist in clearing the area of other detainees and all non-essential personnel as soon as possible, \nwhile being mindful of the need to preserve evidence for any subsequent investigation. In some \ncases, this may include controlling or segregating individuals depending on the nature of death. \n \nTake note of all persons present at the time of the incident. \n \nProvide any other required support to the individual first on the scene. \n \nComplete a security incident report (BSF 152 (PDF, 634 KB) at the conclusion and provide a \ncopy to CBSA IHC manager or supervisor. Follow established procedures: Reporting of Security \nIncidents (PDF, 500 KB) \n \nIn cases where death occurs in a hospital, the third-party service provider must report the incident \nimmediately to the appropriate CBSA officials and comply with all instructions provided by the hospital \nstaff on site. \n \nProtocol for Incidents at a Federal, Provincial or Municipal Correctional Facility \nCanada Border Services Agency Responsibilities \nUpon receiving notification of the death of a detainee from the correctional facility: \n \n1. The CBSA manager or supervisor will: \n \n \nBrief regional senior management immediately following confirmation of death. \n \nNotify the BOC of a \"significant event\" – (613-960-6001) \no \nFollow establish procedures: Reporting of Security Incidents (PDF, 500 KB)\n68 \n \n \nIdentify next of kin and notify the Regional Director General (RDG). This should be done as soon \nas possible following the confirmation of death. \no In cases where there is an investigative body (e.g. local police or RCMP) involved. The \nnotification of next of kin will be undertaken by them. The CBSA manager or supervisor \nmust have confirmation from the investigative body that the notification of next of kin has \ntaken place. \n \nNotify the RDG once confirmation is received from the investigative body. \n \n2. The RDG will: \n \n \nIn cases where an investigative body is not undertaking the notification of next of kin (e.g. death \nas a result of natural causes); notify next of kin, this should be done in person, whenever \npossible. \no For overseas notification the template notification to next of kin – overseas (appendix A) \nshould be used. \n \nIn cases where next of kin notification was not possible. The RDG must ensure that the Embassy \nand / or Consulate of the deceased country of citizenship is notified. \no Always keep in mind the importance of not disclosing personal information beyond \ntombstone data or any particulars of the investigation or case to the authorities of the \ncountry of citizenship. \n \n3. The BOC will: \n \n \nNotify required NHQ senior management of the \"significant event\". \n \nNotify the Communications Directorate of the \"significant event\". \n \nAll CBSA employees and the third-party service provider staff are encouraged to cooperate with police, \nthe coroner's office, medical examiner or any other investigative body in relation to incidents involving the \ndeath of a detainee in CBSA custody. \n \nIn cases where wrongdoing is suspected by an employee or third-party service provider they should be \nafforded the right to instruct counsel and/or their union representative prior to providing any information. \n \nFor more information please consult Legal Assistance and Indemnification for CBSA Employees – \nGuidelines and Procedures"
}