{
  "type": "pdf",
  "source": "Documents for Express Entry_ Proof of funds - Canada.ca.pdf",
  "text": "Canada.ca\n \nImmigration and citizenship\n \nLive in Canada\nImmigrate through Express Entry\n \nImmigrate through Express Entry: Documents\nIRCC sign in\n\n\n\n\nExpress Entry\nWho can apply\nCheck your score\nGet your documents ready\nLanguage test results\nEducation credential assessment\nJob offer\nProof of funds\nProof of funds\nWe updated the amount of money you need\nWe updated the table that shows how much money you need to settle\nin Canada.\nWe update these numbers every year, based on 50% of the low\nincome cut-off totals.\nTo stay eligible, you may need to update your proof of funds in your\nExpress Entry profile. The update must be done no later than July 28,\n2025.\nPolice certificates\nCreate your profile\nRounds of invitations\nApply for permanent residence\nAfter you apply\nIf we approve your application\n\nUpdating your profile doesn’t change the date and time that we\nreceived it, so you’ll keep your rank if you’re in a tie-breaker\nsituation.\nOn this page\nWho needs proof of funds\nHow much money you need\nWhat we accept as proof\nWho needs proof of funds\nProof of funds is how you show us that you have enough money to settle in\nCanada. If we invite you to apply, you must give written proof that you have\nthis money.\nYou need proof of funds to meet the minimum requirements of the:\nFederal Skilled Worker Program\nFederal Skilled Trades Program\nWho doesn't need proof of funds\nYou don’t need to show that you have enough money to support\nyourself and your family if:\nyou’re applying under the Canadian Experience Class\nor\nyou’re authorized to work in Canada and you have a valid job offer,\neven if you apply under the Federal Skilled Worker Program or the\nFederal Skilled Trades Program\nKeep your funds up to date in your profile. The system may find that\nyou’re eligible for more than 1 program. You don’t always know ahead\nof time which program you’ll be invited under.\nThe system currently asks all applicants to provide a proof of funds\ndocument. If you don’t need to provide proof of funds, you must\nupload a letter explaining either that you have:\nbeen invited to apply under the Canadian Experience Class, or\na valid job offer and authorization to work in Canada\nHow much money you need\nThe amount of money you need to support your family is based the size of\nyour family.\nThis table shows the minimum amount you need to immigrate to Canada.\nIf you have more money, you should list the full amount in your profile or\napplication.\nNumber of\nfamily members\nFunds you need\n(CAD)\nUpdated July 7, 2025\n1\n$15,263\n2\n$19,001\n3\n$23,360\n4\n$28,362\n5\n$32,168\n6\n$36,280\n7\n$40,392\nIf more than 7 people, for each additional\nfamily member\n$4,112\nHow to calculate the size of your family\nTo calculate the size of your family, include:\nyourself\nyour spouse or common-law partner\nyour dependent children and\nyour spouse or common-law partner’s dependent children\nYou must include your spouse or common-law partner and dependent\nchildren, even if they’re:\nCanadian citizens or permanent residents\nnot coming to Canada with you\nWhat we accept as proof\nYour funds must be available to you both when:\nyou apply\nwe issue you a permanent resident visa (if we approve your application)\nYou need a bank letter\nFor proof, you must get official letters from any banks or financial\ninstitutions where you have an account.\nThese letters must be printed on the financial institution’s letterhead and\ninclude:\nthe bank or institution’s contact information (address, telephone\nnumber and email address)\nyour name\nyour outstanding debts (such as credit card debts and loans)\nthese details for each current banking and investment account you have\nwith them:\naccount numbers\ndate each account was opened\ncurrent account balances\naverage balance for the past 6 months\nYou must have legal access to the funds\nYou must prove to us that you can legally access the money here when you\narrive.\nFor example, this means:\nyou can't use equity on real property as proof of settlement funds\nyou can’t borrow this money from another person\nYou must be able to use this money to pay for your family’s costs of living\n(even if they aren’t coming with you).\nIf your spouse is coming with you, you can count money you have\ntogether in a joint account.\nPolice certificates\nYou may be able to count money in an account under your spouse’s\nname only, but you must prove you have access to the money.\nDate modified:\n2025-07-07\n"
}