{
  "type": "pdf",
  "source": "Express Entry_ If we approve your application_ In Canada - Canada.ca.pdf",
  "text": "Canada.ca\n \nImmigration and citizenship\n \nLive in Canada\nImmigrate through Express Entry\n \nExpress Entry: If we approve your application\n\n\n\n\nExpress Entry\nWho can apply\nCheck your score\nGet your documents ready\nCreate your profile\nRounds of invitations\nApply for permanent residence\nAfter you apply\nIf we approve your application\nIf we approve your application: In\nCanada\nIf we approve your permanent residence application, you'll:\nconfirm your permanent resident status\nreceive a permanent resident card in the mail\nConfirm your permanent resident status\nIn most cases, we can confirm permanent resident (PR) status:\nthrough a secure online portal\nwithout in-person interviews\nYou don’t have to do anything until we contact you using the email or\nphone number you provided.\nYou’ll get emails from a mailbox ending in cic.gc.ca:\nasking you to confirm your email address\nIn Canada\nOutside Canada\nasking you to confirm you’re physically in Canada\ngiving you information about the Permanent Residence (PR) Portal (and\noptions if you can’t use it)\nThe portal is separate from your IRCC secure account. Don’t create your\nown account in the PR Portal as this can delay the process. We’ll create an\naccount for you. Follow the instructions in the email we send you.\nHow to confirm your status in the PR Portal\nYou must tell us if you leave Canada before we grant you permanent\nresident status.\nGet a permanent resident card\nOnce you become a permanent resident, we’ll make an electronic\nconfirmation of permanent residence (e-COPR) available to you in the PR\nPortal so that you can provide proof of your new status in Canada.\nIn this portal, we’ll also ask you to provide a photo so we can start the\nprocess of issuing your first permanent resident (PR) card. You don’t need\nto apply for your first PR card. We'll mail your PR card to the Canadian\naddress you provided in your application.\nWhile you wait for your PR card, you can use your printed and signed e-\nCOPR to:\nprove you’re a permanent resident in Canada\napply for government benefits and services for which you’re eligible (for\nexample, to apply for your social insurance number so you can work)\nDate modified:\n2025-02-19"
}