{
  "type": "pdf",
  "source": "Express Entry_ Federal Skilled Trades Program - Canada.ca.pdf",
  "text": "Canada.ca\n \nImmigration and citizenship\n \nLive in Canada\nImmigrate through Express Entry\n \nExpress Entry: Who can apply\nIRCC sign in\n\n\n\n\nExpress Entry\nWho can apply\nCanadian Experience Class\nFederal Skilled Worker Program\nFederal Skilled Trades Program\nCheck your score\nGet your documents ready\nCreate your profile\nFederal Skilled Trades Program\nThe Federal Skilled Trades Program is for skilled workers who want to\nbecome permanent residents based on being qualified in a skilled trade.\nOn this page\nSkilled trade sectors\nSkilled trades work experience\nJob offer or certificate of qualification\nLanguage ability\nEducation\nProof of funds\nAdmissibility\nWhere you can live in Canada\nRounds of invitations\nApply for permanent residence\nAfter you apply\nIf we approve your application\nSkilled trade sectors\nSkilled trades need specialized knowledge and hands-on work. You’ll need\nan apprenticeship for most trades.\nSkilled tradespeople may work in sectors such as:\nconstruction\ntransportation\nmanufacturing and industrial\nnatural resources and agriculture\nSkilled trades work experience\nFirst, find out the National Occupational Classification (NOC) for your job.\nThen check if it meets the requirements for skilled work experience.\nFind your NOC\nYour skilled work experience must:\nall be in the same NOC and be in 1 of these NOC groups:\nMajor Groups 72 (excluding Sub-Major Group 726), 73, 82, 83, 92,\nor 93 (excluding Sub-Major Group 932)\nYour skilled work experience must meet all the requirements to be\neligible.\nHow to count your work hours\nYou can meet the 3,120 hour requirement in a few different ways:\nMinor Group 6320\nUnit Group 62200\nshow that you performed:\nthe actions in the lead statement of the NOC job description, and\nmost of the main duties listed\nmeet the job requirements for that skilled trade as set out in the NOC\nbe paid work\nYou must have been paid wages or earned commission (volunteer\nwork or unpaid internships don’t count).\nhave been obtained in a country where you were qualified to practice\nbe at least 2 years of full-time work experience (or 3,120 hours total)\nin a skilled trade within the 5 years before you apply\n\nfull time at 1 job: up to 30 hours/week for 24 months = 2 years full\ntime (3,120 hours)\nequal amount in part-time work: for example, 15 hours/week for\n48 months = 2 years full time (3,120 hours)\nYou can work as many part-time jobs as you need to meet this\nrequirement.\nfull time at more than 1 job: 30 hours/week for 24 months at more\nthan 1 job = 2 years full time (3,120 hours)\nIf you worked in more than one country\nYour work experience only counts if you were qualified to practise that\ntrade where you got your work experience.\nIf you were qualified in one country but worked in another country with\ndifferent rules for practising your trade, you must have also met the\nrequirements to practise there independently.\nPart-time work experience\nFor part-time work, you can work more or less than 15 hours/week as\nlong as it adds up to 1,560 hours. You can work more than 1 part-time\njob to get the hours you need to apply.\nWe don’t count any hours you work above 30 hours/week.\nStudent work experience\nWork experience gained while you were studying doesn't count\ntowards minimum requirements for the Federal Skilled Trades\nProgram.\nJob offer or certificate of qualification\nYou must have either:\na valid job offer of full-time employment for a total period of at least\n1 year, or\na certificate of qualification in your skilled trade issued by a Canadian\nprovincial, territorial or federal authority\nCertificate of qualification\nA certificate of qualification (or a qualification certificate) proves you’re\nqualified to work in a certain skilled trade in Canada. This means you:\npassed a certification exam\nmeet all the requirements to practise your trade in the province or\nterritory that issued your certificate\nThis certificate is issued by:\nthe provincial or territorial body that governs trades in their province or\nterritory, or\na federal authority\nTo get a certificate, the provincial, territorial or federal authority must assess\nyour training, trade experience and skills to decide if you’re eligible to write\na certification exam.\nGet assessed by the province or territory\nEach province and territory has its own:\ncertificate of qualification requirements, and\ncertification process\nYou may:\nhave to go to the province or territory to be assessed for your trade\nneed an employer in Canada to give you experience and training\nTo learn more about getting assessed, visit the website of the body that\ngoverns trades for the province or territory where you want to live and\nwork:\nAlberta\nBritish Columbia\nManitoba\nNew Brunswick\nNewfoundland and Labrador\nNorthwest Territories\nNova Scotia\nNunavut\nOntario\nPrince Edward Island\nSaskatchewan\nYukon\nIf the province or territory where you plan to live and work doesn’t give\ncertificates of qualification in your trade, you’ll need a valid job offer\nin your trade to be eligible for this program.\nIf your trade is federally regulated\nIf your trade is not regulated by a province or territory, it may be\nfederally regulated (for example, airplane mechanics).\nFind out who regulates your trade and how to get assessed through\nthe Canadian Information Centre for International Credentials.\nLanguage ability\nYou must:\ntake approved language tests in English or French\nmeet the minimum score in all 4 abilities:\nwriting\nreading\nlistening\nspeaking\nEducation\nThere is no education requirement for the Federal Skilled Trades Program.\nIf you want to improve your rank in the pool\nThere are 2 ways you can improve your rank in the Express Entry pool:\n1. If you went to school in Canada, you can get points for a\ncertificate, diploma or degree from a Canadian high school or post-\nsecondary institution.\n2. If you have foreign education, you can get points if you have both\nof these:\na completed educational credential\nan educational credential assessment report for immigration\npurposes\nProof of funds\nYou must show that you have enough money for you and your family to\nsettle in Canada.\nYou don't need proof of funds if you:\nare currently able to legally work in Canada, and\nhave a valid job offer from an employer in Canada\nAdmissibility\nYou must be admissible to Canada.\nSome people aren’t allowed to come to Canada. There are different reasons\nwe may not let you into Canada, such as security, criminal or medical\nreasons.\nCheck your score\nWhere you can live in Canada\nYou must plan to live outside the province of Quebec. The province of\nQuebec selects its own skilled workers. If you plan on living in Quebec, see\nQuebec-selected skilled workers for more information.\nWhen you fill out your profile, we’ll ask you where you plan to live in Canada.\nYou don’t have to settle in that province or territory.\nIf you’re a Provincial Nominee, you must settle in the province or territory\nthat nominated you.\nDate modified:\n2025-02-12\n"
}