{
  "type": "pdf",
  "source": "Express Entry_ Create your profile and enter the pool - Canada.ca.pdf",
  "text": "Canada.ca\n \nImmigration and citizenship\n \nLive in Canada\nImmigrate through Express Entry\nIRCC sign in\n\n\n\nExpress Entry\nWho can apply\nCheck your score\nGet your documents ready\nCreate your profile\nRounds of invitations\nApply for permanent residence\nAfter you apply\nCreate your profile and enter the pool\nOn this page\nHow the pools work\nCreate your profile\nHow we rank your profile\nKeep your profile up-to-date\nWhat to do while you're in the pool\nIf your work permit expires\nHow the pools work\nIf you want to come to Canada as a skilled immigrant, your first step is to\ncreate your profile and submit it to the Express Entry pool.\nIf you’re eligible, we’ll:\nplace you in a pool with others who are also eligible\ngive you a score and rank you using several factors\nIf we approve your application\ninvite you to apply to be a permanent resident of Canada (if you’re one\nof the top candidates)\nCompleting an online Express Entry profile or entering the pool doesn’t\nguarantee that we’ll invite you to apply for permanent residence. You can\nonly apply if we send you an invitation.\nCreate your profile\n1. Prepare your documents.\n2. Sign in to your IRCC secure account.\n3. Enter your personal reference code when it prompts you (if you used\nthe Come to Canada tool).\n4. Enter your personal details to create a profile.\nYou may exit the profile at any time. Your information will be saved\nin your account.\nYou won’t be asked to enter information about your dependent\nchildren. We’ll only ask you for this information if you’re invited to\napply.\n5. Submit your profile.\nYou have 60 days to complete and submit your Express Entry\nprofile. Otherwise, you’ll have to start again.\n6. Based on the information you enter, we’ll figure out which program(s)\nyou’re eligible for and may be invited to apply to.\nIf you’re eligible for more than one program\nIf you're eligible for more than one program through Express Entry,\nyou'll be invited to apply for the first program you meet in this order:\nCanadian Experience Class (CEC),\nFederal Skilled Worker Program (FSWP), then\nFederal Skilled Trades Program (FSTP).\nYou can’t choose which program you are invited to apply for. The\nsystem will sort profiles based on the information you enter.\nIf you decline the invitation, the system will not re-invite you under the\nnext program. You will go back in the pool, and if we invite you again,\nthe same order will apply.\nSign in to your IRCC secure account\nHow we rank your profile\nYou get points based on the information in your profile, including your skills\nand experience.\nTo be chosen from the pool and invited to apply, you need to have one of\nthe highest-ranking scores when we send out invitations. If you are invited,\nyou can apply for permanent residence.\nThe Comprehensive Ranking System (CRS) is the points-based system we\nuse to assess and score your profile and rank you in the Express Entry pool.\nView the full CRS criteria and how points are calculated\nKeep your profile up-to-date\nYou must update your profile if your situation changes, for example, if you:\nstart a new career\ngain or lose a job offer\nget a new language test\nget married or divorced\nhave or adopt a new child\nWe updated the amount of money you need\nWe updated the table that shows how much money you need to settle\nin Canada.\nWe update these numbers every year, based on 50% of the low\nincome cut-off totals.\nTo stay eligible, you may need to update your proof of funds in your\nExpress Entry profile. The update must be done no later than July 28,\n2025.\nUpdating your profile doesn’t change the date and time that we\nreceived it, so you’ll keep your rank if you’re in a tie-breaker\nsituation.\nIf we find that you gave us false information or left out important details, we\ncan:\nrefuse your application\nfind you inadmissible\nbar you for 5 years from applying to come to Canada\nCommon reasons why your profile may become\nineligible\n\nYour work experience no longer meets the program requirements.\nFor example, it needs to be in the 3 years before you apply,\nand it no longer is due to your time in the pool.\nYour language test results expired.\nYour educational credential assessment (ECA) results expired.\nYou no longer have enough funds.\nYou changed your primary occupation.\nWhat to do while you're in the pool\nImprove your score\nTry to improve your score by:\ngetting a valid job offer\ncontacting provinces and territories and asking them to consider you for\na Provincial Nominee Program\nimproving your language score\nimproving your education\ngaining more skilled work experience\nFind a job with Job Match\nYou can start your job search by creating a Job Match account with Job Bank.\nYou'll need the Job Seeker validation code to create a Job Match account.\nSign up with Job Bank\nGet updates about Express Entry\nSubscribe to email updates for the latest news about Express Entry.\nLike or follow us on our official social media channels.\nIf your work permit expires while you're\nin the pool\nIf your work permit expires soon, extend your work permit.\nIf your work permit has already expired:\nRestore your work permit.\nYou can leave Canada and still be in the pool.\nIf you don’t apply to restore your work permit, you must leave Canada\nright away when it expires.\nRounds of invitations\nDon’t work in Canada without status. It can make you ineligible for Express\nEntry.\nDate modified:\n2025-07-07\n"
}