{
  "type": "pdf",
  "source": "Express Entry_ After you apply - Canada.ca.pdf",
  "text": "Canada.ca\n \nImmigration and citizenship\n \nLive in Canada\nImmigrate through Express Entry\nIRCC sign in\n\n\n\nExpress Entry\nWho can apply\nCheck your score\nGet your documents ready\nCreate your profile\nRounds of invitations\nApply for permanent residence\nAfter you apply\nAfter you apply\nOn this page\nGet your biometrics taken\nProcessing your application\nCheck your application status\nIf your work permit expires after you apply\nDecision on your application\nGet your fingerprints and photo\n(biometrics) taken\nIf you’re between 14 and 79 years old, you need to give your fingerprints\nand photo (biometrics) for every permanent residence application you\nsubmit. You need to do this even if you gave your biometrics in the past and\nthey’re still valid.\nIn most cases, you must pay the biometric fee when you submit your\napplication. Otherwise, you may have delays.\nIf we approve your application\nIf your application is complete, we’ll send you a letter confirming you\nneed to give your biometrics.\nIf you haven’t already paid your biometrics fee, pay it as soon as you\nget the letter from us.\nYou have 30 days from the date on the letter to give your biometrics.\nFind out who needs to give biometrics, how to give them, and where to give\nthem.\nProcessing your application\nOnce we receive your application, we make sure you have:\nfilled out your application for permanent residence completely and\ncorrectly\npaid your processing fee\nmet all the requirements\nincluded all the documents\nWe’ll contact you through your IRCC secure account to:\nconfirm that we have reviewed your application\ntell you to give your biometrics\nsend you updates on the status of your application\nask you for more documents, if needed\nset up an interview, if needed\ntell you what you need to do and what will happen next\nIf your personal information changes\nTo avoid processing delays, use the web form to tell us about changes\nto your personal information as soon as possible.\nGo to web form\nYou must let us know if:\nyou want to withdraw your application\nyour family composition changes, such as:\nbirth or adoption of a child\nmarriage or divorce\nyou change your immigration representative\nyour contact information (mailing address, email address,\ntelephone number) changes\na province or territory withdraws your nomination\nyou don’t plan to live in the province or territory nominating you\nyour job or job offer changes\nyou get a new educational credential\nyou get updated language test results\nVerifying your information\nIf you are not truthful in your Express Entry profile or permanent residence\napplication, we may:\nrefuse your application\nfind you inadmissible\nbar you from applying to come to Canada for 5 years\nIf your application is not complete, we’ll reject it and refund your processing\nfees.\nCheck your application status\nUse the application status tracker to get the most up-to-date and detailed\ninformation about the status of your application.\nCheck your application status \nIf your work permit expires after you\napply\nIf your existing work permit is about to expire, you may be eligible for a\nbridging open work permit.\n\nThis permit can let you keep working while you wait for a final decision on\nyour permanent residence application.\nApply for a bridging open work permit\nDecision on your application\nThe decision we make on your application will be based on if you:\nare eligible for the program\nare admissible to Canada, based on the results of your:\nmedical exam\npolice certificates\nbackground checks\nWhen we make a decision on your application, we’ll let you know through\nyour IRCC secure account.\nIf we approve your application\nMake sure to pay your right of permanent residence fee if you\nhaven’t already done so. We can’t approve your application until\nyou’ve paid all fees.\nFind out what to do next.\nIf we approve your application\nIf we reject or refuse your application\nTo be considered in future rounds of invitations, you have to:\nfill out and submit a new Express Entry profile\nmeet the eligibility criteria\nbe accepted into the pool again\nDate modified:\n2025-02-12\n"
}