{
  "type": "pdf",
  "source": "Express Entry_ If we approve your application_ Outside Canada - Canada.ca.pdf",
  "text": "Canada.ca\n \nImmigration and citizenship\n \nLive in Canada\nImmigrate through Express Entry\n \nExpress Entry: If we approve your application\n\n\n\n\nExpress Entry\nWho can apply\nCheck your score\nGet your documents ready\nCreate your profile\nRounds of invitations\nApply for permanent residence\nAfter you apply\nIf we approve your application\nIf we approve your application: Outside\nCanada\nOn this page\nBefore you arrive in Canada\nWhen you arrive in Canada\nAfter you arrive in Canada\nBefore you arrive in Canada\nUse free pre-arrival services\nPrepare for life in Canada\nInside Canada\nOutside Canada\nWhen you arrive in Canada\nDocuments you'll need\nYou must have:\nyour valid passport or travel documents\nYour passport must be a regular, private citizen passport.\nYou can’t immigrate to Canada with a diplomatic, government\nservice or public affairs passport.\nyour confirmation of permanent residence (COPR) and your permanent\nresident visa (if we gave you one)\nproof you have the funds to support yourself and your family after you\narrive in Canada (unless you're exempt)\nMeet the CBSA officer\nWhen you arrive in Canada, you’ll meet an officer from the Canada Border\nServices Agency (CBSA). The officer will:\nmake sure you’re entering Canada before or on the expiry date shown\non your COPR\nmake sure you’re the same person who was approved to travel to\nCanada (we may use your biometrics to do this)\nask to see your passport and other travel documents\nask you a few questions to make sure you’re still eligible to immigrate to\nCanada\nThe questions will be similar to the ones you answered when you\napplied.\nTo help speed up your entry to Canada, keep your passport and other\ndocuments with you at all times. Don’t pack them in your luggage.\nWe won’t allow you into Canada if you:\ngive false or incomplete information\ndon’t satisfy the officer that you meet the conditions to enter Canada\nIf you’re admissible and there are no problems when you arrive, the officer\nwill:\nallow you to enter Canada as a permanent resident\nconfirm your Canadian mailing address where we’ll mail your PR card\nIf you change your address within 180 days of arriving in Canada, you must\ntell us using our web form.\nWhat you can bring into Canada\nBefore you travel to Canada, check the CBSA website to find out what you\ncan and can’t bring into the country.\nDeclare your funds\nResearch how much it costs to live in the place where you plan to settle in\nCanada.\nIf you arrive in Canada with CAN$10,000 or more, you must tell the CBSA\nofficer. If you don’t tell them, you could be fined and your funds could be\nseized.\nBring as much money as you can to make moving and finding a home in\nCanada easier. This includes:\ncash\ndocuments that show property or capital payable to you, such as:\nstocks\nbonds\ndebentures\ntreasury bills\ndocuments that guarantee payment of a set amount of money, which\nare payable to you, such as:\nbanker's drafts\ncheques\nmoney orders\ntravellers’ cheques\nAfter you arrive in Canada\nFind free newcomer services near you\nStart your life in Canada\nRead the Welcome to Canada guide\nLearn about multiculturalism in Canada\nDate modified:\n2025-02-10"
}