{
  "type": "pdf",
  "source": "Guide 5256 - Applying for a visitor visa (temporary resident visa) - paper application - Canada.ca.pdf",
  "text": "Canada.ca\n \nImmigration and citizenship\n \nIRCC applications\nFind an IRCC application package or form\n\n\n\nGuide 5256 - Applying for a visitor visa\n(temporary resident visa) - paper\napplication\n Print\nUse this guide to apply for: visitor visa, transit visa, super visa\nYou’re seeing the instructions to apply\non paper.\nGuide – Apply online.\n\nMost people must apply online. You can only apply on paper if you can’t\napply online, including for reasons of a disability, or if you’re travelling with\nan identity or travel document that was issued to a refugee, a stateless\nperson or a non-citizen.\nTable of Contents\nOverview\nBefore you apply\nStep 1. Gather documents\nStep 2. Complete the application\nStep 3. Pay the fees\nStep 4. Submit the application\nWhat happens next?\nNeed Help?\nIncome Table\nTemporary Resident Visa application photograph specifications\nThis is not a legal document. The explanations and definitions are not legal\ndefinitions. In case of a discrepancy between the language in this document\nand the relevant legislation or regulations, the legal text in the legislation\nand regulations prevails.\nFor legal information, consult the following documents:\nImmigration and Refugee Protection Act\nImmigration and Refugee Protection Regulations\nOverview\nApplication package\nThis application package has:\nan instruction guide, and\nthe forms you need to fill out.\nThe instruction guide:\nhas information you must know before you submit your application,\nand\nexplains how to fill out the forms and gather your supporting\ndocuments.\nRead the instruction guide completely and then fill out each of the\napplicable forms.\nThe forms are designed with questions that will help the processing of your\napplication.\nSymbols used in this guide\nThis guide uses these symbols to draw your attention to important\ninformation:\nNote: Tips that will help you with this application.\nWhat you must do to have your application processed.\nImportant information that you need to know to avoid delays or other\nproblems.\nWhere to get more information.\n\nBefore you apply\nWho may use this application guide?\nUse this application guide if you wish to apply for a temporary resident visa\nfrom outside Canada.\nNote: The processing time of an application may vary from one visa\noffice to another. Find out more about application processing times.\nWho are Visitors?\nVisitors are persons who are not Canadian citizens or permanent residents\nof Canada, and are legally authorized to enter Canada to:\nvisit Canada on holiday (vacation),\nvisit family,\nconduct business, etc.\nVisitors are restricted in length of stay and subject to various conditions.\n\nDo I need a Temporary Resident Visa?\nPersons who are not Canadian citizens or permanent residents of Canada\nmay require a visa to enter Canada. The requirement for a visa also applies\nto temporary residents who are transiting in Canada. Find out if you need an\nElectronic Travel Authorization (eTA) or a visitor visa.\nIf you do not require a visa to enter Canada, you may require an Electronic\nTravel Authorization (eTA). Find out if you need an eTA.\nWhat is a Temporary Resident Visa?\nA Temporary Resident Visa (TRV), also referred to as a visitor visa, is an\nofficial document issued by a Canadian visa office that is placed in your\npassport to show that you have met the requirements for admission to\nCanada as a temporary resident (either as a visitor, a student, or a worker).\nImportant information: You must obtain a Temporary Resident Visa (TRV)\nbefore your departure. You cannot obtain one upon arrival in Canada.\nWhat are the requirements you must meet for a TRV?\nYou must show the officer that you meet the requirements of the\nImmigration and Refugee Protection Act (IRPA) and the Immigration and\nRefugee Protection Regulations and that you will be in Canada for a temporary\nstay.\nYou must also:\nsatisfy an officer that you will leave Canada at the end of your stay,\nshow that you have enough money to maintain yourself and your family\nmembers in Canada and to return home,\nnot intend to work or study in Canada unless authorized to do so,\nbe law abiding and have no record of criminal activity,\nnot be a risk to the security of Canada,\nprovide any additional document requested by the officer to establish\nyour admissibility, and\nbe in good health (complete a medical examination if required).\nWhat if I was previously granted permanent resident\nstatus?\nIf you have ever been granted permanent residence or landed immigrant\nstatus in Canada, you may still be a permanent resident. We cannot issue\nyou a TRV if you are a permanent resident.\nYou may instead want to apply for a Permanent resident travel document. If\nyou meet the requirements for a travel document, you can return to Canada\nas a permanent resident.\nIf you no longer want to be a permanent resident, or if you know you do not\nmeet the requirements to keep your permanent resident status, you can\nvoluntarily give up (renounce) your permanent resident status in order to\napply for a TRV.\nVoluntary Renunciation of PR status applications must be sent in a\nseparate envelope by mail to the visa office.\nWe recommend that you apply for Voluntary Renunciation of your PR\nstatus first, and apply for your TRV once you receive the approval of\nyour Voluntary Renunciation.\nSpouse\nEntry to Canada\nImportant information: Entry to Canada is a privilege, not a right. You\nmust meet the necessary requirements and you may need a Temporary\nResident Visa.\nFamily member definitions\nYour family members include your spouse or common-law partner, your\ndependent children and any children that are their dependent children.\nRefers to either of the two persons (any gender) in\na marriage legally recognized in the country in\nwhich it took place, as well as in Canada.\nProxy, telephone, fax, internet and similar forms of\nmarriage where one or both parties were not\nphysically present are not considered as valid\nspousal relationships under the Regulations nor are\npolygamous marriages. For more information,\nconsult our policy on the legality of a marriage.\nCommon-law\npartner\nDependent children\nRefers to a person who is living in a conjugal\nrelationship with another person (any gender), and\nhas done so continuously for a period of at least\none year. A conjugal relationship exists when there\nis a significant degree of commitment between two\npeople.\nThis can be shown with evidence that the couple\nshare the same home, support each other\nfinancially and emotionally, have children together,\nor present themselves in public as a couple.\nCommon-law partners who have been in a conjugal\nrelationship for at least one year, but are unable to\nlive together or appear in public together because\nof legal restrictions in their home country or who\nhave been separated for reasons beyond their\ncontrol (for example, civil war or armed conflict)\nmay still qualify and should be included on the\napplication.\nThe age of your children is ‘locked in’ when you\nmake your refugee claim. This means that if you are\nlater able to apply for permanent residence in\nCanada as a protected person, you may be able to\nDependent child of a\ndependent child\ninclude them in your application if they meet the\ndependent children requirements below on the\nlock-in date:\nThey’re under 22 years old, and\nThey don’t have a spouse or common-law\npartner\nChildren 22 years old or older qualify as dependants\nif they meet both of these requirements:\nThey have depended on their parents for\nfinancial support since before the age of 22,\nand\nThey are unable to financially support\nthemselves because of a mental or physical\ncondition\nWith the exception of age, dependants will have to\ncontinue to meet these requirements until\nprocessing of the application for permanent\nresidence is complete.\nRefers to children of dependent children of the\napplicant and those of the spouse or common-law\npartner, if applicable.\nDo I have to apply separately for my family members?\nFamily members must complete their own application forms. However, you\nmay submit your applications together online or at a Visa Application Centre\n(VAC) and use one payment receipt for the total amount.\nYour spouse or common-law partner and children must meet all of the\nrequirements for temporary residence in Canada.\nAre there medical requirements?\nIf you plan to work, visit or study in Canada for six months\nor less:\nYou usually do not need a medical exam.\nIf you plan to work, visit or study in Canada for more than\nsix months:\nYou will need a medical exam if you:\nhave lived temporarily for six or more months in a row:\nin any of these countries or territories\nin the one year immediately before the date you want to enter\nCanada. (This applies even if you are a citizen of a country that\ndoes not need a visa to enter Canada.)\nRegardless of the length of time you are in Canada, you will need a\nmedical exam if you wish to work in one of the following fields:\na designated occupation, such as the field of health services or with\nchildren. Examples of designated occupations include hospital\nstaff, clinical laboratory workers, patient attendants in nursing and\ngeriatric homes, and medical and dental students admitted to\nattend Canadian universities;\nto work in agricultural occupations, you will need a medical exam if\nyou have lived in certain countries or territories.\nYou and your family members may need a medical exam to come to Canada.\nFind out more by checking the Medical examination requirements for\ntemporary residents.\nYou may either:\nhave an upfront medical exam by contacting a Panel Physician; or\nwait until your application is reviewed and medical instructions are\ngiven to you by the visa office.\nGet the instructions to complete the medical exam.\n\nWhen medical results are submitted up front, routine cases benefit from\nfaster processing since we do not have to ask for them at a later date. This is\ndone at your own cost and does not influence the final decision on your\napplication. If you have an upfront medical exam, you must submit proof\nthat you completed the medical exam with your application. Failure to do so\nmay result in processing delays.\nBiometrics\nYou may need to give your biometrics for this permit. If you need to give\nbiometrics, pay the biometrics fee when you apply. The fee covers the cost\nof collecting fingerprints and a digital photo.\nFind out if you need to give your biometrics.\nHow often do you give your biometrics\nYou only need to give your biometrics once every 10 years when you apply\nfor a visa or permit. However, we can’t issue a visa or permit longer than\n10 years from the last date you gave your biometrics.\nCheck when your biometrics expire.\nWhen to give your biometrics\nIf you submit your application online or by mail.\nYou can give your biometrics after you:\npay for and submit your application and biometric fees, and\nget a biometric instruction letter (BIL) that will direct you to a list\nof official locations you may choose from.\nYou must provide your biometric data promptly after receiving the\ninstruction letter inviting you to do so.\nIf you submit your application in person at a visa application centre\n(VAC)\nYou may be able to book an appointment in advance to give your\nbiometrics at the same time that you submit your application at a VAC. If\nyou can’t give your biometrics when you submit your application you will\nhave to make an appointment at the VAC to give them at a later date.\nExtend the validity of your biometrics\nIf you want a visa or permit for longer than 10 years from the last date you\ngave your biometrics, you can choose to give your biometrics again when\nyou apply. You can give your biometrics again even if they’re still valid.\nFollow these steps when you apply for your visa or permit:\n1. Pay the biometrics fee when you apply.\n2. Wait for your biometric instruction letter (BIL). You must use the BIL\nthat was issued for this application.\n3. Book an appointment and visit an official biometric collection location to\ngive your biometrics again.\nWhere to give your biometrics\nYou need to book an appointment to give your biometrics at one of these\nofficial biometric collection service points.\nWe’ll start processing your application after we get your biometrics.\nCan I work or study during my stay in Canada?\nVisitors are not allowed to work or study in Canada unless they are\nauthorized to do so under the Immigration and Refugee Protection\nRegulations. In many cases, a work or study permit will be required.\nA temporary resident may also take a program of study up to six months\nduration without having to obtain a study permit.\nInformation about the parent and grandparent super\nvisa\nAbout the super visa\nThe multiple-entry super visa allows parents and grandparents to\nenter Canada multiple times\nstay in Canada for a period of 5 years on each entry\nImportant information: Applicants who do not normally require a visa to\nenter Canada must also submit an application to a visa office. See the\nsection below for visa-exempt applicants.\nWho may apply for a super visa?\nTo apply for a super visa, you must either be the parent or grandparent of a\nCanadian citizen or a permanent resident of Canada.\nYou cannot include your dependent children in this application. If your\nspouse or common-law partner want to come with you, they also need to\nsubmit an application.\nHow do I apply for a super visa?\nTo apply for a super visa, you need to submit an application to a visa office\nand provide\na letter of invitation written and signed by your child or grandchild\npromising financial support for the entire duration of your stay in\nCanada\nYou must also include your host child or host grandchild’s family\ncomposition (dependents, including spouse, children or other\nrelatives that are financially dependent on your host child or host\ngrandchild).\none of the following documents to prove that your child or grandchild\nmeets the low income cut-off (LICO) minimum (The Canadian or\npermanent resident spouse or common-law partner of your child or\ngrandchild may co-sign the invitation letter to meet the LICO minimum):\nthe most recent copy of their federal income tax notice of\nassessment\nIf your child or grandchild does not have a paper copy of their\nnotice of assessment, they can view (and print) their tax returns\nas well as other personal tax information using the Canada\nRevenue Agency’s My Account online service. To register or\nlogin, visit My Account.\nthe most recent copy of the child or grandchild’s T4 or T1\nan original letter from child’s or grandchild’s employer stating their\njob title, job description and salary\nthe child or grandchild’s employment insurance benefit statements,\nincluding\na letter from an accountant confirming annual income, if self-\nemployed\nproof of other sources of income (for example, pension\nstatement, investments)\nevidence of the parent or grandparent relationship to the Canadian\ncitizen or permanent resident you wish to visit (such as a birth\ncertificate, baptismal certificate or other official documents naming you\nas parent or grandparent)\nproof that you have private medical insurance valid for a minimum of 1\nyear from a Canadian insurance company, or an insurance company\noutside Canada that has been approved by the minister\nMore information on approved insurance companies outside of\nCanada will be available in the coming months.\nThis medical insurance must\nbe paid in full (quotes aren’t accepted)\ncovers health care, hospitalization and repatriation\nprovide a minimum coverage of $100,000, and\nbe valid for each entry to Canada and be available for review by\na border services officer, upon request\nAfter you apply, you will also need to undergo a medical examination and\nprovide proof of the results.\nYou will be required to appear in person to have your biometric fingerprints\nand photo (biometric information) taken at a biometric collection service\npoint.\nVisa-exempt applicants\nYou are not required to pay the application processing fee or provide your\nbiometrics.\nIf your application is approved, you will be directed to apply for an electronic\ntravel authorization (eTA). You will be provided with a letter that you will\nshow to a border services officer upon arrival to Canada.\nWhat must my child or grandchild do to meet the low\nincome cut-off minimum?\nYou child or grandchild’s income must meet or exceed the minimum\nnecessary cut-off, as identified annually in the income table.\nIn the letter of invitation, they must calculate their family size. This factor\ndetermines the amount of income required to provide care and support for\nyou and your spouse, if applicable.\nHow to calculate family size:\n1. Your child or grandchild counts\nthemselves\ntheir spouse or common-law partner\ntheir dependent children\nany person they may have sponsored previously and for whom the\nsponsorship agreement and undertaking are still in effect\n2. They count the number of persons they will be supporting\nyou, and\nyour spouse or common-law partner, if you have one\n3. They add together the number of persons covered by steps 1 and 2. The\ntotal represents their family size.\n4. They look at the LICO in the income table in this guide to determine if\nthey meet the minimum required for their family size.\n5. To demonstrate that they meet the minimum income required, your\nchild or grandchild may include one of the documents listed in the\ndocument checklist (IMM 5484).\nIf your child or grandchild does not meet the LICO minimum, their spouse or\ncommon-law partner can assist by also providing a letter of invitation with\none of the documents listed in the document checklist (IMM 5484).\nStep 1. Gather documents\nWhat documents are required?\nUse the Document Checklist [IMM 5484] \n to assist you in gathering the\nrequired documents to submit your application.\nSome visa offices may require additional supporting documents specific to\nyour country. For further information, check the Application for a Visitor Visa\npage.\nYou must select the country or territory from which you will apply to get\nyour local visa office instructions.\nImportant information: If you do not provide all the requested\ninformation or documents, the processing of your application could be\ndelayed.\nMinors travelling alone\nMinors (under 18 years of age) travelling alone or with a person other than\ntheir parents or legal guardians should have a letter of authorization,\npreferably in English or French, signed by both parents or legal guardians. It\n\nshould also include the name of the adult who will be responsible for the\nchildren in Canada.\nMinors travelling with only one parent or legal guardian should have a letter\nof authorization, preferably in English or French, from the non\naccompanying parent or guardian.\nTranslation of documents\nYou must include the following along with any document that is not in\nEnglish or French:\nthe English or French translation; and\nan affidavit from the person who completed the translation (if they are\nnot a certified translator).\nTranslations may be done by:\na person who is fluent in both languages (English or French, and the\nunofficial language); or\na Canadian certified translator (a member in good standing of a\nprovincial or territorial organization of translators and interpreters in\nCanada).\nIf the translation isn’t done by a Canadian certified translator, the person\nwho completed the translation must provide an affidavit swearing to their\nlanguage proficiency and the accuracy of the translation.\nThe affidavit must be sworn in the presence of:\nIn Canada:\na notary public;\na commissioner of oaths; or\na commissioner of taking affidavits.\nAuthority to certify varies by province and territory. Consult your local\nprovincial or territorial authorities.\nOutside of Canada:\na notary public\nAuthority to administer oaths varies by country. Consult your local\nauthorities.\nImportant information: Translations must not be done by the\napplicants themselves nor by members of the applicant’s family. This\nincludes a parent, guardian, sibling, spouse, common-law partner, conjugal\npartner, grandparent, child, aunt, uncle, niece, nephew and first cousin.\nNote: An affidavit is a document on which the translator has sworn, in\nthe presence of a person authorized to administer oaths in the country\nwhere the translator is living, that the contents of their translation are a\ntrue translation and representation of the contents of the original\ndocument. Translators who are certified in Canada don’t need to\nsupply an affidavit.\nCertified true copies\nTo have a photocopy of a document certified, an authorized person must\ncompare the original document to the photocopy and must print all of the\nfollowing on the photocopy:\n“I certify that this is a true copy of the original document”;\nthe name of the original document;\nthe date of the certification;\nthe name of the authorized person;\ntheir official position or title; and\ntheir signature.\nWho can certify copies?\n\nOnly authorized people can certify copies.\nImportant information: Certifying of copies must not be done by the\napplicants themselves nor by an applicant’s parent, guardian, sibling,\nspouse, common-law partner, conjugal partner, grandparent, child, aunt,\nuncle, niece, nephew or first cousin.\nPeople authorized to certify copies include the following:\nIn Canada:\na notary public;\na commissioner of oaths; or\na commissioner of taking affidavits.\nAuthority to certify varies by province and territory. Check with your\nlocal provincial or territorial authorities to learn who has the authority to\ncertify.\nOutside Canada:\na notary public\nAuthority to certify international documents varies by country. Check\nwith your local authorities to learn who has the authority to certify in your\ncountry.\nStep 2. Obtain the required forms\nWe’ll send you the application package in one of these formats:\nprinted\nbraille\nlarge print\nHow to request an alternative format\n1. Open a new email\n2. In the subject line of your email, include\nthe format you need (printed, braille, or large print), and\nthe application package you want\n3. In the body of your email, include\nyour full name as shown on your passport\na statement explaining that you’re asking for an alternate format\nif you want the application in English or French\nhow we should send it to you (by email or regular mail)\nInclude your email address if you want us to send it\nelectronically so you can print it yourself. This option will save\nyou the time it would take to mail it to you.\nInclude your mailing address if you want it mailed to you.\nEmail us at IRCC.ALTRequest-DemandeALT.IRCC@cic.gc.ca\nYou can only email us to request alternative format of\napplications.\nWe won’t reply to emails about any other topics.\nAfter we get your request, we’ll send you the requested information and tell\nyou where to send your application.\nHow to submit your application\nfill out and sign any paper forms we sent you\nsubmit the application by mail or courier to the mailing address\nprovided in our instructions\nFor more information on how to apply for an alternative format, call 1-888-\n242-2100 (from inside Canada only).\nNote: You may be required to complete additional supporting\ndocuments upon request of a visa officer.\nImportant information: It is a serious offence to give false or misleading\ninformation on these forms. The information you provide on your\napplication is subject to verification.\n\nImportant information\nBe complete and accurate\nComplete all sections. If a section does not apply to you, write “Not\nApplicable” or “NA”, except for your name (last name and given name[s]).\nRefer to questions 1 and 2 under “Personal Details” section for further\ninstructions. The application must be signed and dated.\nIf your application is incomplete it may be rejected and this will delay the\nprocessing of your application.\nIf you need more space for any section, print out an additional page\ncontaining the appropriate section, complete it and submit it along\nwith your application.\nApplication for Temporary Resident Visa (IMM 5257)\nWho must fill out this application form?\nThis form must be completed by each person applying for a Temporary\nResident Visa to visit Canada.\nNote\nFill out the form\nYou must answer all the questions on this form unless instructed otherwise.\nDownload and fill out the form on a computer.\nYou also have the option to save your form and fill it out later.\nNote: Filling out the form on a computer is easier and reduces\nmistakes that can slow down the application process.\nRead and follow the questions below to help you fill out the form.\nQuestion 1\nType your universal client identification number (UCI), if known. Otherwise,\nleave it blank. If this is your first time dealing with us you will not have a UCI.\nQuestion 2\nFrom the list, select the language (English or French) in which you would like\nto receive your service.\nQuestion 3\nFrom the list, select the type of visa you are applying for:\nVisitor visa: official document issued by a visa office that is placed in\nthe passport which allows you to seek entry to Canada.\n\nQuestion 1\nTransit Visa: is required for persons travelling through Canada for less\nthan 48 hours on their way to another country.\nNote: To obtain a transit visa you must provide specific evidence of\nyour travel itinerary from your transportation company or travel\nagent.\nPersonal Details\nFull name\nType your family name (surname) exactly as\nshown on your passport or travel document (even if\nthe name is misspelled). Do not use initials.\nNote: If you do not have a family name on\nyour passport or travel document, enter all\nyour given names here and leave the given\nname field blank.\nType all of your given names (first, second, or\nmore) exactly as shown on your passport or travel\ndocument (even if the name is misspelled). Do not\n\n\nQuestion 2\nQuestion 3\nuse initials.\nNote: If you do not have a given name on your\npassport or travel document, leave this field\nblank. Do not enter “*”, “Not applicable” or\n“NA”.\nNick names or Alias\nCheck the box to tell us if you have ever used any\nother name. This could include your birth name,\nmaiden name, married name, nick name, etc.\nIf you checked “Yes”, type any other family name\nthat you have ever used.\nIf you checked “Yes”, type any other given name\n(first, second, or more) that you have ever used.\nChoose your gender (F-Female, M-Male, U-\nUnknown or X-Another gender).\nNote: If you choose a gender identifier that is\ndifferent than what you currently have or have\nhad on your Canadian temporary resident\n\n\nQuestion 4\nQuestion 5\nQuestion 6\ndocument (visa, electronic travel authorization,\nwork permit, study permit or visitor record),\nyou need to complete the Request for a Change\nof Sex or Gender Identifier (IRM 0002) form and\nsend it with your application. You also need to\ncomplete this form and send it with your\napplication if you’ve never had a Canadian\ntemporary resident document but you intend\nto apply for one and you identify with a gender\nthat is different than what appears on your\nforeign travel document or passport. No\nsupporting documents are required.\nEnter your date of birth. If your entire date of birth\nis unknown, please use ‘*’ (star sign or asterisk) to\nfill in the spaces for the year, month or day, where\napplicable.\nNote, if your city, town, country or territory of birth\nis indicated in your passport or your travel\ndocument, please record it as it appears in the\ndocument.\nQuestion 7\nChoose your country or territory of citizenship. To\nbe a citizen of a country or territory means that you\nwere either born in that country or territory (in\nmost cases) or have been granted citizenship by\nthat country or territory. If you are a citizen of more\nthan one country or territory, choose the country or\nterritory that issued the passport you will be using\nfor this trip.\nChoose the correct information:\nThe name of the country or territory you live in,\nif you have been lawfully admitted to that\ncountry or territory.\nYour immigration status in that country or\nterritory (choose one of the following):\nCitizen\nPermanent resident\nVisitor\nWorker\nStudent\nOther\nProtected Person\nRefugee Claimant\nOther: You must fill out this section if you chose\n“Other” as a status.\nQuestion 8\nThe dates (From – To) you have been living in\nyour country or territory of residence.\nCheck the box to tell us if during the past five years,\nyou have lived in any other country or territory\nother than your country of citizenship or your\ncurrent country or territory of residence (indicated\nabove) for more than six months?\nIf you checked “Yes”, choose the correct\ninformation:\nThe name of the country or territory you lived\nin;\nYour immigration status for the time you were\nin that country or territory:\nCitizen\nPermanent resident\nVisitor\nWorker\nStudent\nOther\nProtected Person\nRefugee Claimant\nOther: You must fill out this section if you chose\n“Other” as a status;\nQuestion 9\nThe dates (From – To) you were living in that\ncountry or territory.\nCheck the box to tell us if you are applying from the\ncountry or territory you live in.\nIf you checked “No”, choose the correct\ninformation:\nThe name of the country or territory where you\nare applying from;\nYour immigration status in that country or\nterritory by choosing one of the following:\nCitizen\nPermanent resident\nVisitor\nWorker\nStudent\nOther\nProtected Person\nRefugee Claimant\nOther: You must fill out this section if you chose\n“Other” as a status;\nThe dates (From – To) that you have been living\nin that country or territory.\nQuestion 10\nAnnulled Marriage\nCommon - Law\nDivorced\nIf you are not a citizen of the country or territory\nwhere you are applying, you must send proof of\nyour legal status in the country or territory you live\nin when you submit your application.\na. Choose your current marital status from the list\nbelow:\nThis is a marriage that\nis legally declared\ninvalid. An annulment\ncan also be a\ndeclaration by the\nCatholic Church that\nthe marital union did\nnot have a binding\nforce.\nThis means that you\nhave lived\ncontinuously with your\npartner in a marital-\ntype relationship for a\nminimum of one year.\nThis means that you\nare officially separated\nMarried\nSeparated\nSingle\nWidowed\nand have legally ended\nyour marriage.\nThis means that you\nand your spouse have\nhad a ceremony that\nlegally binds you to\neach other. Your\nmarriage must be\nlegally recognized in\nthe country where it\nwas performed and in\nCanada.\nThis means that you\nare married, but are no\nlonger living with your\nspouse.\nThis means that you\nhave never been\nmarried and are not in\na common-law\nrelationship.\nThis means that your\nspouse has died and\nQuestion 11\nthat you have not re-\nmarried or entered\ninto a common-law\nrelationship.\nb. Enter the date (year, month and day) you were\nmarried or you entered into your current\ncommon-law relationship.\nc. Type the family names and given names of\nyour current spouse or common-law partner.\nIf you are in a common-law union, you must also\nrequest and fill out the Statutory Declaration of\nCommon-law Union [IMM 5409] form and include it\nwith your application. If you are married, you must\nsend a photocopy of your marriage licence or\ncertificate with your application.\nCheck the box to tell us if you have ever been\nmarried or in a common-law relationship. If you\nchecked “Yes”, enter the following information:\nAll family names,\nAll given names,\nDate of birth,\nType of relationship:\nCommon-law, or\nMarried,\nDates (From – To) for which you were in the\nrelationship with your former spouse or\ncommon-law partner.\nLanguages\nQuestion 1\na. Choose your native language (mother tongue).\nb. If your native language is not English or French, choose the language\nyou would most likely use.\nBoth\nEnglish\nFrench\nNeither\nc. Choose English, French or both as your language of communication:\nEnglish\nFrench\nBoth\nNeither\nd. Check “Yes” or “No” to tell us if you have taken a test from a\ndesignated testing agency to test your abilities in English or French.\nPassport\nQuestion 1\nQuestion 2\nQuestion 3\nQuestion 4\nQuestion 5\nQuestion 6\nType your valid passport or travel document\nnumber exactly as shown on the document. Make\nsure there is no space between each number or\nletter.\nFrom the list, select the name of the country or\nterritory that issued your passport or travel\ndocument.\nEnter the date your passport or travel document\nwas issued.\nEnter the date your passport or travel document\nwill expire.\nFor this trip – Check “Yes” or “No” to tell us if you\nare using a passport issued by the Ministry of\nForeign Affairs in Taiwan that shows your personal\nidentification number.\nFor this trip – Check “Yes” or “No” to tell us if you\nare using a National Israeli passport.\nNote: There must be at least one blank page other than the last page\navailable on each passport. If applying from outside Canada, refer to\nthe responsible visa office for your region. If applying from inside\n\nQuestion 1\nQuestion 2\nQuestion 3\nQuestion 4\nCanada, a physical copy of your passport is not required at this time,\nand may be requested at a late date.\nVenezuelan passport holders\nYou may need to complete extra steps when you fill out your\napplication.\nNational Identity Document\nCheck “Yes” or “No” to tell us if you have a\nnational identity document.\nEnter your national identity document number\nexactly as shown on the document.\nFrom the list, select the name of the country or\nterritory that issued your national identity\ndocument.\nEnter the date your national identity document was\nissued.\n\nQuestion 5\nQuestion 1\nQuestion 2\nQuestion 3\nQuestion 1\nEnter the date your national identity document will\nexpire.\nUS PR Card\nCheck “Yes” or “No” to tell us if you are a lawful\nPermanent Resident of the United States with a\nvalid alien registration card (green card).\nEnter your valid alien registration card (green card)\ndocument number exactly as shown on the\ndocument.\nEnter when your alien registration card (green card)\ndocument will expire.\nContact Information\nType your current mailing address (where\ninformation should be mailed). Make sure you\ninclude the following information:\nPost Office Box (P.O. Box) number, if you have\none. If you do not have a post office box\nQuestion 2\nnumber, you must type the street number,\nApartment (Apt.) or Unit,\nStreet number (No.). If you did not type in a\nP.O. Box number, you must type the street\nnumber,\nStreet name. Do not abbreviate words (Street,\nAvenue, Boulevard, Drive, etc.) except for\ndirections (NW, SE, W, etc.),\nCity or Town,\nFrom the list, choose the country or territory of\nyour current mailing address,\nProvince or State,\nPostal code or zip code,\nDistrict, if it applies to you.\nAll correspondence will go to this address unless\nyou give us your e-mail address.\nIf you wish to have a representative who can\nconduct business on your behalf, you must give us\ntheir email and mailing addresses in this section\nand fill out the Use of a Representative (IMM 5476\n[PDF, 0.26 MB]) form.\nCheck the box to tell us if the address you live at is\nthe same as your mailing address. If “No”, type the\nfollowing information:\nQuestion 3\nApartment (Apt.) or Unit, if it applies to you,\nStreet Number (No.),\nStreet Name. Do not abbreviate words (Street,\nAvenue, Boulevard, Drive etc.) except for\ndirections (NW, SE, W, etc.),\nCity or Town,\nCountry or territory,\nProvince or State,\nPostal Code or zip code,\nDistrict, if it applies to you.\nCheck the correct box to tell us if the telephone\nnumber is from Canada, the United States (US) or\nOther (any other country).\nChoose the type of telephone:\nResidence (home)\nCellular (cell or mobile)\nBusiness (work)\nType your telephone number including the country\ncode, area or regional codes, etc.\nIf you have an extension number, write it after your\nphone number under “Ext.”\nQuestion 4\nQuestion 5\nQuestion 6\nCheck the correct box to tell us if your other\ntelephone number is from Canada, the United\nStates or Other (any other country).\nChoose the type of telephone:\nResidence (home)\nCellular (cell or mobile)\nBusiness (work)\nType your telephone number including the country\ncode, area or regional codes, etc.\nIf you have an extension number, write it after your\nphone number under “Ext.”\nCheck the correct box to tell us if the facsimile (fax)\nnumber is from Canada, the United States or Other\n(any other country).\nIf you have one, type your facsimile (fax) number,\nincluding country code, area or regional codes, etc.\nIf you have one, type your e-mail address using a\nformat similar to the following: name@provider.net\nNote: Make sure you check your email\nregularly. Any emails sent to you by\nImmigration, Refugees and Citizenship Canada\n\n(IRCC) will end in:\n“@cic.gc.ca”,\n“@canada.ca”, or\n“@international.gc.ca”.\nPlease add these to your “safe senders” list in\nyour email program and check the junk mail\nfolder in case important emails get filtered. If\nwe find that your email address does not work\nor no longer exists, we will communicate with\nyou by mail. By giving us your e-mail address,\nyou are hereby authorizing us to send your\ncorrespondence, including file and personal\ninformation electronically to this address.\nDetails of Visit to Canada\nQuestion 1\na. From the list, indicate the purpose of your visit to Canada:\nBusiness\nTourism\nShort-term studies (course or program of six months or less)\nReturning student\nReturning worker\nSuper visa — Parents and grandparents\nOther (medical visit, transit, etc.)\nFamily Visit\nVisit\nNote: If you selected “other” in question 1a), provide details in 1b)\nb. Provide details.\nQuestion 2\nEnter the dates (From – To) that you plan to stay in Canada.\nQuestion 3\nType the amount of funds (money) in Canadian dollars that you have\navailable to you during your stay in Canada.\nQuestion 4\nType the following information about the person(s) or institution(s),\nincluding schools you intend to visit during your stay in Canada:\nName (includes the name of a person or a name of an institution)\nRelationship you have with this person or institution (friend, family, co-\nworker, etc.)\nTheir address in Canada (street number, street name, city or town and\npostal code).\nEducation\n\nTrade or\nApprenticeship\nNon-university cer-\ntificate or diploma\nBachelor’s degree\nMaster’s degree\nPhD\nCheck the box to tell us if you have any post-secondary education (including\nuniversity, college or apprenticeship training).\nExamples of post-secondary education:\nTraining completed in a specific trade, such as\ncarpentry or auto mechanics.\nTraining in a profession that requires formal\neducation but not at the university level (for\nexample, dental technician or engineering\ntechnician).\nAcademic degree awarded by a college or university\nto those who finished an undergraduate\ncurriculum; also called a baccalaureate. Examples\ninclude a Bachelor of Arts, Science or Education.\nAcademic degree awarded by a graduate school of\na college or university. You must have completed a\nBachelor’s degree before a Master’s degree can be\nearned.\nHighest university degree usually based on at least\nthree years of graduate studies and a thesis.\nNormally, you must have finished a Master’s degree\nQuestion 1\nbefore a PhD can be earned.\nIf you checked “Yes”, give us full details of your highest level of post-\nsecondary education:\nEnter the dates (year and month) you attended the institution\nField(s) of study (mechanics, social sciences, medicine, etc. (et cetera))\nSchool or Facility name\nCity or Town\nCountry or territory (choose from the list) and\nProvince or State.\nEmployment (Work or job)\nEnter the following information about your employment for the past\n10 years. If you are retired, give information about the 10 years before your\nretirement.\nCurrent activity or job\nGive details about your current activity or job:\ndates (year and month) you have been working\nat your current job,\nQuestion 2\nactivity or job, or a brief description of your\nposition. If you do not work, describe what you\nare currently doing (retired, not working, going\nto school, etc. (et cetera)),\nname of the company, employer or facility\nwhere you work,\nCity or Town,\nCountry or territory,\nProvince or State, if it applies to you.\nPrevious activity or job\nGive details of your previous activity or job for the\npast 10 years. If you are retired, include the details\nabout the 10 years before your retirement.\nIf you need more space, print out another page of\nthe form, fill in this section and submit it with your\napplication.\nBackground Information\nAll questions in this section must be answered or the application will be\nconsidered incomplete and will be returned.\nQuestion 1\nCheck the box to indicate if:\na. you or any of your family members have ever had tuberculosis of the\nlungs or been in close contact with a person with tuberculosis within the\npast two years.\nb. you have any physical or mental disorder that would require social\nand/or health services other than medication during your stay in\nCanada.\nc. If you checked “Yes” to any of the above questions, provide details and\nthe name of the family member, if applicable.\nNote: Refer to the Family Members definition in this guide.\nQuestion 2\nCheck the box to indicate if you have ever:\na. remained beyond the validity of your status, attended school without\nauthorization or worked without authorization in Canada.\nb. been refused a visa or permit, denied entry or ordered to leave Canada\nor any other country or territory.\nc. Applied previously to enter or remain in Canada.\nd. If you checked “Yes” to one of the above questions, provide details.\nQuestion 3\nCheck the box to indicate if you have ever:\ncommitted,\n\nbeen arrested for, or\nbeen charged with or convicted of any criminal offence in any country or\nterritory.\nQuestion 4\na. Check the box to indicate if you have ever served in any military, militia,\ncivil defence unit, served in a security organization or police force\n(including non-obligatory national service, reserve or voluntary units).\nb. If you answered “Yes” to question 4a), please provide your dates of\nservice and the countries or territories where you served.\nQuestion 5\nCheck “Yes” or “No” to indicate if you have ever been a member or\nassociated with any political party, or other group or organization which has\nengaged in or advocated violence as means to achieving a political or\nreligious objective, or which has been associated with criminal activity at any\ntime.\nQuestion 6\nCheck “Yes” or “No” to indicate if you have ever witnessed or participated in\nthe ill treatment of prisoners or civilians, looting or desecration of religious\nbuildings.\nTo complete your form:\n1. Once the application is completed, click on the “Validate” button located\nat the top or bottom of the form. This will generate a barcode page\n(page 5 of 5) – see image below. If this application form is completed on\na computer and printed, you must place the barcode page on the top of\nyour application (or if applying as a group, each individual application\npackage).\nNote: This barcode page will not appear if you fill out your\napplication by hand.\n2. If you are 18 years of age or older, you must sign and date in the boxes\nprovided at the bottom of the page.\nIf you are less than 18 years of age, your form must be signed by one\nof your parents or a legal guardian.\nNote: By signing, you certify that you fully understand the\nquestions asked, and that the information you have provided is\ncomplete, accurate, and factual. If you do not sign and date the\napplication form, it will be returned to you.\n\n\nFamily Information (IMM 5707 or IMM 5645)\nWho needs to complete this form?\nThis form must be completed by each person, 18 years of age or older,\napplying for a Temporary Resident Visa, a study or work permit outside\nCanada.\nWhich form needs to be completed?\nYou must complete the Family Information form (IMM 5707 or IMM 5645)\nlisted in the application package for your country.\nUse of a Representative (IMM 5476)\nWho may use this form?\nFill out this form only if you:\nare appointing a representative;\nneed to update contact information for your previously appointed\nrepresentative; or\nare cancelling a representative’s appointment.\nIf you have dependent children aged 18 years or older, they must fill out\ntheir own copy of this form if a representative is also conducting business on\ntheir behalf.\nWho is a representative?\nA representative is someone who:\nyou have appointed by completing the IMM 5476 form;\ngives advice, consultation, or guidance to you at any stage of the\napplication process; and\nhas your consent to conduct business on your behalf with Immigration,\nRefugees and Citizenship Canada (IRCC) and the Canada Border\nServices Agency (CBSA).\nYou are not obliged to hire a representative. We treat everyone equally,\nwhether they use the service of a representative or not.\nFor more information, see: Use of a Representative.\nNotify IRCC about any changes\nYou must use this Web form to tell us if any information changes regarding\nthe person you authorized to represent you on your application.\nStep 3. Pay the fees\nFees\nImportant information: There are two types of fees:\nan application processing fee;\na biometric fee.\nFind out if you need to give biometrics.\nUse the table below to calculate the total amount of fees to be paid (all fees\nare in Canadian dollars). The processing fees must be included with your\napplication. If you or your family members are required to provide biometric\ninformation, the biometric fee should be paid at the same time and the\nsame way as the processing fee in order to avoid delays in processing your\napplication.\nNote: You may be required to pay fees in local currency.\nYour fees\nApplication\n$CAN\n\nApplication\n$CAN\nVisitor visa (including super visa) - per person\nSingle or multiple entry temporary resident visa \n$100\nVisitor visa – per family (1 fee per family of 5 or more people)\nSingle or multiple entry temporary resident visa \n;maximum fee for\na family of 5 or more people applying at the same time and place\n$500\nTransit Visa\nNo\nfee\nBiometrics fees\n$CAN\nBiometrics (per person)\n$85\nBiometrics (per family) (2 or more people)\nMaximum fee for a family of 2 or more people applying at the same time and\nplace\n$170\nFees are subject to change at any time.\nNote: Make sure that you are eligible before you pay, and gather all\nthe documents requested before you submit the application.\nWhat's this?\nWhat’s this?\n\nThe fees will not be refunded, regardless of the final decision. For\nexample, being found ineligible for a temporary resident visa is part of the\nprocessing; the fees will not be refunded. If you apply again, you will have to\npay another processing fee and if applicable, another biometric fee.\nVisa-exempt visitors applying for a super visa:\nIf you are a citizen of a country where you do not require a visa to visit\nCanada, you do not have to pay any processing fees. However you will have\nto satisfy all other requirements to obtain a super visa.\nFind out if you need an Electronic Travel Authorization (eTA) or a visitor visa.\nHow to pay the fees for your application\nTo pay your fees for your application you’ll need:\na valid e-mail address;\naccess to a printer (you’ll need to print the receipt), and\na credit card, Debit MasterCard  or Visa  Debit card.\nVisit the link below and follow these instructions to pay:\nGo to Online Payment.\n®\n®\nNote \nFollow the online instructions.\nAt the end, click on the button to print the IRCC official receipt with\nbarcode. Print two copies.\nAttach a copy of this receipt to your completed application.\nKeep the second copy of the receipt for your records.\n Do not exit without printing the receipt! The printed receipt is your\nproof of payment!\nThe only acceptable form of payment is online payment. If you send any\nother form of payment, IRCC will return your application.\nIncorrect fee payment\nIncorrect fee payments may delay processing of your application.\nPayment issue – No fee included\nWe will return your application.\nNote: We will start processing your application after you return your\napplication with the fees.\nPayment issue – Not enough fees included\nWe will return your application and tell you of how much to pay.\nNote: We will start processing your application once you return your\napplication with the correct fees.\nPayment issue – Overpayment\nWe will:\nstart processing your application, and\nsend you a refund.\nNote: You do not have to ask for a refund, it will be done automatically.\nPayment issue –Required biometric fee not included\nWe will:\ntell you the fee amount and how to pay it.\nNote: We will continue processing of your application after you send the\nmissing fees.\nStep 4. Submit the application\nWhere do I apply?\nYou may send your application to a Visa Application Center (VAC) that serves\nyour area or apply online.\nIf I need to give my biometric fingerprints and photo,\nwhere do I go?\nOutside Canada and the U.S.: At one of Canada’s Visa Application Centers\n(VAC) locations around the world.\nIn the United States: At one of many Application Support Centers across the\nU.S.\nIn Canada: As of December 3, 2019, you can go to a designated Service\nCanada location.\nAt the port of entry: Asylum claimants, and applicants for work and study\npermits who are eligible to apply at the port of entry.\nConsult the list of biometric collection service points.\nNote: If you need to give biometric fingerprints and photo, you do not\nneed to include paper photos with your application.\n\nIf, for some reason, you can’t provide your biometric information\n(photograph and/or fingerprints) or if you need more than the 30 days,\nplease contact us and be prepared to provide a detailed explanation.\nSubmit the document checklist\nMake sure you complete the Document Checklist [IMM 5484] and include it\nwith your application forms and supporting documents.\nWhat should I submit with my application?\nMake sure you complete the Document Checklist and include it with your\napplication forms. Make sure you include all the supporting documents\nlisted on the Document Checklist.\nIf your family members are also applying for TRVs, you can include your\nwhole family's applications in the same envelope.\nIf you are a permanent resident (PR) overseas, and have decided to\nrenounce (relinquish) your permanent resident status, you must request\nand submit the application for PR renunciation [IMM 5782] in a separate\nenvelope from your Temporary Resident application.\nTemporary Resident applications may be submitted through a Visa\nApplication Centre (VAC) or online, while the PR applications must be sent by\nmail separately to the visa office.\nWhat happens next?\nThe application process\nSubmission\nCompletion check\nOnce you have submitted your application, we will check to make sure that:\nyou have properly completed and submitted all of the required\napplication forms;\nyou have paid the application processing fee; and\nyou have sent all requested supporting documentation.\nIf your application package is incomplete:\nwe will return it to you;\nwe will not create a file; and\nwe will not keep a record until you have submitted a complete\napplication.\nNote: To avoid processing delays, pay your biometric fees at the same time\nas your application processing fees, using the same method of payment.\nProcessing\nReview for decision\nYour application will undergo a detailed review by an officer. The officer will\nconsider all the information and documentation you have provided, and will\nassess it and will decide if an interview is necessary. If so, you will be\ninformed of the interview date, time and place.\nIf your application is refused, any original documents, including your\npassport if submitted with your application, will be returned to you with an\nexplanation of why your application was refused.\nNote: If we suspect that fraudulent documents were submitted, they\nwill not be returned.\nIf your application is approved, any original documents, including your\npassport if submitted with your application, will be returned to you with the\nrequested visa.\n\nVisa-exempt visitors applying for a super visa\nIf your application is approved, your passport and documents will be\nreturned to you with a letter of introduction.\nArrival in Canada\nA valid Temporary Resident Visa is not a guarantee of entry into Canada. An\nofficer at the port of entry will decide if you still meet the requirements for\nadmission when you arrive.\nIf there has been a change in circumstances between the dates of your\napplication for a visa and your arrival in Canada, or if subsequent\ninformation is given which was not originally available to the visa office, you\nmay be refused entry.\nWhen you arrive in Canada, the officer at the port of entry will determine\nwhether you may enter Canada and how long you may stay. You must leave\nCanada on or before the date set by the officer or have your status extended\nby an officer in Canada. The stamp placed in your passport by a Canadian\nofficial is generally valid for a period of six (6) months unless another\nduration is specified by the official.\nParent and Grandparent super visa\nIf you applied for a super visa on or after June 22, 2023, your visitor status is\nvalid for 5 years on each entry to Canada. See How long you can stay in\nCanada for more information.\nYou must leave Canada on or before the date set by the officer or apply to\nextend your stay before your status expires. It is your responsibility to\nmaintain valid visitor status. If you enter Canada on or after June 22, 2023,\nand you have a stamp in your passport with no handwritten date, or if you\nhave no stamp, you are allowed to stay for 5 years.\nAs a super visa holder, it is important to\nrenew or maintain your health insurance while in Canada and on re-\nentry\nmake sure your passport is valid while you’re in Canada\nNote: for applicants who provided their biometric information as part\nof their application, when you arrive at the Canadian port of entry, the\nofficer will:\ncheck your travel documents and compare you to the photo taken\nat the time of your application, and\nmay ask you to proceed to a secondary inspection line where your\nfingerprints will be compared with the fingerprints that were taken\nat the time of your visa application.\n\nWhat you can do to help processing\nThere are certain things you can do to help make sure your application is\nprocessed as fast as possible:\nsubmit all documents and information we have asked for with your\napplication\npay your application and biometric fees (if required)\nprovide your biometrics as soon as possible (if required)\ntell us if your contact information changes, including:\nmailing address;\ntelephone numbers;\nfacsimile number (fax);\ne-mail address.\nThings that delay processing\nThe following may delay processing:\nunclear photocopies of documents;\nverification of your information and documents;\na medical condition that may need more tests or consultations;\na criminal or security issue;\nconsultation is needed with other offices in Canada or abroad.\nFor more information\nCurrent processing times\nYou can check current processing times on the Application processing times\nwebpage.\nChecking application status\nSee Check application status to find information on how to view your current\nstatus.\nIf you can’t view your current status, you may Contact Us to learn about\nyour current status. To obtain details on how to remove your application\nstatus information from the Internet, visit the “Frequently Asked Questions”\n(FAQ) section.\nProtecting your information\nYour personal information, including biometric fingerprints and photograph,\nif given:\nmay be shared with other Canadian government institutions as well as\nforeign governments as permitted under the provisions of the Privacy\nFor more information:\nAct,\nwill be available to Immigration, Refugees and Citizenship Canada\n(IRCC) and the Canada Border Services Agency (CBSA) employees who\nneed to see it in order to provide the services to you, and\nwill not be disclosed to anyone else except as permitted under the\nprovisions of the Privacy Act.\nYou can find more information about the protection of\nyour data by visiting the Help Centre.\nFind out more about the protection of your biometric\ninformation.\nQuality Assurance Program\nOur quality assurance program randomly chooses applications for a special\nreview. If chosen, we will ask you to attend an interview with an IRCC official\nto:\nverify that the documentation and any other information you submitted\nis accurate,\nverify that your application has been completed properly.\nNote: We will notify you in writing if your application is chosen.\nOnline services\nFor more information about the programs offered by IRCC, visit Immigration\nand Citizenship.\nNeed help?\nIf you need help, you can find answers to your questions by visiting the Help\nCentre.\nIncome Table\nIncome Table 2024\nYour child or grandchild may use the following income scale to assess their\nability to meet the income requirements.\n\nLow Income Cut-Off (LICO)\nSize of Family Unit\nMinimum necessary gross\nincome\n1 person (your child or grandchild)\n$29,380\n2 persons\n$36,576\n3 persons\n$44,966\n4 persons\n$54,594\n5 persons\n$61,920\n6 persons\n$69,834\n7 persons\n$77,750\nMore than 7 persons, for each additional\nperson, add\n$7,916\nTemporary Resident Visa application\nphotograph specifications\nProvide two photos meeting the requirement of the Visa application\nphotograph specifications. On the back of two photos, write your name and\ndate of birth.\nNote: if you are required to provide biometric fingerprints and photo,\nyou are not required to include paper photos with your application.\n\nSave Time: Send a\nComplete\nApplication\nHow-to video\nCome to Canada\nFind out if you\nare eligible\nDate modified:\n2025-05-16"
}