{
  "type": "pdf",
  "source": "Guide IMM 5445 - Applying for a permanent resident card (PR card) - Canada.ca.pdf",
  "text": "Canada.ca\n \nImmigration and citizenship\n \nIRCC applications\nFind an IRCC application package or form\n\n\n\nGuide IMM 5445 - Applying for a\npermanent resident card (PR card)\nCanada’s entry rules\nPermanent residents (PR) of Canada must carry and show their valid\npermanent resident card (PR card) or permanent resident travel\ndocument (PRTD) when boarding a flight to Canada, or travelling to\nCanada on any other commercial carrier.\nIf you do not carry your PR card or PRTD, you may not be able to board\nyour flight, train, bus or boat to Canada.\nIt is your responsibility to make sure your PR card is still valid when you\nreturn from travel outside Canada and to apply for a new PR card\nbefore your current card expires.\n\nPrint\nYou can now apply for a permanent resident card through the permanent\nresidence online application portal.\nYou can benefit from:\nApplying anytime, 24/7\nQuick and easy upload of all your information, including payment\nNo printing required\nTable of Contents\nOverview\nBefore you apply\nStep 1: Gather documents\nStep 2: Fill out the application\nStep 3: Pay the fees\nStep 4: Submit the application\nWhat happens next?\nNeed help?\nAppendix A: Residency obligation\n\nThis is not a legal document. The explanations and definitions are not legal\ndefinitions. In case of a discrepancy between the language in this document\nand the relevant legislation or regulations, the legal text in the legislation\nand regulations prevails.\nFor legal information, consult the following documents:\nImmigration and Refugee Protection Act\nImmigration and Refugee Protection Regulations\nOverview\nApplication package\nThis application package has:\nan instruction guide, and\nthe forms you need to fill out.\nThe instruction guide:\nhas information you must know before you submit your application,\nand\nexplains how to fill out the forms and gather your supporting\ndocuments.\nRead the instruction guide completely and then fill out each of the\napplicable forms.\nThe forms are designed with questions that will help the processing of your\napplication.\nSymbols used in this guide\nThis guide uses these symbols to draw your attention to important\ninformation:\nNote: Tips that will help you with this application.\nWhat you must do to have your application processed.\nImportant information that you need to know to avoid delays or other\nproblems.\nWhere to get more information.\n\nBefore you apply\nPermanent resident card (PR card)\nThe permanent resident card (PR card) is the official proof of your status as\na permanent resident in Canada.\nYou need a PR card if:\nyou are a permanent resident (including a child);\nyou plan on travelling outside Canada; and\nyou plan on returning to Canada by any commercial transporter, such\nas a plane, train, boat or bus.\nIf you plan to travel\nIf you apply for a new PR card, your current one will stop being valid 60 days\nafter the date we issue your new card. If you leave Canada with your existing\ncard, you won’t be able to return to Canada with it if the new one has been\nissued and you don’t have it. If this happens, you’ll need to apply for a PRTD\nto return to Canada.\nKeep this in mind before making any travel arrangements after applying for\na new PR card.\nYou can check our current processing times to estimate when we will issue\nyour new PR card.\nYou must have a PR card or a PRTD to re-enter Canada by train, plane, boat\nor bus. If you’re travelling in a private vehicle such as a car, truck,\nmotorcycle or recreational vehicle that you own, borrow or rent, you can use\nyour PR card, PRTD or other documents to return to Canada.\nThe following documents are not valid for travel to Canada:\nRecord of Landing (IMM 1000)\nConfirmation of Permanent Residence (IMM 5292 or IMM 5688)\nWho may use this application\nUse this application if you are a PR in Canada and you’re applying for\nyour first PR card,\nrenewal of your PR card that has or will soon expire,\nyou legally changed your name and need to update your PR card,\na replacement of your PR card that has been lost, stolen or damaged, or\nto change the gender designation on your PR card.\nYou’ll automatically get your first PR card by mail once you have\nbecome a permanent resident. This is part of the immigration process.\nYou don’t need to apply for your first PR card. However, if you didn’t\nprovide your mailing address and photo as required within 180 days of\nimmigrating, you’ll need to apply for your first PR card. If you became a\npermanent resident before June 28, 2002 and never applied for a PR\ncard, you can use this application to apply for your first PR card.\nImportant information: If your PR card is still valid for more than nine\n(9) months (270 days), do not apply for a renewal, unless your legal name or\ngender has changed. Otherwise, your application will be returned.\nAre you eligible?\nTo be eligible for a PR card, you must:\nbe a permanent resident of Canada;\nbe physically present in Canada;\nmeet the residency requirement (see Appendix A: Residency obligation);\nnot be under an effective removal order;\nnot be a Canadian citizen; and\nnot be convicted of an offense related to the misuse of a PR card\nPermanent Residents outside of Canada\nIf you are outside Canada and do not have a valid PR card to return, you\nmust apply for a Permanent Resident Travel Document (PRTD) through the\nportal or from a Visa Application Centre (VAC).\nImportant information: When you return to Canada, you should apply\nfor a PR card right away.\nIf we made an error on your PR card, you can request a reissue within 60\ndays. In other cases, use this application to apply for a replacement PR card.\nBiometrics\nMost PR card applicants do not need to give biometrics unless they were\npreviously exempt.\nHowever, you’ll need to give your biometrics if\nyou were less than 14 years old when we received your application for\npermanent residence and you applied for permanent residence on or\nafter July 31, 2018 or December 31, 2018 depending on your country of\norigin, AND\nyou’re now older than 14 years old and are applying for a new\npermanent resident card, a replacement or a renewal\nAfter submitting your application, you’ll get a biometric instructions letter\n(BIL) which will direct you to a list of biometric collection service points you\nmay choose from. You must bring the BIL with you to the biometric\ncollection service point. You can’t give your biometrics without this letter.\nWe encourage you to give your biometrics as soon as possible after you get\nthe BIL. We’ll start processing your application after we get your biometrics.\nFind out more about biometrics.\nWhere to give your biometrics\nYou need to book an appointment to give your biometrics at one of these\nofficial biometric collection service points. As of December 3, 2019, you can\ngo to a designated Service Canada location to give your biometrics in\nCanada.\nYou may be eligible for Canadian citizenship\nYou may be eligible for Canadian citizenship if:\nyou are a permanent resident of Canada; and\nregardless of your age, you have been physically present in Canada for\nat least 1,095 days during the five years right before the date you sign\nyour application and meet all other conditions.\nYou may be able to use some of your time spent in Canada as a temporary\nresident or protected person towards your physical presence calculation.\nEach day spent physically in Canada as a temporary resident or protected\nperson before becoming a permanent resident within the last five years will\ncount as one half day, with a maximum of 365 days, towards your physical\npresence.\nYou may be eligible to apply even if you don’t meet the minimum time lived\nin Canada if you’re a:\nCrown servant (certain categories of public officials); or\nfamily member of a Crown servant\nFind out if you have lived in Canada long enough to apply to become a\ncitizen.\nWe will not issue PR cards to Canadian citizens. Confirm your status in\nCanada before you apply.\nIf we cannot process your PR card application because you are a Canadian\ncitizen, your application fee will be refunded.\nMistake in your name\nIf your Record of Landing (IMM 1000) or Confirmation of Permanent Residence\n(IMM 5292 or IMM 5688) has a mistake in your name:\nFill out and submit a Request to Amend the Immigration Record of Landing,\nConfirmation of Permanent Residence or Valid Temporary Resident\nDocuments (IMM 5218) to correct it before you apply for a PR card.\nWe will only correct administrative mistakes made by the department in\nrecording your personal information.\nIndigenous names\nIf you’ve reclaimed your Indigenous name, you can change the name on\nyour PR card by applying for a new one at no cost to you until May 31, 2026.\nYou must fill out and include the declaration below with your application:\nStatutory Declaration to Reclaim an Indigenous Name on Canadian\nCitizenship Certificates or Permanent Resident Cards [IRM 0005] \nNote: If you’re requesting that your PR card reflect your reclaimed\nindigenous name, in the payment section of the portal, upload a document\nstating “I have reclaimed my indigenous name, please refer to my\ncompleted declaration form” and we will waive your fees.\n\nLegal Change of Name\nRead the information below to see which supporting documents you\nneed:\nIf your present name is different from the name printed on your Record of\nLanding (IMM 1000) or Confirmation of Permanent Residence (IMM 5292 or\nIMM 5688), you must submit:\nsupporting legal documents as proof of your name change,\nsupporting identity documents as requested in Step 1 and,\nprovincial ID in the name requested. Identification should include the\nname, date of birth, photo and signature of the applicant (i.e. driver’s\nlicense, photo ID card, health card, etc.) Note: Provincial ID is not\nrequired if you have provided a legal name change document issued by\na province within Canada.\nSubmit any of these documents issued by a civil authority in a province or\nterritory of Canada:\na copy of a legal change of name document, court order, adoption\norder, or\none of the following documents (unless you were married in Quebec on\nor after April 2, 1981 and are now a resident of this province). The\ndocument must show your new name:\na marriage certificate;\ndivorce decree;\nregistration;\ndeclaration of union;\nrevocation of declaration or annulment of union.\nIf you are a permanent resident and changed your name outside of\nCanada, submit:\na foreign passport or other national authoritative document that shows\nyour new name; and\nan official document linking the old and new names.\nIf your name change was already approved in a past PR card application,\ninclude a photocopy of your last PR card.\nImportant information: If you have had a legal name change, you must\ninclude a copy of your Record of Landing (IMM 1000) or Confirmation of\nPermanent Residence (IMM 5292 or IMM 5688) with this application.\nImmigration representatives\nIf you want to appoint someone to do business with us on your behalf, you\nmust\nsubmit a Use of a Representative (IMM 5476) \n form,\nsign it by hand and get your immigration representative to do so also,\nand\nsubmit it with your application.\nIf you’re a representative, find out how you can create a Portal account and\nsubmit applications on behalf of your clients.\nAn immigration representative (an immigration consultant or lawyer) can\ngive you advice and help you with your application for a fee. But they can’t\nopen a portal account on your behalf\nelectronically sign the application for you\nsign into the portal using your username and password\nA representative can fill out forms and communicate with us on your behalf\nthrough their own account. They can also\nhelp you prepare the documents you need to upload\nanswer questions about the forms\nAfter you read the declaration, you must be the one who types your name\nand clicks the “submit” button. This is the legal requirement for your\napplication to be considered “signed,” according to Canada’s immigration\nlaw.\nNote: The date will be entered automatically.\nStep 1: Gather documents\nWhat documents do I need?\nThe instructions below outline the documents that you must include with\nyour application.\nUse the Document Checklist [IMM 5644] \n to confirm which documents you\nneed.\nInclude the completed document checklist with your application.\nImportant information: If any of the required documents are missing,\nor photocopies are not clear, your application will be returned to you.\nNote: We may ask for more documents at any time while we are\nprocessing your application. If you do not submit the requested\ndocuments, there will be delays in processing.\nYou must submit these documents:\nFees: Copy of the receipt showing the amount paid.\nPhoto(s): You must provide photo(s) that meet the photo specifications.\nIf not, we may return your application. Print the photo specifications\n\n\n(PDF, 1.24 MB) and take them with you to the photographer.\nIf you are applying online:\nupload 1 photo taken within 12 months of the date you apply\nand include images of the front and back of the photo.\nFor digital photos, the information required for the back of\none photograph can be provided as one separate document\nwith a confirmation from the photo studio (e.g. receipt). This\ndocument should be uploaded in the Portal section titled\n“Upload your photo (back)”.\nSee how to submit a photo\nIf you are applying by paper:\nYou will need two (2) identical photos taken within twelve (12)\nmonths of the date of this application:\nput the two (2) photos in a small envelope (no staples or\npaper clips), and\nwrite the name of the applicant on the envelope.\nProof showing that you meet the residency obligation in the past five (5)\nyears immediately before the application. Please refer to Appendix A:\nResidency Obligation.\nA copy of one of the following primary identity documents:\nyour valid passport or travel document or\nthe passport or travel document you had when you became a\npermanent resident (if applicable, include the passport page that\nwas stamped when you arrived in Canada and became a permanent\nresident) or\nthe certificate of identity or travel document issued by the Minister\nof Immigration, Refugees and Citizenship Canada or a foreign\ncountry.\nNote: The copy should show:\nthe document type and number;\nissue and expiry date;\nyour name;\nyour photo; and\nyour date of birth\nIn exceptional cases, if it is impossible for you to obtain any of the above,\nyou must provide a:\ncopy of any identity document issued outside Canada before you came\nto Canada or\nstatutory declaration signed by you attesting to your identity and a\nstatutory declaration also attesting to your identity signed by:\na person who knew you before you came to Canada (such as a\nfamily member) or\nan official of an organization representing people from your\ncountry of nationality or past residence.\nAll statutory declarations must be certified by an accredited commissioner of\noaths. Provincial laws govern who can act in this position.\nIf you are submitting a statutory declaration, you must also provide a\nclear and legible copy of a letter explaining\nthat there are exceptional circumstances in your home country,\nwhat these circumstances are, and\nhow they are stopping you from getting any identity documents.\nNote: In the Portal, upload your primary document (like your passport) by\nselecting “Passport or Other Primary ID Document” from the Document\ntype dropdown menu.\nWe may contact you for more information or ask you to provide more\ndocuments.\nYour PR card\nIf you are applying to renew your present card, include a copy of it with your\napplication. Once you get your new card destroy your old card immediately.\nIf you are applying online to replace a damaged card, please destroy your\ncard immediately and upload a photo as proof with your supporting\ndocuments. If you are applying by paper, send the damaged card with your\napplication.\nIf we ask you to come to a local IRCC office, you must bring your old card\nand the original documents of the copies you had included with your\napplication. We will ask you to destroy your old card after you get the new\none.\nIf you lost your PR card, include a copy of a police report or incident number\nwith your application, if you have one.\nAdditional documents you may need to complete and\nsubmit, if they apply:\nTo be considered on humanitarian and compassionate grounds, include\nsupporting documents that support your request to keep your\npermanent residence. See the “Humanitarian and compassionate\ngrounds” section of the instruction guide for more information.\nLegal change of name: copy of supporting legal documentation as proof\nof your name change. Consult the Legal Name Change section for\ndetailed information.\nIf you are under the age of 18\nProvide a clear and legible photocopy of the following documents:\nyour birth certificate (showing your name, date of birth, place of birth\nand the names of your parents or adoptive parents);\nif you have a legal guardian, submit legal documentation issued by a\nCanadian court which proves guardianship; or\na photocopy of your school records (report cards, transcripts,\nattendance records).\nTranslation of documents\nYou must include the following along with any document that is not in\nEnglish or French:\nthe English or French translation; and\nan affidavit from the person who completed the translation (if they are\nnot a certified translator).\nTranslations may be done by:\na person who is fluent in both languages (English or French, and the\nunofficial language); or\na Canadian certified translator (a member in good standing of a\nprovincial or territorial organization of translators and interpreters in\nCanada).\nIf the translation isn’t done by a Canadian certified translator, the person\nwho completed the translation must provide an affidavit swearing to their\nlanguage proficiency and the accuracy of the translation.\nThe affidavit must be sworn in the presence of:\nIn Canada:\na notary public;\na commissioner of oaths; or\na commissioner of taking affidavits.\nAuthority to certify varies by province and territory. Consult your local\nprovincial or territorial authorities.\nOutside of Canada:\na notary public\nAuthority to administer oaths varies by country. Consult your local\nauthorities.\nImportant information: Translations must not be done by the\napplicants themselves nor by members of the applicant’s family. This\nincludes a parent, guardian, sibling, spouse, common-law partner, conjugal\npartner, grandparent, child, aunt, uncle, niece, nephew and first cousin.\nNote: An affidavit is a document on which the translator has sworn, in\nthe presence of a person authorized to administer oaths in the country\nwhere the translator is living, that the contents of their translation are a\ntrue translation and representation of the contents of the original\ndocument. Translators who are certified in Canada don’t need to\nsupply an affidavit.\nCertified true copies\nTo have a photocopy of a document certified, an authorized person must\ncompare the original document to the photocopy and must print all of the\nfollowing on the photocopy:\n“I certify that this is a true copy of the original document”;\nthe name of the original document;\nthe date of the certification;\nthe name of the authorized person;\n\ntheir official position or title; and\ntheir signature.\nWho can certify copies?\nOnly authorized people can certify copies.\nImportant information: Certifying of copies must not be done by the\napplicants themselves nor by an applicant’s parent, guardian, sibling,\nspouse, common-law partner, conjugal partner, grandparent, child, aunt,\nuncle, niece, nephew or first cousin.\nPeople authorized to certify copies include the following:\nIn Canada:\na notary public;\na commissioner of oaths; or\na commissioner of taking affidavits.\nAuthority to certify varies by province and territory. Check with your\nlocal provincial or territorial authorities to learn who has the authority to\ncertify.\nOutside Canada:\na notary public\nAuthority to certify international documents varies by country. Check\nwith your local authorities to learn who has the authority to certify in your\ncountry.\nStep 2: Fill out the forms\nFilling out the application\nYou’ll fill out this digital form online\nApplication for a Permanent Resident Card or Permanent Resident\nTravel Document (IMM 5444)\nDigitally sign your application\nYou must type your full name exactly as shown on your passport to\ndigitally sign your application.\nIf you’re having technical issues\nIf you can’t apply online and require accommodations\nIf you require additional context on specific questions, please visit\nour step by step instructions on how to complete the form. You\nmust answer all questions. If you leave any sections blank, we will\nreturn your application and processing will be delayed.\nIf you need more space, include another sheet of paper with your\napplication and at the top of the page, print your name and the number of\nthe question you are answering clearly in black.\nIf you are applying online, you will fill out and upload these PDF forms into\nthe Portal. If you are applying by paper you will need to complete these PDF\nforms and include it with your mailed application.\nDocument Checklist [IMM 5644] \nAdditional forms (if they apply)\nUse of a Representative (IMM 5476) \n, or Authority to Release Personal\nInformation to a Designated Individual (IMM 5475) \nyou and your immigration representative must sign the IMM 5476\nby hand\nfind out more about using a representative\nRequest form for a Change of Sex or Gender Identifier (IRM 0002) \n\n\n\n\n\nConfirmation of Eligibility for a Reclaimed Name Change Gratis\nReplacement Document Under Call to Action 17 (IRM 0004) \nStatutory Declaration to Reclaim an Indigenous Name on Canadian\nCitizenship Certificates or Permanent Resident Cards (IRM 0005) \nNOTE: If you are applying for a replacement/renewal PR card and\nchoose to change your gender to ‘X - Another gender’, you need to\ncomplete the Request for a Change of Sex or Gender Identifier [IRM\n0002] (PDF, 1.8 MB) and send it with your application.\n It is a serious offence to give false or misleading information on these\nforms. The information you provide on your application may be verified.\nProvide complete and accurate answers\nFill out all sections. If a section does not apply to you, write “Not Applicable”\nor “NA”. If your application is incomplete, it will be returned to you and this\nwill delay the processing.\nIf you need more space for any section, print out an additional page\nwith the appropriate section and submit it with your application.\n\n\n\nStep 3: Pay the fees\nYour fees\nYou must pay a processing fee when you apply. Use the table below to\ncalculate the total amount of fees to be paid or visit the Pay your fees page.\nYou must include your proof of payment with your application.\nApplication (per person)\n$CAN\nPermanent Resident card\n$50\nFind out if you need to give biometrics.\nBiometrics fees\n$CAN\nBiometrics (per person)\n$85\nBiometrics (per family) (2 or more people)\nMaximum fee for a family of 2 or more people applying at the same time and\nplace\n$170\nImportant information: You must pay your fees online. We will return\nyour application if you send any other type of payment.\nThe processing fee will not be refunded:\nonce we have started processing your application, or\nif your application is refused.\nPayment Issues\nNo fee included or insufficient fees\nIf you do not pay the full fees for your application(s) we will return your\napplication(s). We will only start processing your application after you return\nit with the correct fees.\n For immigration applications, see section 10 of the IRPR and for\ncitizenship applications, see section 13 of the Citizenship Act for more\ninformation.\nOverpayment\nIf you pay more than the fees needed for your application(s) we will start\nprocessing your application, and send you a refund as soon as possible.\n Note: You don’t have to ask for a refund. It will be done automatically.\nNote: If you’re eligible for a refund, we will issue the refund to the\nperson indicated on the Payer Information section of the receipt (if a\nreceipt is attached to a paper application or uploaded as part of an\nonline application). If you paid directly within an online application (no\nreceipt attached), or if there is no name indicated on the receipt, we will\nsend the refund to the applicant.\nOnly online payments are accepted in Canada. If any other forms of\npayment are received, Immigration, Refugees and Citizenship Canada\n(IRCC) will return your application.\nHow to pay the fees for your application\nTo pay your fees for your application you’ll need:\na valid e-mail address;\naccess to a printer (you’ll need to print the receipt), and\na credit card, Debit MasterCard  or Visa  Debit card.\nVisit the link below and follow these instructions to pay:\nGo to Online Payment.\n\n®\n®\nFollow the online instructions.\nAt the end, click on the button to print the IRCC official receipt with\nbarcode. Print two copies.\nAttach a copy of this receipt to your completed application.\nKeep the second copy of the receipt for your records.\n Do not exit without printing the receipt! The printed receipt is your\nproof of payment!\nStep 4: Submit the application\nIf you apply online\nWhen applying online, submit your application and all supporting\ndocuments through the Permanent Residence Portal.\nIf you submit a paper application\n Track your application\nIf you’re submitting a paper application, we recommend you use a\npostal or courier service with tracking so you have proof your\napplication was delivered.\nFind out how to check if your application has been received\nSend your application in a stamped envelope to the address below:\nRegular mail:\n(Your name)\n(Your Address)\n(Your Postal Code)\nCase Processing Centre — PR (Permanent Resident) card\nP.O. (Post Office) Box 10020\nSYDNEY, NS (Nova Scotia)  B1P 7C1\nCANADA\nOr by courier:\n(Your name)\n(Your Address)\n(Your Postal Code)\nIRCC Digitization Centre - PRC (Permanent Resident card)\n3050 Wilson Ave\nNew Waterford, NS (Nova Scotia) B1H 5V8\nMake sure you have included the Document Checklist [IMM 5644] \nand all the necessary documents with your application.\nIs your application urgent?\nYou may qualify for urgent processing of your application.\nIf you are applying online and your request is urgent, check “Yes,\nmy request is urgent” in the Portal.\nIf you are applying on paper and requesting urgent processing, write\n\"Urgent\" on your envelope.\nProvide your date of travel and include a supporting document\nexplaining why.\nYou must show that you need your PR card to travel within the next three\nmonths for one of these reasons:\nyour own serious illness;\n\nthe serious illness or death of a family member;\nwork, related to your current job or job opportunity; or\nyou are in a crisis, emergency, or a vulnerable situation.\nYou must include all the following documents to show you need urgent\nprocessing:\na copy of proof of travel such as tickets or an itinerary showing the\ndestination and dates you will be travelling;\na copy of proof of payment for travel showing the date, full amount and\nmethod of payment;\na letter explaining the reason for the urgency; and\nproof of urgency (i.e., a doctor’s note, death certificate, letter from\nemployer, etc.)\nYou must provide the English or French translation for any documents that\nare not English or French. See the section translation of documents.\nIf you do not send all of this information, we may not process your\napplication urgently.\nNote: We cannot process applications for PR cards in less than 3 weeks. If\nyou don’t receive your new PR card before you travel abroad, you can\nsubmit an application for a permanent resident travel document (PRTD).\nNote: If you do not send all this information, we may not process your\napplication urgently. If you qualify, we cannot guarantee that you will\nget your PR card on time.\nWhat happens next\nHearing from IRCC\nAfter you submit your application, you can expect to hear from us when\nyour application is in review or has been finalized.\nIf your application is properly completed and you meet the\nrequirements for a PR card\nIf you gave us a valid email address, we will send you an\nAcknowledgement of Receipt (AoR) of your application to your\nemail address;\nyou will get your card in the mail or we will contact you by email or\nletter to let you know when and where to pick up your card.\nIf we ask you to pick up your PR card in person, you must bring\nyour old card and the original documents of the copies you\nincluded with your application.\nImportant: A PR card cannot be issued and delivered overseas to allow\nfor a permanent resident to come back to Canada. A PR outside Canada\nwithout a status document must apply for a PRTD.\nIf your application is incomplete:\nYour application will be returned to you.\nIf your application is refused:\nYou will receive a refusal letter, explaining the reasons.\nIf your application is withdrawn:\nYou will receive a letter explaining the reasons for the withdrawal.\nThere are several ways we may communicate with you:\nThrough your (or your representative’s) online account: We\nrecommend that you or your authorized paid representative (if\napplicable) create an online account and link your application to that\naccount. Once an application has been linked to an online account, we\nwill send correspondence there. This makes communication easier,\nmore secure, and quicker and will allow you or your representative to\nget more detailed application status information and to receive mail\nfrom us online. Using online services will ensure that you receive any\ncorrespondence from us almost immediately after we send it to you.\nImportant information\nThis will allow us to input your responses directly into your application\nfor timely review.\nE-mail: If you or your representative provide us with an e-mail address\nwhen you apply, this will be our primary means of contacting you,\nunless your application is linked to an online account.\nMail: If your application is not linked to an online account and no email\nis provided, we will send all correspondence to the most up-to-date\nmailing address we have on file.\nImportant: Do not attempt to link your application to your personal online\naccount if you have appointed a representative. If you have appointed a\nrepresentative and attempt to link your application to your own online\naccount, you will have to cancel your representative before you can link.\nIf you have an authorized paid representative, they can link your application\nto their own online account instead.\nUnpaid representatives cannot use online accounts. If you have an unpaid\nrepresentative, you should remind them to regularly monitor their email\nand mail to ensure correspondence is received.\nUpdating your contact information\nIf your address or telephone number changes during the application\nprocess, you must let us know. You can do this by going to Change of\nAddress or by visiting the Help Centre.\nChecking application status\nYou may contact us or go online to see the current status of your\napplication.\nCheck your application status in an IRCC secure account\nYou can create an online account and link it to your existing application.\nIn the IRCC secure account, you’ll get\n1. status updates\n2. messages about your application, instead of by mail\nIf you applied online, this is a different account than the one you used to\napply.\nLink your existing application to an online account\nor\nTo obtain details on how to remove your application status information from\nthe Internet, visit the “Frequently Asked Questions” (FAQ) section.\nProtecting your information\nYour personal information is:\navailable to Immigration, Refugees and Citizenship Canada (IRCC) and\nthe Canada Border Services Agency (CBSA) employees who need to see\nit to provide the services to you, and\nnot disclosed to other organizations except as permitted under the\nprovisions of the Privacy Act or the Citizenship Regulations.\nUse the Client application status tool\nThis lets you securely view the status of your application online.\nYou’ll need to\ngather all the documents about your application that you’ve\nreceived\nhave the identification numbers from them ready\nCheck your application status\nFor more information\nFor more information about the protection of your data, visit the\nFrequently Asked Questions/Help Centre.\nQuality Assurance Program\nOur quality assurance program randomly chooses applications for a special\nreview. If chosen, we will ask you to attend an interview with an IRCC official\nto:\nverify that the documentation and any other information you submitted\nis accurate,\nverify that your application has been completed properly.\nNote: We will notify you in writing if your application is chosen.\nCurrent processing times and urgent\ncases\nCurrent processing times are updated regularly on our website. We will only\nprocess urgent cases under specific circumstances.\n\nNeed help?\nIf you need help, you can find answers to your questions by visiting the Help\nCentre.\nAppendix A: Residency obligation\nMinimum residency obligations\nIf you have been a permanent resident for less than five (5) years\nYou must meet the residency obligation to get a PR card.\nIf you have been a permanent resident for five (5) years or more\nyou must have been physically present in Canada for a minimum of\n730 days within the past five (5) years.\nRecord your trips outside Canada. It will help you calculate your physical\npresence in Canada.\nTravel journal\nyou must show that you will be able to meet the minimum of 730 days\nof physical presence in Canada within five (5) years of the date you\nbecame a permanent resident.\nSupporting documents showing that you meet the residency\nobligation\nYou must provide copies of 2 pieces of evidence that can show you have\nmet the residency in Canada in the five (5) years immediately before the\napplication, or since becoming a PR if it has been less than 5 years.\nSome examples include:\nemployment records or pay stubs;\nbank statements;\nCanada Revenue Agency (CRA) Notice of Assessment for the five (5)\nyears immediately before the application\nevidence that you received benefits from Canadian government\nprograms;\nrental agreements;\nclub memberships;\nor any other documents that prove you met your residency\nobligation.\nDo not send original documents, as they will not be returned to you.\nTravel journal\nRecord your trips outside Canada. It will help you fill out your application.\nNotice for persons under 22 years of age:\nResidency requirements to keep Permanent Resident status for PR Card\nand Permanent Resident Travel Document applications:\nOn October 24, 2017, IRCC’s definition of “child” changed, from under\n19 years of age to under 22 years of age.\nThe time an applicant, aged 22 and over, spent accompanying a\nparent abroad before October 24, 2017, will be assessed under the\nprevious definition of “child.”\nThe time an applicant, aged 22 and over, spent accompanying a\nparent abroad on or after October 24, 2017, will be assessed under\nthe new definition of “child.”\nTime spent outside Canada\nYou must provide all your absences from Canada in the past 5 years (or\nsince becoming a permanent resident if less than five 5 years ago) in the\ntable provided on the IMM 5444 application.\n\nConsult the step by step instructions on how to complete the table “Time\nSpent Outside Canada\" on the form.\nIf you have spent fewer than 1095 days outside Canada, submitting the\nsupporting documents listed below is not mandatory. However, failing to\nprovide them may impact the assessment of your residency obligation.\nIf you were outside Canada for more than 1095 days, you may count days\nyou spent outside Canada towards the days required for you to meet the\nresidency obligation in these situations:\nSituation A. Employment outside Canada\nYou may count each day you worked outside Canada if:\nyou are an employee of, or under contract to, a Canadian business or\nthe public service of Canada or of a Canadian province or territory and\nas a term of your job or contract, you are assigned on a full-time basis\nto:\na position outside Canada\nan affiliated enterprise outside Canada or\na client of the Canadian business or the public service outside\nCanada; and\nyou will continue working for the employer in Canada after the\nassignment.\nFor this application, a Canadian business is defined as:\na corporation that is incorporated under the laws of Canada or of a\nprovince and that has an ongoing operation in Canada\nan enterprise that:\nhas an ongoing operation in Canada\nis capable of generating revenue\nis carried out in anticipation of profit\nin which a majority of voting or ownership interests is held by\nCanadian citizens, permanent residents, or Canadian businesses as\ndefined above or\nan organization or enterprise created by the laws of Canada or a\nprovince\nSupporting documents:\nYou must provide a letter signed by an official of the business that\nconfirms:\nthe position and title of the signing official;\nthe nature of the business and how it fits the description of a\nCanadian business (see definition above);\ndetails of your assignment or contract outside Canada such as:\nlength of the assignment;\nconfirmation that you are a full-time employee of the\n“Canadian business” working abroad on a full-time basis as a\nterm of your employment, or that you are on contract working\nabroad on a full-time basis as a term of your contract; and\na description or copy of the position profile regarding the\nassignment or contract abroad;\nthat you will continue working for the employer in Canada after\nyour assignment ends; and\nthat the business was not created mainly for the purpose of\nmeeting your residency obligation.\nYou may also include:\narticles of incorporation and business licenses\npartnership agreements or corporate annual reports\ncorporate Canadian Income Tax Notices of Assessment or financial\nstatements\ncopies of the Employee Assignment Agreement or Contract\ncopies of any agreements between the Canadian business and the\nbusiness or client outside Canada concerning your assignment to\nthat client or business\npay statements\nCanadian Income Tax Notice of Assessment for the five years\nimmediately before the application\nT4 slips\nany other proof you want us to consider\nSituation B. Accompanying a Canadian citizen outside\nCanada\nYou may count each day you accompanied a Canadian citizen outside\nCanada as long as this person is your spouse, common-law partner or\nparent (if you were a child under 19 years of age before October 24, 2017 or\nunder 22 years of age after October 24, 2017).\nProof needed\nYou must provide supporting documents to prove that:\nThe person you are accompanying is a Canadian citizen; and\nYou are the spouse, common-law partner or child of that person.\nSupporting documents may include:\nMandatory:\nall passports or other travel documents that the person you are\naccompanying used in the five (5) years before the application;\ndocuments showing the citizenship of the person you are\naccompanying, including the date the person became a Canadian\ncitizen;\nproof of the residential addresses of the person you are\naccompanying for the five (5) years before the application;\nmarriage licence or proof of common-law partnership (if you are\naccompanying a spouse or common-law partner);\nchild’s birth certificate, baptismal document, or adoption or legal\nguardianship document (if you are accompanying a parent);\nYou may also include:\nCanadian Income Tax Notice of Assessment (NOA) for the past two\n(2) years\nschool or employment records;\nassociation or club memberships;\nany other documents you want us to consider.\nSituation C. Accompanying a permanent resident outside\nCanada\nYou may count each day you accompanied a permanent resident outside\nCanada as long as:\nthe person you accompanied is your spouse, common-law partner or\nparent (if you were a child under 19 years of age before October 24,\n2017 or under 22 years of age after October 24, 2017); and\nthe person was employed on a full-time basis by a Canadian business or\nin the public service of Canada or of a Canadian province or territory\nduring the time you accompanied them.\nProof needed\nYou must provide supporting documents to prove that:\nThe person you are accompanying is a permanent resident;\nYou are the spouse, common-law partner or child of that person; and\nThe permanent resident you are accompanying meets the residency\nobligation.\nSupporting documents may include:\nMandatory:\ndocuments showing the person you are accompanying meets the\nresidency obligation;\nall passports or other travel documents the person you are\naccompanying used in the five (5) years before the application;\nmarriage license or proof of common-law partnership (if you are\naccompanying a permanent resident spouse or common-law\npartner);\nchild’s birth certificate, baptismal document, or adoption or legal\nguardianship document (if you are accompanying a permanent\nresident parent);\nYou may also include:\nSchool or employment records;\nCanadian Income Tax Notice of Assessment;\nassociation or club memberships;\nany other documents you want us to consider.\nHumanitarian and compassionate grounds\nIf you cannot meet the residency obligation, it may still be possible to keep\nyour status as a permanent resident of Canada. To assess your application\non humanitarian and compassionate grounds, you must show that there\nwere exceptional circumstances or factors beyond your control that have\nkept you living outside Canada.\nFactors that might be acceptable are unusual and undeserved, or\ndisproportionate hardships you would face if you lost your permanent\nresident status.\nTo have your application considered on humanitarian and compassionate\ngrounds, you must:\nanswer question 5.7 on the application form;\nprovide proof that there are compelling humanitarian and\ncompassionate factors in your personal circumstances that justify\nkeeping your permanent resident status;\ndescribe why you were not able to meet the residency obligation;\ndescribe the extent of any hardship the loss of residency status would\ncause to:\nyourself;\nfamily members who would be directly affected by this decision;\nand\nthe best interests of any child directly affected by this decision, if\nthis applies to you.\nWhile there are no guidelines about the supporting documents to submit,\nyou must provide documents and information on any aspect of your\nexceptional circumstances that would justify keeping your permanent\nresident status.\nAn officer will consider the factors of your case and will make a decision\nbased on the information and documents you provide with your application.\nSave Time: Send a\nComplete\nApplication\nHow-to video\nCome to Canada\nFind out if you\nare eligible\nDate modified:\n2025-06-16"
}