{
  "type": "pdf",
  "source": "Judicial_Review.pdf",
  "text": "OP 22\nJudicial Review\nOP 22 Judicial Review \n \n2005-10-24 \n \n1 \nUpdates to chapter........................................................................................................................................ 2 \n1. \nWhat this chapter is about.................................................................................................................. 3 \n2. \nProgram objectives............................................................................................................................. 3 \n3. \nThe Act and Regulations.................................................................................................................... 3 \n3.1. \nForms.............................................................................................................................................. 3 \n4. \nInstruments and delegations.............................................................................................................. 3 \n5. \nDepartmental policy............................................................................................................................ 3 \n5.1. \nDistinction between an appeal and judicial review......................................................................... 3 \n5.2. \nLeave required................................................................................................................................ 4 \n5.3. \nTime limit for filing application for leave ......................................................................................... 4 \n5.4. \nPossible outcomes of an application for leave ............................................................................... 4 \n5.5. \nScheduling of judicial review hearing ............................................................................................. 4 \n5.6. \nAppeals of decisions of the Federal Court ..................................................................................... 4 \n5.7. \nAppeals of decisions of the Federal Court of Appeal ..................................................................... 5 \n6. \nDefinitions........................................................................................................................................... 5 \n7. \nProcedure: When an application for leave is filed.............................................................................. 6 \n8. \nProcedure: Where additional documents are requested by the Court............................................... 7 \n9. \nProcedure: Where records are requested.......................................................................................... 7 \n10. \nProcedure: Preparing the record........................................................................................................ 7 \n11. \nProcedure: Litigation strategy ............................................................................................................ 9 \n12. \nProcedure: Preparing an affidavit....................................................................................................... 9 \n12.1. \nProcessing particulars................................................................................................................. 9 \n12.2. \nCommissioning an affidavit......................................................................................................... 9 \n12.3. \nPreparing for a cross-examination............................................................................................ 10 \n13. \nProcedure: Cross-examinations....................................................................................................... 10 \n14. \nProcedure: NHQ point of contact ..................................................................................................... 11 \n15. \nProcedure: Roles and responsibilities.............................................................................................. 11 \n15.1. \nRole of the Litigation Management Division (BCL)................................................................... 11 \n15.2. \nRole of Department of Justice lawyers ..................................................................................... 11 \n15.3. \nRole of Departmental Legal Services Unit................................................................................ 12 \nAppendix \nA Example of an Affidavit ...................................................................................................... 13 \nAppendix \nB Federal Courts Act, sections 18 and 18.1.......................................................................... 15 \nAppendix \nC Excerpts from Federal Court Immigration and Refugee Protection Rules ........................ 17\nOP 22 Judicial Review \n \n2005-10-24 \n \n2 \nUpdates to chapter \nListing by date \nDate: 2005-10-24 \nMinor changes have been made throughout this chapter. Any previous version should be \ndiscarded.  Noteworthy is that the section on cross-examinations, formerly at 5.8, has now \nbecome section 13.\nOP 22 Judicial Review \n \n2005-10-24 \n \n3 \n \n1. \nWhat this chapter is about \nThis chapter provides an understanding of the process for judicial reviews of decisions made \nunder the Immigration and Refugee Protection Act (IRPA) for which no specific right of appeal \nexists. This chapter deals specifically with overseas files that are subject to judicial review. \n2. \nProgram objectives \nThe judicial review process is consistent with the obligation to ensure that decisions made under \nIRPA comply with the Canadian Charter of Rights and Freedoms and the principles of fairness \nand non-discrimination. The judicial review process gives a person who is affected by such a \ndecision the means to have the reasonableness of that decision reviewed by the Federal Court.  \n3. \nThe Act and Regulations \nFor legislation concerning judicial reviews see: \nApplication for judicial review \nA72(1) \nProvisions governing an application \nA72(2) \nRight of Minister \nA73 \nProvisions governing a judicial review \nA74 \nRules \nA75(1) \nInconsistencies \nA75(2) \n3.1. \nForms \nNil. \n4. \nInstruments and delegations \nNil.  \n5. \nDepartmental policy \n5.1. \nDistinction between an appeal and judicial review \nIn an appeal or an application for judicial review, the appellant or the applicant, as the case may \nbe, seeks to challenge a decision adverse to their interests. \nFor appeals, IRPA gives appellants the right to seek a remedy provided for in the Act from a \nspecific level of appeal, such as the Immigration Appeal Division of the Immigration and Refugee \nBoard. A decision that has been appealed can be disposed of by: \n• \ndismissing the appeal; \n• \nstaying the effect of the decision that was appealed; or \n• \nallowing the appeal; and either \n♦ substituting the appellate tribunal’s decision for the decision that was made; or\nOP 22 Judicial Review \n \n2005-10-24 \n \n4 \n♦ sending the issue back to the decision maker for reconsideration. \nUsually the determination of the appeal is based on the question of an error in law or fact or both; \nor on the belief that a principle of natural justice has not been followed; or, sometimes, on the \nexistence of sufficient humanitarian or compassionate considerations to warrant special relief. For \nmore information on appeals, see OP 21. \nIn contrast, a judicial review of a decision is not an appeal on the merits of the case. The Court \ncannot substitute its decision for that of the decision maker. Rather, the Court is examining the \nprocess that led to the decision and determining if this process was fair and reasonable. If the \nCourt determines that it was not, the Court may only quash the decision in question and order a \nredetermination. Judges cannot order which decision is to be made, although they may issue \ndirections as to how the redetermination is to be carried out.  \nPursuant to section 18 of the Federal Courts Act, if the relief sought is based on a defect in the \nform of the decision or on a technical irregularity, the Federal Court can refuse relief if no \nsubstantial wrong or miscarriage of justice took place, or it can take steps to correct the \nirregularity. (See excerpts of sections 18 and 18.1 in Appendix B.) \n5.2. \nLeave required \nA72 through A75 provide for judicial review by the Federal Court of any matter under IRPA. The \nreview is commenced by making an application for leave to the Court. Further, leave cannot be \nsought until the applicant has exhausted all avenues of appeal to which they might be entitled. \nThe requirement for leave does not in itself deprive applicants of an independent review of their \ncases; the Federal Court manages this screening mechanism itself to ensure that meritorious \ncases continue to be granted leave for a full judicial review. \n5.3. \nTime limit for filing application for leave \nIf an issue arises from a decision made outside Canada, the applicant has 60 days after being \nnotified of the decision to apply for leave and judicial review [A72(2)(b)]. In certain circumstances, \nthe Court may extend this deadline. \n5.4. \nPossible outcomes of an application for leave \nThe judge is required to dispose of the leave application without delay and in a summary way \n[A72(2)(d)]. The Court usually disposes of leave applications without personal appearances. If the \nleave application is denied by the Court, then the matter is at an end. If, however, the leave \napplication is granted, then the judge will set the conditions for the full hearing of the judicial \nreview application.  \n5.5. \nScheduling of judicial review hearing \nThe judge who grants leave has to fix a date and place for the full hearing no sooner than 30 days \nand no later than 90 days after granting leave, unless the parties agree to an early hearing.  \n5.6. \nAppeals of decisions of the Federal Court \nThe Federal Court judge’s decision on the application for leave is final and cannot be appealed. A \ndecision of a judge on a full judicial review application can be appealed to the Federal Court of \nAppeal, but only if the judge certifies that a serious question of general importance is involved \n[A74(d)]. The party requesting that a serious question of general importance be certified has to \nspecify the precise question. Under subsection 18(2) of the Federal Court Immigration and \nRefugee Protection Rules, the wording of the certified question is ultimately determined by the \njudge who certifies it.\nOP 22 Judicial Review \n \n2005-10-24 \n \n5 \n5.7. \nAppeals of decisions of the Federal Court of Appeal \nUnder subsection 40(1) of the Supreme Court Act, decisions of the Federal Court of Appeal can \nbe appealed to the Supreme Court of Canada only with leave of that Court. \n6. \nDefinitions \nAffidavit \nAn affidavit is the applicant's or officer's sworn recital of the \nfacts and procedure followed relevant to the decision that is \nbeing challenged by way of judicial review. Affidavits filed in \nthe Federal Court must conform to the Court's rules \nregarding formality. For more information, see section 12 \nbelow. \n \nApplication \nIn this chapter, the term “application” refers to either \napplications for leave to commence an application for judicial \nreview, or applications for judicial review, depending on the \ncontext. \n \nCertiorari \nRoughly translated, this means \"inform me more fully.\" This \nwrit commands an inferior tribunal to provide its record to the \nsuperior court for review \"to the end that justice might be \ndone.\" The result of a successful application will be the \nquashing of the tribunal’s decision. These writs are not \nusually issued if there is an appeal process provided by \nstatute. \nOn certiorari, the court does not delve into the merits of the \ncase, but questions the jurisdictional and procedural aspects \nof the decision. \nThis is one of the writs that is usually sought in judicial \nreviews of officers’ decisions, i.e., to quash a decision; the \nother is an order of mandamus referring the decision back for \nreconsideration by another officer. \nSee also Prerogative \nwrits \nHabeas \nCorpus \nThis means literally \"you have the body.\" It directs the \nauthority who has an individual in custody to come forward \nand justify the detention. This centuries-old remedy against \narbitrary imprisonment is fundamental to our system of \njustice. \nThe detaining authority must make a \"return,\" or response, to \nthe writ to show that the detention is lawful. This writ does \nnot arise in an officer’s decisions. \nSee also Prerogative \nwrits (below) \nMandamus \nThis writ (\"we command\") is issued to compel the \nperformance of a duty. It is available in cases where the \ninjured party has a right to have a thing done and has no \nother specific means of compelling its performance. It is used\nto compel public officers to perform duties imposed upon \nthem by common law or by statute, or to compel tribunals to \nproceed in matters within their jurisdiction. The person \nagainst whom it is issued must be under a legal duty to act in \na certain way, must have been asked to act, and must have \nrefused to do so. If granted, the writ compels the \nperformance of the act required. \nThis writ may be sought if there is a long delay in making a \ndecision on a file. If there is a good reason for the delay, this \napplication will not succeed, but may be deferred for a fixed \nperiod to be brought back before the court if there is no \ndecision by that time. For example, if an officer is waiting for \nSee also Prerogative \nwrits (below)\nOP 22 Judicial Review \n \n2005-10-24 \n \n6 \nadditional information from a third party who is taking an \nunreasonably long time to answer, an applicant may seek an \norder compelling the officer to make a decision without \nwaiting for that information. \nPrerogative \nwrits \nThe principal common-law means for judicial review of the \ndecisions of government tribunals are found in the remedies \nof habeas corpus, certiorari, mandamus and prohibition. \nAlthough they are now regulated by legislation, their origins \nare in the common law. They are issued only by superior \ncourts: those courts which, historically, did not derive their \nauthority from statute but from the Crown. These remedies \nare referred to as \"prerogative writs,\" a term which \nemphasizes that they are issued at the discretion of the \ncourt. \nAlthough the function of each writ is somewhat different, the \nmain feature of each is to permit the courts to supervise the \nactions of inferior tribunals (\"inferior\" means a court that is \nsubject to the control of a higher court). This supervisory role \nis not all-encompassing because the courts are limited in the \nextent to which they can go beyond the jurisdictional and \nprocedural aspects of a decision to review the actual merits. \nSee also above: \n• \nCertiorari \n• \nMandamus \n• \nProhibition \n• \nHabeas Corpus \nProhibition \nThis writ is issued to prohibit the exercise of a particular \nfunction or act. It is considered to be a sister remedy to \ncertiorari; the two differ in the time appropriate for their use. \nWhile certiorari quashes something already done \nerroneously, prohibition seeks to prevent an error from either \noccurring or continuing. Prohibition does not lie until a right \nto complain has arisen, but it may be sought as soon as an \nabsence of jurisdiction has either arisen or may clearly be \nforeseen. \nThis writ may be sought to prevent a decision from being \nmade, or from being made in a particular way. For example, \nif an applicant believes that the officer responsible for the file \nis biased, the applicant could seek an order of prohibition \npreventing the officer from making a decision and an order of \nmandamus compelling the transfer of the file to another \nofficer.  \nSee also Prerogative \nwrits (above) \nTribunal \nIn this chapter, “tribunal” means the person or the body \nwhose decision, order, act or omission is the subject of the \napplication, unless expressly stated otherwise in this text, \ne.g., an officer or their supervisors or program managers, \nand senior officials of the Department. \n \n7. \nProcedure: When an application for leave is filed \nFrom the day that they are notified of the decision, a foreign national has 60 days to file an \napplication for leave to submit a judicial review application. In order for leave to be granted, a \njudge of the Federal Court must be satisfied that there is a serious issue to be heard. \nAfter an application for leave has been filed, the Court may request a copy of the reasons for the \nrefusal. In overseas cases, this will be interpreted as a request for a copy of the refusal letter and \nthe CAIPS notes. The Litigation Management Division (BCL) will advise the visa office as to what \nprocedure to follow. In most cases, the visa office will be asked by BCL to provide a copy of this \nmaterial to the Court Registry, the applicant's lawyer and the Department of Justice lawyer. All \naddresses and fax numbers will be provided by BCL.\nOP 22 Judicial Review \n \n2005-10-24 \n \n7 \nIn some cases, it may be necessary to submit affidavit evidence to oppose the leave application. \nIf this is required, BCL will advise the officer. \nThe leave application will be considered by a judge of the Federal Court, who will determine \nwhether there is a serious issue to be heard. If leave is granted, a full judicial review of the \ndecision will be held at a later date. \nIf leave is granted, the officer will be contacted by BCL and advised as to what material must be \nprovided. Normally, this will consist of certified copies of the file. In addition, the Department of \nJustice lawyer will work closely with the officer to develop an affidavit opposing the judicial review \napplication.  \n8. \nProcedure: Where additional documents are requested by the Court \nWhere a judge considers that documents in the possession or control of the tribunal are needed \nto properly dispose of the application, the judge may issue an order specifying which materials \nare to be provided. The tribunal or the officer assigned to the task must provide certified true \ncopies of the material without delay: two to the Court Registry and one to each of the parties, plus \none for the DOJ lawyer assigned to the case. \nIn all cases, the officer will be provided with clear instructions from either BCL or the Department \nof Justice. \n9. \nProcedure: Where records are requested \nIf leave is granted, the Court Registry will advise Citizenship and Immigration Canada (CIC). The \nDepartment, through BCL, will notify the visa office concerned and provide clear directions for the \npreparation of the certified tribunal record (CTR). The CTR is, for all practical purposes, a copy of \nthe visa office file and the CAIPS notes. This must be prepared in a certain way and sent to a \nnumber of addressees. In its instruction letter, BCL will give specific, tailored instructions for the \npreparation of the record. \nNormally three copies of the certified tribunal record are prepared: \n• \none for the Court Registry; \n• \none for the applicant or their counsel; and \n• \none for the Department’s counsel (the DOJ lawyer assigned to the case). \nThere will also be an ordinary copy of the file sent to BCL. Specific instructions will be provided to \nthe visa office, along with contact numbers and addresses. \n10. \nProcedure: Preparing the record \nUpon receipt of the order granting leave, BCL will direct the officer to immediately prepare the \nrecord of the subject of the application on consecutively numbered pages. BCL’s instructions \nshould be followed precisely and given the highest priority possible. \nNormally, in response to an application for judicial review, officers will be directed to do the \nfollowing: \n1.  Make three certified copies and one additional non-certified copy of the file concerning the \napplicant’s application for leave. This should include a CAIPS printout up to the date of the refusal \nonly. The officer will:\nOP 22 Judicial Review \n \n2005-10-24 \n \n8 \n• \nnumber the pages of the original file, then make copies from the numbered original; \n• \ncertify the file, binding the pages of each copy in a secure way (e.g., with a grommet or pin). The first \npage of each certified copy should be a cover letter, the details of which BCL will provide.  \nNote: It is crucial for the officer to carefully and promptly review all the documents and information in the \nfile(s) before preparing the certified tribunal record. The officer must immediately bring to the attention \nof BCL and the DOJ lawyer the documents or information that CIC may not wish to include, and \nthereby disclose, in the certified tribunal record. The package must not include the e-mail from BCL or \nany other material postdating the refusal. Furthermore, where material on file may be CLASSIFIED \nfor security reasons (e.g., communication with the Security Liaison Officer or the Canadian Security \nIntelligence Service) or exempt from disclosure by reasons of solicitor-client or other privilege, officers \nshould contact BCL and/or the assigned DOJ lawyer for further instructions on the preparation of the \ntribunal record.  \n2.  Send one certified copy of the file by commercial courier to each of the following (BCL will \nsupply the officer with the appropriate names and addresses): \n• \nthe Court Registry; \n• \nthe DOJ lawyer; \n• \ncounsel for the applicant. \n3.  Send the non-certified copy by commercial courier to CIC/BCL, to the attention of the BCL \nofficer in charge of the judicial review. \nNote: Retain the original file at the visa office. \n4.  Prepare a case summary, preferably in affidavit format. This should be done at the same time \nas the certified copies are prepared. The case summary should provide: \n• \ndetails of the assessment; \n• \nthe reasons for the refusal; and \n• \nthe following personal information about the decision-making officer: \n♦ full name; \n♦ rank (FS 1, FS 2, etc.); \n♦ date the officer joined the foreign service; \n♦ date the officer commenced the relevant posting; \n♦ non-Mitnet phone and fax numbers at which the officer can be reached by the lawyer; and \n♦ any scheduled absences from the office in the months to come. \nFor more information, see section 12 below. \n5. Send the case summary by e-mail to the assigned DOJ litigator and BCL. Remember the \ncase summary must not be given to either the Federal Court or to counsel for the applicant; it \nis for the use of BCL and Justice only. \n(See excerpts of Federal Court Immigration and Refugee Protection Rules in Appendix C.\nOP 22 Judicial Review \n \n2005-10-24 \n \n9 \n11. \nProcedure: Litigation strategy \nUpon receipt and review of the case summary and the certified copy of the file, the DOJ lawyer \nand BCL will decide whether to consent to or oppose the application for judicial review. If it is \ndecided to oppose, an affidavit will be prepared for the officer to execute. BCL normally advises \nthe officer of the specific deadlines to meet. Federal Court rules confine CIC to specific time limits \nfor the filing of the respondent’s record and affidavit. The officer should therefore give BCL’s \ninstructions top priority. \n12. \nProcedure: Preparing an affidavit \nThe DOJ lawyer will deal directly with the officer in the preparation of the affidavit. The affidavit is \ndue 30 days from the filing of the applicant’s affidavit. Normally, the DOJ lawyer will review  the \nofficer's case summary (which was written in affidavit format) and make any necessary changes. \nOnce this review is complete, the officer will be instructed to swear the document. This process \nensures that the affidavit places an appropriate emphasis on the legal issues at play in the judicial \nreview application. (See sample affidavit in Appendix A.) \n12.1. \nProcessing particulars \nThe following particulars apply to affidavits: \n1. \nThe affidavit must be on letter-sized paper. (A4 is fine.) \n2. \nThe text of the affidavit must be double-spaced. \n3. \nA readable and common font such as Times New Roman must be used. \n4. \nThe text must be in at least 12-point type. \n5. \nAn electronic copy of the affidavit should be kept to help with the redrafting process. \n6. \nThe same person who is commissioning the officer's affidavit must commission any \nexhibits attached to the affidavit. The failure to properly commission exhibits is the \nmost common technical flaw in the affidavits that DOJ lawyers receive from officers.  \n12.2. \nCommissioning an affidavit \nUnder sections 52 and 53 of the Canada Evidence Act, officers of the Canadian diplomatic, \nconsular and representative services, while performing their functions in any foreign country or in \nany part of the Commonwealth and Dependent Territories other than Canada, have the authority \nto administer, take or receive oaths, affidavits, solemn affirmations or declarations. This includes \nambassadors, envoys, ministers, chargés d'affaires, counsellors, secretaries, attachés, consuls \ngeneral, consuls, vice-consuls, pro-consuls, consular agents, acting consuls general, acting \nconsuls, acting vice-consuls, acting consular agents, high commissioners, permanent delegates, \nacting high commissioners, and acting permanent delegates. \nThe following words must also be used on the first page of any document that is attached to the \naffidavit as an exhibit:  \nThis is Exhibit No. ___ mentioned and referred to in the affidavit of _______ \nSworn before me this day of \nA.D.200X. \nA Commissioner for taking affidavits\nOP 22 Judicial Review \n \n2005-10-24 \n \n10 \n_____________________________ \nNote: Exhibits must be commissioned at the same time and by the same commissioner as the affidavit \nto which they are attached. \n12.3. \nPreparing for a cross-examination \nThe most important part of every cross-examination is the preparation. Preparation takes place \nboth when the officer, in conjunction with the DOJ lawyer, is preparing their affidavit and prior to \nthe cross-examination itself. \nHere are some points to keep in mind: \n• \nThe affidavit is the officer's evidence. The officer should be absolutely satisfied with every detail of the \naffidavit that is drafted and with the exhibits that are attached to it. Any problems should be discussed \nwith the DOJ lawyer and BCL. \n• \nThe officer should know the facts of the case. The officer should go over the tribunal record and the \nCAIPS notes. \n• \nThe officer must remember that on each statement of fact made in the affidavit, they should be able to \nanswer the questions, “What is the source of this statement?” and “What is the basis for my \nconclusion?” \n• \nThe officer should have a telephone discussion with the DOJ lawyer to try to identify the likely areas \non which they will be examined and confirm what their position is with respect to those issues. \n• \nIt is the DOJ lawyer’s responsibility to fully prepare the officer for the cross-examination. The officer \nshould tell the DOJ lawyer or BCL if they feel uncomfortable or nervous at all. The DOJ lawyer or BCL \nwill be able to answer any questions that the officer may have about the process, the type of \nquestions that will be asked, what the officer may bring, etc. Officers should not be afraid to ask. \n13. \nProcedure: Cross-examinations \nJust as a party may cross-examine a witness who testifies, the applicant has the right to cross-\nexamine the officer on their affidavit. It is up to the applicant to decide whether any cross-\nexamination is necessary. Accordingly, a cross-examination will not result every time an affidavit \nis filed, but being cross-examined is a possibility whenever an officer files an affidavit. Both the \nofficer and the Justice counsel should bear this in mind as the affidavit is being prepared.  \nUpon filing of the officer’s affidavit, the applicant has 20 days in which to proceed with the cross-\nexamination of the officer. Officers must make themselves reasonably available within that period, \nor the Court may strike out the affidavit. The 20-day period may be extended, on consent, to up to \na total of 30 days from the date the affidavit is filed. In extraordinary circumstances, extensions for \nlonger periods of time may be granted by the Court, on motion by a party.  \nBecause of geographic considerations, officers are usually cross-examined by teleconference \ncall. The officer and the Department of Justice (DOJ) lawyer will agree on the day and the specific \ntime of the teleconference call. The speakers are the applicant’s lawyer, the DOJ lawyer and a \nstenographer. The lawyer for the applicant will call the officer. The lawyer and the DOJ litigator \nwill introduce themselves. There will be a stenographer present, who is there only to record each \nquestion posed by the applicant’s counsel and each answer the officer provides to those \nquestions. There will be no judge present since the officer is not giving evidence as in a trial but, \nrather, is giving evidence to be recorded later for use at a judicial review. When the officer is \ncalled, they will be required to swear an oath or affirm that they will answer questions truthfully. \nAnother consular officer will be there to administer the oath or affirmation.\nOP 22 Judicial Review \n \n2005-10-24 \n \n11 \nThe applicant’s counsel will then begin to ask the officer questions. The examination typically \nbegins with questions regarding the officer's occupation, present position and the number of \nyears the officer has spent in that position and/or location. The examination then moves on to \nspecific questions about the officer's decision in the particular case.  \nAfter the applicant’s counsel finishes asking the officer questions, the DOJ lawyer may ask \nquestions. This is called redirect examination or reply examination. The purpose of redirect \nexamination is to try to clarify the testimony the officer gave to the applicant’s counsel and not to \nset out the officer’s version of the case in full. \nAs mentioned above, there is no judge in the room. If a dispute arises between the parties as to \nthe propriety of a question, or a refusal to answer a question, the parties bring the matter before a \njudge for resolution at a later date. If the judge agrees that a question should have been \nanswered, the officer may be required to re-attend to answer any questions improperly refused. In \npractice, however, such motions are rarely brought. \nNote: Once the cross-examination begins, the officer should note that the DOJ lawyer cannot discuss \nany aspect of the case with them until their cross-examination is completely finished. \nThe applicant may choose to conduct a written  cross-examination instead of an oral one. Written \ncross-examinations are uncommon but permitted. In that case, the applicant's lawyer will file and \nserve a list of questions to be answered by the officer. These must be answered in affidavit forms \nand should be prepared in consultation with the DOJ lawyer. \n14. \nProcedure: NHQ point of contact \nOfficers who encounter issues or circumstances not addressed in this chapter should refer their \nquestion or comment to the Litigation Management Division at National Headquarters. \n15. \nProcedure: Roles and responsibilities \n15.1. \nRole of the Litigation Management Division (BCL) \nThe Litigation Management Division, a directorate in the Case Management Branch at National \nHeadquarters, is involved in all overseas litigation cases. From the onset of litigation, BCL acts as \na liaison between DOJ lawyers and the officer whose decision is being challenged. BCL provides \ninstructions to DOJ lawyers with respect to pending litigation; analyses policy, program and legal \nissues arising in specific cases, and coordinates program input. In all cases, BCL will instruct the \nofficer on what to do and when to do it. \nBCL also monitors and manages developments in the areas of immigration, citizenship and \nrefugee litigation, and ensures that preventive program action is taken to lower program \nvulnerability to court challenges. This involves ensuring that program and policy sectors have \nadequate opportunity to review, evaluate and respond to developments in litigation issues that \nmay have significant consequences for departmental policy or programs. BCL identifies issues \nrequiring strategic consideration by the Department's senior management through the Litigation \nStrategy Committee. \n15.2. \nRole of Department of Justice lawyers \nDOJ lawyers represent the Minister in all applications before the Federal Court and in the \nprovincial courts. BCL analysts issue instructions to the lawyers based on an analysis of the \nissues and program considerations. Some cases will involve direct communication between DOJ \nand the visa office.\nOP 22 Judicial Review \n \n2005-10-24 \n \n12 \n15.3. \nRole of Departmental Legal Services Unit  \nThe Departmental Legal Services Unit (DLSU) is staffed by Department of Justice lawyers and \nprovides legal support to CIC in its day-to-day operations. If a case is sufficiently novel or \ncomplex, the Department of Justice lawyer or the BCL analyst may ask that a DLSU lawyer be \nassigned to the case. This lawyer will provide additional support to the litigator and the BCL \nanalyst, where required. Examples of cases where a DLSU lawyer might be involved include \nCharter challenges, cases with serious policy implications, or high-profile litigation.\nOP 22 Judicial Review \n \n2005-10-24 \n \n13 \n \nAppendix \nA Example of an Affidavit \nRegistry No. IMM-XXXX-97 \nFEDERAL COURT OF CANADA \n \nB e t w e e n: \n \n[ INSERT FULL NAME OF PARTY] \n \nApplicant(s) \n \nand \n \n \nTHE MINISTER OF CITIZENSHIP AND IMMIGRATION \n \nRespondent \n \nAFFIDAVIT OF FRANCIS LAURIE SMITH \nI, FRANCIS LAURIE SMITH, Second Secretary (Immigration) at the High Commission for \nCanada in London, England, United Kingdom [or, at the Embassy of Canada in Lima, Peru, etc.], \nMAKE OATH AND SAY AS FOLLOWS: \n1. I am a foreign service officer at the FS-1 (or 2, or EX-01, etc.) level and I have been employed \nby the Department of Citizenship and Immigration in this capacity since January yy, 200x. I have \nbeen appointed as an officer in the Immigration Section of the Canadian High Commission in \nLondon, United Kingdom, since September yy, 19xx. My duties include the assessment, \nevaluation and processing of applications for permanent residence in Canada submitted to the \nCanadian High Commission in London and, being the officer assigned to process the Applicant's \npermanent resident visa, I have knowledge of the matters to which I hereinafter depose. \n2. From paragraph 2 onwards, present the facts of the case under judicial review, usually in \nchronological order. If citing an important or key document, consider including it as an exhibit to \nthe affidavit, bearing in mind that most documents from the visa file are already before the Court \nin the certified tribunal record. To do so, at the end of the sentence in which the document is \nreferred to, add the words: \"a true copy of which I attach as Exhibit A\" (or B, C, etc., as the case \nmay be).  \n3. An affidavit also typically includes wording attesting to the truth of the CAIPS notes. A sample \nof the wording would be as follows: \nNotes taken by me at the interview with the applicant were recorded in the Computer-Assisted \nImmigration Processing System (CAIPS), an electronic file system in use at [the name of your \nvisa office] for the processing of applications for admission to Canada. The steps involved in \nprocessing an application are recorded chronologically in CAIPS. When a user quits the CAIPS \n“notes screen,” their initials, the date and the notes entered are automatically recorded. \nThereafter, a user can access and review these notes, but they cannot be modified or deleted.\nOP 22 Judicial Review \n \n2005-10-24 \n \n14 \nThe notes taken by me at the interview and entered into CAIPS were taken at the time of the \ninterview with the applicant. These notes accurately reflect the questions posed to the applicant \nand the answers given by the applicant at the interview. \nA printout of the CAIPS notes of the interview is included as part of the record, copies of which I \ncertified on XX XX XX and which I have arranged to be transmitted to counsel for both parties as \nwell as the Registry of the Federal Court. \nOnce you have recited the facts of your assessment of the application for permanent residence, \nor for a student or temporary resident visa, stressing of course your reasons and considerations \nin refusing the application, you will close your affidavit by swearing it, as described below: \nSWORN BEFORE ME at the ) \nCanadian High Commission, in) \nthe City of London, England, ) _________________________________ \nUnited Kingdom this ) \nday of [insert month], 20XX. ) \n_____________________________ \nA Commissioner, etc.\nOP 22 Judicial Review \n \n2005-10-24 \n \n15 \n \nAppendix \nB Federal Courts Act, sections 18 and 18.1 \n18. (1) Subject to section 28, the Federal Court has exclusive original jurisdiction \n(a)  to issue an injunction, writ of certiorari, writ of prohibition, writ of mandamus or writ of quo \nwarranto, or grant declaratory relief, against any federal board, commission or other tribunal; and \n(b)  to hear and determine any application or other proceeding for relief in the nature of relief \ncontemplated by paragraph (a), including any proceeding brought against the Attorney General of \nCanada, to obtain relief against a federal board, commission or other tribunal. \n(2) The Federal Court has exclusive original jurisdiction to hear and determine every application \nfor a writ of habeas corpus ad subjiciendum, writ of certiorari, writ of prohibition or writ of \nmandamus in relation to any member of the Canadian Armed Forces serving outside Canada. \n(3) The remedies provided for in subsections (1) and (2) may be obtained only on an application \nfor judicial review made under section 18.1.  \nR.S., 1985, c. F-7, s. 18; 1990, c. 8, s. 4; 2002, c. 8, s. 26. \n18.1 (1) An application for judicial review may be made by the Attorney General of Canada or by \nanyone directly affected by the matter in respect of which relief is sought. \n(2) An application for judicial review in respect of a decision or order of a federal board, \ncommission or other tribunal shall be made within thirty days after the time the decision or order \nwas first communicated by the federal board, commission or other tribunal to the office of the \nDeputy Attorney General of Canada or to the party directly affected by it, or within any further time \nthat a judge of the Federal Court may fix or allow before or after the end of those 30 days. \n(3) On an application for judicial review, the Federal Court may \n(a) order a federal board, commission or other tribunal to do any act or thing it has unlawfully \nfailed or refused to do or has unreasonably delayed in doing; or \n(b) declare invalid or unlawful, or quash, set aside or set aside and refer back for determination in \naccordance with such directions as it considers to be appropriate, prohibit or restrain, a decision, \norder, act or proceeding of a federal board, commission or other tribunal. \n(4) The Federal Court may grant relief under subsection (3) if it is satisfied the federal board, \ncommission or other tribunal \n(a) acted without jurisdiction, acted beyond its jurisdiction or refused to exercise its jurisdiction; \n(b) failed to observe a principle of natural justice, procedural fairness or other procedure that it \nwas required by law to observe; \n(c) erred in law in making a decision or an order, whether or not the error appears on the face of \nthe record; \n(d) based its decision or order on an erroneous finding of fact that it made in a perverse or \ncapricious manner or without regard for the material before it; \n(e) acted, or failed to act, by reason of fraud or perjured evidence; or \n(f) acted in any other way that was contrary to law. \n(5) If the sole ground for relief established on an application for judicial review is a defect in form \nor a technical irregularity, the Federal Court may \n(a) refuse the relief if it finds that no substantial wrong or miscarriage of justice has occurred; and\nOP 22 Judicial Review \n \n2005-10-24 \n \n16 \n(b) in the case of a defect in form or a technical irregularity in a decision or order, make an order \nvalidating the decision or order, to have effect from any time and on any terms that it considers \nappropriate.\nOP 22 Judicial Review \n \n2005-10-24 \n \n17 \n \nAppendix \nC Excerpts from Federal Court Immigration and Refugee Protection \nRules \nNote: These rules are subject to change by the Chief Justice of the Federal Court. \nObtaining Tribunal's Decision and Reasons \n9. (1) Where an application for leave sets out that the applicant has not received the written \nreasons of the tribunal, the Registry shall forthwith send the tribunal a written request in Form IR-\n3 as set out in the schedule. \n(2) Upon receipt of a request under subrule (1) a tribunal shall, without delay, \n(a) send a copy of the decision or order, and written reasons therefor, duly certified by an \nappropriate officer to be correct, to each of the parties, and two copies to the Registry; or \n(b) if no reasons were given for the decision or order in respect of which the application is made, \nor reasons were given but not recorded, send an appropriate written notice to all the parties and \nthe Registry. \n(3) A tribunal shall be deemed to have received a request under subrule (1) on the tenth day after \nit was sent by mail by the Registry. \n(4) The applicant shall be deemed to have received the written reasons, or the notice referred to \nin paragraph 9(2)(b), as the case may be, on the tenth day after it was sent by mail by the \ntribunal. SOR/98-235, s. 8(F); SOR/2002-232, s. 15. \nDisposition of Application for Leave \n14. (1) Where \n(a) any party has failed to serve and file any document required by these Rules within the time \nfixed, or \n(b) the applicant's reply memorandum has been filed, or the time for filing it has expired, \na judge may, without further notice to the parties, determine the application for leave on the basis \nof the materials then filed. \n(2) Where the judge considers that documents in the possession or control of the tribunal are \nrequired for the proper disposition of the application for leave, the judge may, by order, specify \nthe documents to be produced and filed and give such other directions as the judge considers \nnecessary to dispose of the application for leave. \n(3) The Registry shall send to the tribunal a copy of an order made under subrule (2) forthwith \nafter it is made. \n(4) Upon receipt of an order under subrule (2), the tribunal shall, without delay, send a copy of the \nmaterials specified in the order, duly certified by an appropriate officer to be correct, to each of \nthe parties, and two copies to the Registry. \n(5) The tribunal shall be deemed to have received a copy of the order on the tenth day after it was \nsent by mail by the Registry. SOR/98-235, s. 8(F). \n15. (1) An order granting an application for leave \n(a) shall specify the language and the date and place fixed under paragraphs 74(a) and (b) of the \nAct for the hearing of the application for judicial review; \n(b) shall specify the time limit within which the tribunal is to send copies of its record required \nunder Rule 17;\nOP 22 Judicial Review \n \n2005-10-24 \n \n18 \n(c) shall specify the time limits within which further materials, if any, including affidavits, \ntranscripts of cross-examinations, and memoranda of argument are to be served and filed; \n(d) shall specify the time limits within which cross-examinations, if any, on affidavits are to be \ncompleted; and \n(e) may specify any other matter that the judge considers necessary or expedient for the hearing \nof the application for judicial review. \n(2) The Registry shall send to the tribunal a copy of an order granting leave forthwith after it is \nmade. \n(3) The tribunal shall be deemed to have received a copy of the order on the tenth day after it was \nsent by mail by the Registry. SOR/2002-232, s. 8. \nObtaining Tribunal's Record \n17. Upon receipt of an order under Rule 15, a tribunal shall, without delay, prepare a record \ncontaining the following, on consecutively numbered pages and in the following order: \n(a) the decision or order in respect of which the application for judicial review is made and the \nwritten reasons given therefor, \n(b) all papers relevant to the matter that are in the possession or control of the tribunal, \n(c) any affidavits, or other documents filed during any such hearing, and \n(d) a transcript, if any, of any oral testimony given during the hearing, giving rise to the decision or \norder or other matter that is the subject of the application for judicial review, \nand shall send a copy, duly certified by an appropriate officer to be correct, to each of the parties \nand two copies to the Registry. SOR/2002-232, s. 14."
}