{
  "type": "pdf",
  "source": "Loss_of_Permanent_Resident_Status.pdf",
  "text": "ENF 23 \n \n \nLoss of permanent resident status\nENF 23 Loss of permanent resident status \n2015-01-23 \n \n2 \nUpdates to chapter ...................................................................................................... 4 \n1 What this chapter is about .......................................................................................... 6 \n2 Program objectives .................................................................................................... 6 \n3 The Act and Regulations ............................................................................................. 6 \n3.1 Statutory provisions of IRPA ................................................................................. 6 \n3.2 Regulatory provisions of IRPA ............................................................................. 10 \n3.3 Immigration Appeal Division (IAD) Rules .............................................................. 12 \n3.4 Forms .............................................................................................................. 13 \n4 Instruments and delegations..................................................................................... 14 \n5 Departmental policy ................................................................................................ 14 \n6 Definitions ............................................................................................................. 16 \n6.1 Accompanying outside of Canada......................................................................... 16 \n6.2 Canadian business ............................................................................................. 16 \n6.3 Child ............................................................................................................... 17 \n6.4 Day ................................................................................................................. 17 \n6.5 Employment outside of Canada ........................................................................... 17 \n7 Procedure: Residency obligation ................................................................................ 18 \n7.1 The residency obligation under IRPA .................................................................... 18 \n7.2 Calculating days physically present in Canada ....................................................... 19 \n7.3 Persons who have had permanent resident status less than five years ...................... 19 \n7.4 Employment outside Canada ............................................................................... 20 \n7.5 Accompanying a Canadian citizen outside Canada .................................................. 25 \n7.6 Accompanying a permanent resident outside Canada .............................................. 26 \n7.7 Humanitarian and compassionate determinations ................................................... 26 \n7.8 Examining permanent residents at a POE .............................................................. 31 \n7.9 Voluntary relinquishment of permanent resident status under the former Immigration \nAct, 1976 .............................................................................................................. 31 \n7.10 Voluntary relinquishment of permanent resident status under IRPA ........................ 32 \n7.11 Recording determination of obligations under A28 ................................................ 35 \n7.12 Certificate of departure (IMM 0056B) when an order is not yet in force.................... 35 \n7.13 Permanent Resident Cards ................................................................................ 36 \n8 Overview: A31(3) travel documents; IAD processes; overseas decisions and their effect at a \nPOE ......................................................................................................................... 37 \n8.1 A31(3) Travel documents ................................................................................... 37 \n8.2 IAD appeal requirements .................................................................................... 39 \n8.3 Decisions made overseas on loss of PR status and their effect at a Port of Entry ......... 40\nENF 23 Loss of permanent resident status \n2015-01-23 \n \n3 \n9 In-Canada procedures pertaining to A44(1) reports: Reports on permanent residents and \npersons claiming to be permanent residents .................................................................. 42 \nAppendix A Supreme Court of Canada decision in Baker v. M.C.I. [1999] 2 S.C.R. 817 ........ 44 \nAppendix B Strengthening decisions / guidelines on taking notes ...................................... 48 \nAppendix C Declaration ............................................................................................... 50\nENF 23 Loss of permanent resident status \n2015-01-23 \n \n4 \nUpdates to chapter \nListing by date: \n2015-01-23 \nThis chapter has been updated as follows: \n \nSection 6.5 has been revised to include additional criteria for permanent residents to \nmeet residency obligations while working abroad. \n2005-11-25 \nChanges were made to reflect the transition from CIC to the CBSA. \n \nSection 4 under Instruments and delegations clarifies the roles of respective ministers in \nthe administration of IRPA. \n \nThe coming into force of R259 is addressed in 3.2. \n \nTransitional provisions were deleted from section 3.1, 7.13 and 8.1. \n \nModification of section 7.7 on humanitarian and compassionate grounds to clarify intent \nwas made. \n \nClarification to section 7.8 on examination of permanent residents at ports of entry was \nmade. \n2004-11-17 \nSection 7.7 has been updated to address the effects of a recently made favourable \nhumanitarian and compassionate decision on a residency determination as well as the \ncircumstances of adults who left Canada as children in order to accompany their parents. \nThere were also minor modifications to the last two bullets under “Extent of non-compliance” \n(at section 7.7) to omit the age of the client in those circumstances. \n2003-09-02 \nChapter ENF 23, entitled Loss of Permanent Resident Status, has been updated and is now \navailable on CIC explore. \nThe amendments that were made clarify the circumstances in which voluntary relinquishment \nmay be considered. They also provide more detailed procedures for POEs and inland offices \nwhen processing voluntary relinquishment of permanent resident (PR) status. \nAmong the changes to this chapter, the highlights include:\nENF 23 Loss of permanent resident status \n2015-01-23 \n \n5 \n \nSection 5 has been updated to provide departmental policy on voluntary relinquishment \nof PR status. \n \nSection 7.8 provides guidance on examining a permanent resident at a Port of Entry. \n \nSection 7.9 explains the consequences of a voluntary relinquishment under the former \nAct and when the person should be considered a foreign national. \n \nSection 7.10 provides the guidelines for voluntary relinquishment of PR status under \nIRPA including the guidelines to follow in writing up an A44(1) report for non-compliance \nprior to allowing relinquishment. This section also provides guidelines for cases where a \nperson withdraws their declaration of voluntary relinquishment. Guidance is also provided \nfor the exceptional circumstances where voluntary relinquishment is allowed despite \ncompliance to A28. \n \nSection 7.11 explains where to record the determination of obligations under A28 in \nFOSS. \n \nSection 7.12 explains the guidelines to follow as per a certificate of departure when an \norder is not yet in force. \n \nSection 7.13 refers to the previous section 7.8 entitled Permanent Resident Card, to \nwhich no amendments have been made. \n \nSection 9 has been updated to provide guidance about the issue and authority of seizing \npermanent resident documents.\nENF 23 Loss of permanent resident status \n2015-01-23 \n \n6 \n1 What this chapter is about \nThis chapter explains: \n \nwhen and why determinations of permanent resident status are required; \n \nthe factors to be considered when making a determination relating to permanent resident \nstatus; \n \nwhat to do if a permanent resident is determined to have complied with the residency \nobligation contained within the Immigration and Refugee Protection Act (IRPA); \n \nwhat to do if a permanent resident is determined not to have complied with the residency \nobligation in IRPA; and \n \nwhat to do if a permanent resident wishes to relinquish their status. \n2 Program objectives \nIRPA establishes a residency obligation with respect to each five-year period after permanent \nresident status has been granted. \nThe provisions governing the residency obligation intend: \n \nto prescribe clear and objective, yet flexible, rules and criteria for establishing and \ndetermining compliance with the residency obligation provisions of IRPA; \n \nto assist decision-makers in assessing fundamental factors related to determinations of \nresidency status, as well as enhance transparency and consistency in decision making; \nand \n \nto prescribe rules for calculating days of physical presence in Canada to determine \ncompliance with the residency obligation under A28. \n3 The Act and Regulations \n3.1 Statutory provisions of IRPA \nPermanent resident: A person who has acquired permanent resident \nstatus and has not subsequently lost that status under A46. \nA2(1) \nEnter and remain: A permanent resident of Canada has the right to \nenter and remain in Canada, subject to the provisions of the IRPA. \nA27 \nResidency obligation: A permanent resident must comply with a \nresidency obligation with respect to every five-year period (i.e. 730 \nA28(1), A28(2)(a)\nENF 23 Loss of permanent resident status \n2015-01-23 \n \n7 \ndays/5 years test). \nPhysical presence: Calculating days physically present in Canada. \nA28(2)(a)(i) \nAccompanying a Canadian citizen spouse or common-law partner or \nparent. \nA28(2)(a)(ii) \nEmployed abroad, on a full-time basis, by a Canadian business or in \nthe public service of Canada or of a province. \nA28(2)(a)(iii) \nAccompanying a Canadian permanent resident spouse or common-\nlaw partner or parent abroad and who is employed on a full- time basis \nby a Canadian business or in the public service of Canada or of a \nprovince. \nA28(2)(a)(iv) \nPermanent residents for less than 5 years: How to assess \ncompliance with the residency obligation in those cases where the person \nconcerned has been a permanent resident for less than 5 years. \nA28(2)(b)(i) \nPermanent residents for 5 years or more: How to assess compliance \nwith the residency obligation in those cases where the person concerned \nhas been a permanent resident for five years or more. \nA28(2)(b)(ii) \nHumanitarian and Compassionate Considerations (H&C):  \nWhen determining whether a permanent resident (PR) has complied with \nthe residency obligation with respect to being “physically present in \nCanada” for 730 days within a 5 five year period, an officer must \nconsider H&C grounds (including the best interests of a child directly \naffected by such a determination) prior to making a determination that \nthe person has lost their permanent resident status.  \nWhen an officer determines that humanitarian and compassionate \nconsiderations relating to a permanent resident justify the retention of \npermanent resident status, then such a determination will overcome any \nbreach of the residency obligation made before the H&C determination. \nA28(2)(c) \nA31(3) Travel document - “R” is the category coding that will be \nused on counterfoils involving permanent residents and \nA31(3)\nENF 23 Loss of permanent resident status \n2015-01-23 \n \n8 \n“residency obligation” decisions made overseas: Permanent \nresidents being issued with an A31(3) travel document will have, as a \ngeneral indicator of the category of case, the alpha letter “R” notated on \nthe counterfoil. Note: some currently used “category of case” codes \ninclude: “T” = students; “E” = temporary workers; and “V” = visitors). \nA31(3) Travel document “R-1” counterfoil coding: Permanent \nresidents, without a permanent resident card, who comply with \nthe residency obligation: In those cases where an overseas applicant \nfor an A31(3) travel document is issued with an A31(3) travel document, \nand an officer overseas has made a determination that the permanent \nresident has complied with the residency obligation (A31(3)(a)), the \ncounterfoil coding is “R-1.” \nA31(3)(a) \nA31(3) Travel document “RC-1” counterfoil coding: Permanent \nresidents without a permanent resident card / positive H&C case: In \nthose cases where an overseas applicant for an A31(3) travel document \nis issued with an A31(3) travel document, and an officer overseas has \nmade a determination under A28(2)(c) on the basis of H&C \nconsiderations, counterfoil coding is “RC-1.” \nA31(3)(b) \nA31(3) Travel document “RX-1” counterfoil coding: Permanent \nresidents without a permanent resident card / Decision made \noverseas that the permanent resident has not complied with the \nresidency obligation / A63(4)appeal: In those cases where an \noverseas applicant for an A31(3) travel document is issued with an \nA31(3) travel document, and an officer overseas is satisfied that the \npermanent resident was physically present in Canada at least once within \nthe 365 days before the examination (A31(3)(c)), and the applicant has \nappealed or may appeal to the Immigration Appeal Division (IAD) under \nA63(4), the counterfoil coding is “RX-1.” \nA31(3)(c) \nA31(3) Travel document “RA-1” counterfoil coding: Permanent \nresidents without a permanent resident card / Decision made \noverseas that the permanent resident has not complied with the \nresidency obligation; and has not been physically present in \nCanada at least once within the 365 days before the examination \n/ A63(4) appeal / IAD orders the presence of the permanent \nresident: In those cases where an officer overseas issues an A31(3) \ntravel document as a consequence of a permanent resident appeal to the \nImmigration Appeal Division (IAD), and a resultant IAD order that the \npermanent resident physically appear at the hearing, the counterfoil \nA175(2)\nENF 23 Loss of permanent resident status \n2015-01-23 \n \n9 \ncoding is “RA- 1.” \nInadmissibility for failing to comply with A27(2) or A28. \nA41(b) \nInadmissibility report based on non-compliance under A41(b). \nA44(1) \nPermanent Resident Card: The Immigration and Refugee Protection \nAct (IRPA) provides that a permanent resident shall be provided with a \ndocument indicating their status in Canada. \nA31(1) \nGeneral Presumptions - unless an officer determines otherwise - \nA person in possession of permanent resident card is presumed to have \npermanent resident (PR) status.  \nA person who is outside Canada and who does not present a permanent \nresident card is presumed not to have permanent resident (PR) status. \nA31(2)(a) and (b) \nLoss of PR Status: When permanent resident status is lost. \nA46(1)(a), (b), (c) \nand (d) \nRight to Appeal Removal Order: A permanent resident may appeal to \nthe Immigration Appeal Division (IAD) against a decision at an \nexamination or admissibility hearing to make a removal order against \nthem. \nA63(3) \nRight of Appeal Residency Obligation: A permanent resident may \nappeal to the Immigration Appeal Division (IAD) against a decision made \noutside of Canada on the residency obligation underA28. \nA63(4) \nRemoval order made by the Immigration Appeal Division: If the \nImmigration Appeal Division dismisses an appeal made under A63(4) and \nthe permanent resident is in Canada, it shall make a removal order. \nA69(3) \nImmigration Appeal Division (IAD) jurisdiction: \nThe Immigration Appeal Division, in any proceeding before it, (a) must, \nin the case of an appeal under A63(4), hold a hearing. \nA175(1)(a)\nENF 23 Loss of permanent resident status \n2015-01-23 \n \n10 \nPresence of permanent resident at an IAD Hearing: In the case of \nan appeal by a permanent resident under A63(4), the Immigration \nAppeal Division may, after considering submissions from the Minister and \nthe permanent resident and if satisfied that the presence of the \npermanent resident at the hearing is necessary, order the permanent \nresident to physically appear at the hearing, in which case an officer shall \nissue a travel document for that purpose. \nA175(2) \n3.2 Regulatory provisions of IRPA \nDefinition of a common-law partner \nR1(1) and (2) \nDefinition of a dependent child \nR2 \nDefinition of guardianship \nR2 \nDefinition of a Canadian business \nR61(1) \nCanadian business does not include . . . - in the context of a \npermanent resident’s residency obligation under the Act (IRPA). \nR61(2) \nEmployment outside Canada, in the context of a permanent \nresident’s residency obligation [for the purposes of \nsubparagraphs A28(2)(a)(iii) and (iv)]. \nR61(3) \nAccompanying (ordinarily residing with) a Canadian citizen or \npermanent resident spouse or common-law partner or parent \noverseas \nR61(4) \nObligation of an accompanied permanent resident to maintain \ntheir residency obligation under the Immigration and Refugee Protection \nAct(IRPA). \nR61(5)\nENF 23 Loss of permanent resident status \n2015-01-23 \n \n11 \nDefinition of a child [for the purposes of subparagraphs A28(2)(a)(ii) \nand (iv)]. \nR61(6) \nCalculation residency obligation  \nThe five-year period does not include any day after: \n A44(1) on the grounds that the \npermanent resident has failed to comply with the residency obligation; \nor \nhas failed to comply with the residency obligation, \nunless the permanent resident is subsequently determined to have \ncomplied. \nR62(1) and (2) \nPermanent Resident Card: The permanent resident card provided or \nissued by the Department, remains at all times the property of Her \nMajesty in right of Canada and must be returned to the Department on \nthe Department’s request. \nR53(2) \nPeriods of validity - Permanent Resident (PR) Cards: Permanent \nresident cards are generally valid for five years.  \nExceptions: A permanent resident card is valid for one year from the \ndate of issue if the permanent resident at the time of issue: \nprocess as set out in paragraphA46(1)(b) (final \ndetermination of a decision made outside Canada); \n \nfiling an appeal from the decision has not expired or, if an appeal is \nfiled, there has been no final determination of the appeal; or \nunder A44(2) (for an admissibility hearing) and the period for filing an \nappeal (to the IAD) from any decision of the Immigration Division has \nnot expired or, if an appeal is filed, there has been no final \ndetermination of the appeal. \nR54(1) \nR54(2) \nRenewal and Revocation of Permanent Resident Cards \nR59(2)\nENF 23 Loss of permanent resident status \n2015-01-23 \n \n12 \nn the revocation of the previously issued PR card; \nstolen or destroyed; or if the permanent resident becomes a Canadian \ncitizen, loses permanent resident status or is deceased. \nR60(a) \nOther Regulatory Provisions Transportation Regulations  \nThe permanent resident card is included in a list of prescribed \ndocuments in R259(f) of the Transportation Regulations that oblige \ntransportation companies to request the permanent resident card before \nboarding passengers who claim to be permanent residents. \n  \nRemoval Orders/Returning Resident Permits \n  \nReturning Resident Permits: \nR328(2): Any period spent outside of Canada within the five years \npreceding the coming into force of this section [referring to R328 of \ntheImmigration and Refugee Protection Act (IRPA)], by a permanent \nresident holding a returning resident permit is considered to be a period \nspent in Canada for the purpose of satisfying the residency obligation \nunder A28 if that period is included in the five-year period referred to in \nthat section. \nR328(3) Any period spent outside of Canada within the two years \nimmediately following the coming into force of this section [referring to \nR328 of theImmigration and Refugee Protection Act (IRPA)], by a \npermanent resident holding a returning resident permit is considered to \nbe a period spent in Canada for the purpose of satisfying the residency \nobligation under A28 if that period is included in the five-year period \nreferred to in that section. \nR328(2) and (3) \nThese subsections of the Regulations came into force on 31 December \n2003. It refers to the necessity to have a travel document pursuant \ntoA31(3) and a permanent resident card. \nR259(a) and R259(f) \nR365(3) \n3.3 Immigration Appeal Division (IAD) Rules \nImmigration Appeal Division Rules\nENF 23 Loss of permanent resident status \n2015-01-23 \n \n13 \nDefinitions \nRule 1 \nAppeals from Removal Orders Made at Examination \nRule 7 \nAppeal Record (for appeals under Rule 7) \nRule 8 \nAppeals of Decisions Made outside Canada on the Residency Obligation \nRule 9 \nAppeal Record (for appeals under Rule 9) \nRule 10 \nStay of Removal \nRule 26 \nReturn to Canada for a Hearing \nRule 46 \n3.4 Forms \nThe forms required are shown in the following table. \nForm name \nForm \nnumber \nCertificate of Departure \nIMM 0056B \nImmigrant Visa and Record of Landing \nIMM 1000B \nConfiscated or Voluntarily Surrender CIC’s or CIIR’s (IMM 1000B) \nIMM 1342B \nQuestionnaire: Determination of Permanent Resident Status \nIMM 5511B \nDeclaration—Voluntary Relinquishment of Permanent Resident Status \nIMM 5538B\nENF 23 Loss of permanent resident status \n2015-01-23 \n \n14 \nDeclaration—Relinquishment of Permanent Resident Status When the \nResidency Obligation is Met \nIMM 5539B \n4 Instruments and delegations \nPursuant to A6(1) and A6(2), the Minister has designated persons or classes of persons as \nofficers to carry out any purpose of any provision, legislative or regulatory, and has specified \nthe powers and duties of the officers so designated. These delegations and designations may \nbe found in IL 3. \nThe Minister of Citizenship and Immigration (C&I) is responsible for the administration of the \nAct and for assessments of the residency obligation. Officers of CIC and the CBSA are \ndesignated to carry out this assessment. \nThe Minister of Public Safety and Emergency Preparedness is responsible for the \nadministration of IRPA as it relates to \na. \nthe examination at ports of entry; \nb. the enforcement of the Act, including arrest, detention and removal; \nc. the establishment of policies respecting the enforcement of the Act and inadmissibility on \ngrounds of security, organized criminality or violating human or international rights; and \nd. determinations under subsections A34(2), A35(2) and A37(2). \nThe Minister of PSEP is responsible for A44 reports and the authority to write and review \nreports is delegated to officers of CIC and the CBSA. \n5 Departmental policy \nPolicies related to assessments of compliance with the residency obligation [A28] are the \nresponsibility of CIC. \nIRPA establishes a residency obligation with respect to each five-year period after the \ngranting of permanent resident status. \nThe Act also specifies situations where time spent outside of Canada can be deemed to be \ntime spent in Canada for the purpose of retaining permanent resident status. \nThe provisions governing the residency obligation are based primarily on the requirement of \n“physical presence” in Canada or on prescribed linkages to Canada, which include \nemployment with a prescribed Canadian institution operating outside of Canada. \nThe Act also prescribes circumstances wherein permanent resident spouses, common-law \npartners and children can maintain their status while accompanying abroad a Canadian \ncitizen; or another permanent resident who complies with their own residency obligation and \nwho is employed, on a full-time basis, with a prescribed Canadian institution.\nENF 23 Loss of permanent resident status \n2015-01-23 \n \n15 \nNo specific provisions exist to exempt students from the residency obligation provisions. \nUnder the Immigration Act (IA), it was practice to allow persons to voluntarily relinquish \npermanent resident status when they declared they had ceased to be a permanent resident in \naccordance with the criteria in S. 24 (they had remained outside of Canada with the intention \nof abandoning Canada as their place of permanent residence). \nUnlike the Immigration Act, the criteria in IRPA for loss of status require that an officer \nconduct a determination on the residency obligation under A28 before loss of status can \noccur. Outside of Canada, the loss of status occurs when the appeal period of 60 days \nexpires, in the case of a person who does not challenge a negative residency obligation \ndetermination (A46(1)(b)). At POEs or inland, loss of status occurs when the period of 30 \ndays to file an appeal against the removal order expires and the order comes into force \n(A46(1)(c), A49(1)(c)). \nIn addition, the Department has decided to allow voluntary relinquishment of permanent \nresident status in limited circumstances. This may be permitted in situations where an \nindividual does not meet the residency obligation but is only seeking to enter Canada as a \ntemporary resident or where a person has to abandon permanent resident status in order to \naccept employment for a foreign government, including a diplomatic posting, or where such \nvoluntary relinquishment is necessary in order to qualify for status in another country. This \npermission is not to be used in cases where permanent residents are subject to a report \nunder A44(1) that may be or has been referred to the IRB for an admissibility hearing on \nmatters other than the residency obligation criteria [A28]. \nOnce a determination is made that a person has lost permanent resident status due to \nprevious voluntary surrender of the Record of Landing (IMM 1000) (i.e. signing an IMM 1342B \nunder the previous Immigration Act), voluntary relinquishment under IRPA, or a \ndetermination under A28 and the appeal period has expired, or a waiver of appeal rights has \nbeen signed following a negative A28 determination, made abroad they are no longer \npermanent residents for all purposes under IRPA. \nWhen an officer believes a permanent resident has failed to comply with their A28 residency \nobligation, then that officer should report the permanent resident under the provisions of \nA44(1) and recommend issuance of a departure order. IMM 5511B: \"Questionnaire: \nDetermination of permanent resident status\" has been developed specifically to assist officers \nin making permanent resident residency obligation decisions keeping in mind that the \nquestionnaire alone is not sufficient to determine compliance with the residency obligation, as \na detailed interview including examining humanitarian and compasionate criteria A28(2)(c) is \nneeded. Furthermore, the officer cannot seize the person’s documents (such as the IMM \n1000, Immigrant Visa and Record of Landing and the IMM 5292B, for example), despite the \nwriting of a an A44(1) report and the issuance of a removal order, unless the officer believes \nthere are reasonable grounds to do so in accordance with section A140. The rationale behind \nthis is that the person has a right to appeal the removal order, and until final determination of \nstatus, they remain a permanent resident and are the lawful owner of said documents. \nIt is recognized that in some cases where the person is willing to provide information in order \nto assist the officer in determining compliance with the residency obligation, the officer and/or\nENF 23 Loss of permanent resident status \n2015-01-23 \n \n16 \nthe person may need time to gather information/documentation. Therefore, when an \nexamining officer at a Port of Entry (POE) , requires further information/documentation from a \npermanent resident (to enable the officer to make a decision on compliance or non-\ncompliance with the residency obligation), and where the person is willing to submit this \ninformation on a later date, the officer may ask the person to come back on another day for \nfurther evaluation. This is similar to an adjournment as in A23 but is not a formal \nadjournment, since the person is not obligated to come back and A23 cannot apply to a \npermanent resident. An officer cannot impose conditions as stated in A23 and R43 on a \npermanent resident for whom a final determination of loss of status has not been rendered. \nSpecifically, pursuant to A28(2), a permanent resident complies with the residency obligation \nprovisions if, for at least 730 days with respect to every five-year period, the permanent \nresident is physically present in Canada, or: \n \nis outside Canada accompanying a Canadian citizen who is their spouse or common-law \npartner or, in the case of a child, their parent; \n \nis outside Canada employed on a full-time basis by a Canadian business or in the public \nservice of Canada or of a province; \n \nis outside Canada accompanying a permanent resident who is their spouse or common-\nlaw partner or, in the case of a child, their parent and who is employed on a full-time \nbasis by a Canadian business or in the public service of Canada or of a province; \n \nis referred to in regulations providing for other means of compliance; or \n \nhumanitarian and compassionate considerations, taking into account the best interests of \na child directly affected by the determination, justify the retention of the permanent \nresident status and overcome any breach of the residency obligation prior to \ndetermination. \n6 Definitions \n6.1 Accompanying outside of Canada \nA28(2)(a)(ii) and A28(2)(a)(iv) provides that each day a permanent resident is outside of \nCanada, accompanying a Canadian citizen spouse, common-law partner or, in the case of a \nchild, parent with whom he or she ordinarily resides, is deemed a day of physical presence in \nCanada. Each day a permanent resident is outside Canada, accompanying a spouse, common-\nlaw partner or, in the case of a child, parent who is also a permanent resident and with whom \nhe or she ordinarily resides, is also deemed a day of physical presence in Canada provided the \nspouse, common-law partner or parent of the other permanent resident is employed on a full-\ntime basis by a Canadian business or in the public service of Canada or of a province. \n6.2 Canadian business \nThe definition applies to both large and small businesses, and includes:\nENF 23 Loss of permanent resident status \n2015-01-23 \n \n17 \n \nfederally or provincially incorporated businesses which have an ongoing operation in \nCanada; \n \nother enterprises that have an ongoing operation in Canada, are capable of generating \nrevenue, are carried out in anticipation of profit and in which a majority of voting or \nownership interests is held by Canadian citizens, permanent residents or Canadian \nbusinesses; \n \nenterprises which have been created by the laws of Canada or a province. \nNote: It does not include businesses that have been created primarily for the purpose of \nallowing a permanent resident to satisfy his or her residency obligation while residing outside \nof Canada R61(2). \n6.3 Child \nFor the purposes of A28(2)(a)(ii) and (iv), child is defined as a child of a Canadian citizen or \npermanent resident, including an adopted child, who is not and has never been a spouse or \ncommon-law partner and is less than 22 years of age. \n6.4 Day \nFor the purpose of calculating the number of days to comply with the residency obligation \nin A28(2)(a), a day includes a full day or any part of a day that a permanent resident is \nphysically present in Canada. Any part of a day spent in Canada, or otherwise in compliance \nwith A28(2)(a), is to be counted as one full day for the purpose of calculating the 730 days in \na five-year period. \n6.5 Employment outside of Canada \nThe regulations enable permanent residents to comply with the residency obligations while \nworking abroad, provided that: \n \nthey are under contract to, or are full-time employees of a Canadian business or in the \npublic service, where the assignment is controlled from the head office of a Canadian \nbusiness or public institution in Canada; \n \nthey are assigned on a full-time basis as a term of their employment or contract, to a \nposition outside Canada with that business, an affiliated enterprise or a client; \n \nthey maintain a connection to a Canadian business; \n \nthe are assigned on a temporary basis to the work assignment; and \n \nthey will continue working for the employer, in Canada, after the assignment.\nENF 23 Loss of permanent resident status \n2015-01-23 \n \n18 \n7 Procedure: Residency obligation \n7.1 The residency obligation under IRPA \nThe four principal ways that permanent residents can meet the residency obligation under \nIRPA are by: \n \nphysical presence in Canada; \n \naccompanying abroad (that is, ordinarily residing with) a spouse or common-law partner \nor parent who is a Canadian citizen; \n \nbeing employed abroad, on a full-time basis, by a prescribed “Canadian business” or in \nthe public service of Canada or of a province; or \n \naccompanying abroad (that is, ordinarily residing with) a Canadian permanent resident \nspouse or common-law partner or parent, who is also outside of Canada and who is \nemployed, on a full- time basis, by a prescribed “Canadian business” or in the public \nservice of Canada or of a province. \nOfficers are advised to first assess the cumulative number of days physically present in \nCanada A28(2)(a)(i) in order to determine if the permanent resident has acquired 730 days \nphysical presence in the preceding 5-year period. \nIf the number of days physically present is still less than 730 days, officers may then count, \nand include, any other days that may qualify in any of the remaining three categories \nidentified above; for example, the permanent resident may have accompanied a Canadian \ncitizen spouse abroad. \nIf the combined total of days is still less than 730 days, the residency obligation may still be \nmet if there are humanitarian and compassionate considerations relating to the permanent \nresident, taking into account the best interests of a child directly affected by the \ndetermination, that justify retention of permanent resident status. \nRefer to A28(2)(c) and section 7.7 below. \nNote: A28(2)(b) and A31(3) provide that the onus rests with the permanent resident to \nprovide information and evidence to satisfy an officer that the residency obligation has \nbeen/will be met. \nPut simply, this means that the permanent resident bears the full responsibility of \ndemonstrating - with supporting documentation as considered necessary by an officer - that \nthey were physically present in Canada for the required number of days or that they have \notherwise met (or will be able to meet) the residency obligation as prescribed in the Act. \nThe permanent resident also bears the onus of presenting documentation that is credible, in \nthe opinion of an officer, to support any assertion(s) made by the permanent resident, or that \nmay have been made on behalf of that permanent resident. There is no one document that \ncan categorically establish a permanent resident’s physical presence in Canada.\nENF 23 Loss of permanent resident status \n2015-01-23 \n \n19 \n7.2 Calculating days physically present in Canada \nThe residency obligation contained within the Immigration and Refugee Protection Act is \nbased primarily on “physical presence” requirements or prescribed linkages - while outside \nCanada - to prescribed Canadian employers or to Canadian citizens; and/or to Canadian \npermanent residents who reside abroad and are employed, on a full-time basis, by a \nprescribed Canadian employer. \nThis is substantially different from earlier immigration legislation requirements as previously, \nretaining permanent resident status was largely dependent on a demonstration of a person’s \n“intent” not to abandon Canada as their place of permanent residence. \nThe most direct way a permanent resident can show that they have fulfilled their residency \nobligation under the Immigration and Refugee Protection Act (IRPA) is to demonstrate that \nthey were physically present in Canada for the specified minimum number of days (that is, \n730 days within the previous 5 year period immediately preceding examination) pursuant \nto A28(2)(a)(i). \nIf a permanent resident can establish having met this 730 day in a five-year period \nrequirement, then it is not necessary to examine or assess any other factor concerning the \nreasons for any absence from Canada during the five-year period under examination: the \npermanent resident will have complied with the residency obligation contained within the Act. \nIt is to be noted, R62(1), R62(2) – The five-year period does not include any day after: \n \na report is prepared under A44(1) on the grounds that the permanent resident has failed \nto comply with the residency obligation; or \n \na decision is made outside of Canada that the permanent resident has failed to comply \nwith the residency obligation, \nunless the permanent resident is subsequently determined to have complied. \nIn cases involving permanent residents who may hold a “Returning Resident Permit” under \nprevious immigration legislation, or who may hold an unexpired “Returning Resident Permit,” \ntransitional provisions contained within the Immigration and Refugee Protection Act provide \nthat the time period covered by such a permit is applicable to the five-year period. Put \nsimply, this means that the time period covered by such a permit shall be counted as time \nspent in Canada for the purposes of satisfying the residency obligation contained within \nthe Immigration and Refugee Protection Act R328(2) and R328(3). \n7.3 Persons who have had permanent resident status less than five \nyears \nA28(2)(b)(i) provides that if a person has been a permanent resident for less than five years, \nthey must demonstrate, at examination, that they will be able to meet the residency\nENF 23 Loss of permanent resident status \n2015-01-23 \n \n20 \nobligation in respect of the five-year period immediately after they became a permanent \nresident. \nIn these situations, officers should adhere to the following procedure: \n1. Calculate the number of days of physical presence in Canada commencing from the date \nthat the person became a permanent resident. \n2. If 730 days remain in the five-year period following the date that the person became a \npermanent resident, then that person cannot be found to have failed to comply with the \nresidency obligation contained within the Act. \n3. If there is less than 730 days remaining in the five-year period, count the number of \ndays remaining and add them to the number of days calculated in step #1; that is, add \nto the “number of days physical presence in Canada” as calculated in step #1. \nIf this resultant number equals or exceeds 730 days, the permanent resident complies with \nthe residency obligation in IRPA. Nevertheless, in these cases, officers should inform the \nperson of the possibility of losing their permanent residency in the event that the person does \nnot meet the 730-day threshold at some future time. \nWhen officers inform persons on such matters, an entry to this effect should be made in the \nField Operational Support System (FOSS) or the Computer-Assisted Immigration Processing \nSystem (CAIPS), as appropriate, based on whether the officer is overseas or in Canada. \nNote: A conclusion that a permanent resident has not fulfilled their residency obligation can \nbe made only after an assessment of any H&C factors that have been submitted for \nconsideration. [A28(2)(c)]. \n7.4 Employment outside Canada \nIn addition to being physically present in Canada, a permanent resident may satisfy the \nresidency obligation if they are (or were) employed, on a full-time basis, outside of Canada by \na prescribed “Canadian business” or in the public service of Canada or of a province \nA28(2)(a)(iii). \nIn certain situations the total of 730 days can be accumulated by accompanying a Canadian \npermanent resident abroad who is (or was) employed on a full-time basis outside of Canada \nby a prescribed “Canadian business” or in the public service of Canada or of a province \nA28(2)(a)(iv). \nRegulation R61(1) defines a “Canadian business” as: \na) a corporation that is incorporated under the laws of Canada or of a province and that has \nan ongoing operation in Canada; \nb) an enterprise, other than a corporation described in paragraph (a), that has an ongoing \noperation in Canada and \n(i) that is capable of generating revenue and is carried out in anticipation of profit,\nENF 23 Loss of permanent resident status \n2015-01-23 \n \n21 \nand \n(ii) in which a majority of voting or ownership interests is held by Canadian citizens, \npermanent residents, or Canadian businesses as defined in this subsection; or \nc) an organization or enterprise created by the laws of Canada or a province. \nFor greater certainty, a Canadian business does not include a business that serves primarily \nto allow a permanent resident to meet their residency obligation while residing outside \nCanada A61(2). \nWhen determining if an employer meets the definition of a “Canadian business,” or whether \nthe permanent resident is in the public service of Canada or of a province, officers are \nencouraged to ask permanent residents to provide one or more of the documents shown \nbelow, as considered necessary by the officer. In many cases, a letter of declaration from a \nCanadian business employer (containing information described as follows) could serve to \nprovide sufficient evidence to enable an officer to make a determination on compliance with \nA28(2)(a)(iii) requirements. However, where an employers’ letter of declaration does not, in \nthe officer’s opinion, satisfactorily address or include the information necessary to make a \ndetermination, additional supporting documentation will be required. \nR61(1)(a): Any corporation that has been federally or provincially \nincorporated would satisfy the definition providing that the business has \nan ongoing operation in Canada. \nSuggested Information and Documentary Evidence: \nA letter of declaration signed by an authorized officer of the “Canadian business” employer/ \ncontractor that states the position and title of the signing officer and indicates the following: \n \nthat the said business is incorporated under the laws of Canada or a particular province, \nas applicable; \n \nthat the business has an ongoing operation in Canada; and the name and style under \nwhich the business is operating in Canada, for example, doing business as: [business \nname]; \n \nthe nature of the business, length of time in operation in Canada and number of \nemployees in Canada; \n \ndetails of the permanent resident’s assignment or contract abroad; such as, \no \nduration of the assignment; confirmation that the permanent resident is a full-\ntime employee of the “Canadian business” working abroad on a full-time basis as \na term of their employment or that the person is on contract working on a full-\ntime basis abroad as a term of their contract; \no \na description or copy of the position profile regarding the assignment or contract \nabroad; \n \ndetails about the nature of the relationship between the Canadian business and the \nbusiness abroad, indicating if the employment is with the Canadian business’s office \nabroad, an affiliated enterprise or a client; and\nENF 23 Loss of permanent resident status \n2015-01-23 \n \n22 \n \nconfirmation that the “Canadian business” has not been created primarily for the purpose \nof allowing a permanent resident to satisfy their residency obligation while residing \noutside Canada. \nAdditional supporting documentary evidence may include, as applicable: \n \nArticles of Incorporation; \n \nBusiness license(s); \n \nCorporate annual report(s); \n \nCorporate Canadian Income Tax Notice of Assessment; \n \nFinancial statement(s); \n \nA copy of the Employee Assignment Agreement or Contract; \n \nA copy of any agreement or arrangement between the “Canadian business” and the \nbusiness or client abroad concerning the permanent resident’s assignment to that client \nor business. \nR61(1)(b): An enterprise may be a legal entity other than a corporation. \nExamples include a proprietorship, partnership, joint-partnership, etcetera. Many small \nbusinesses and professional businesses, such as law and engineering firms and some banks, \nmay be included in this category. Some banks and other financial institutions could also be \ndescribed in R61(1)(a). In order to qualify under this definition, these businesses must also \nhave an ongoing operation in Canada that is capable of generating revenue and is carried out \nin anticipation of profit. Canadian citizens, permanent residents or Canadian businesses must \nhold the majority of voting or ownership interests in the business. \nSuggested information and documentary evidence: \nA letter of declaration signed by an authorized officer of the “Canadian business” employer/ \ncontractor that states the position and/or title of the signing officer and indicates the \nfollowing: \n \nwhether the said business is a proprietorship, partnership, joint partnership, etc., as \napplicable; \n \nthe name, citizenship and residency status of the proprietor, or, in the case partnerships, \neach partner; \n \na breakdown of voting or ownership interests of each partner in the business; \n \nthat the business has an ongoing operation in Canada; and the name and style under \nwhich the business is operating in Canada, for example, doing business as: [business \nname]; \n \nthe nature of the business, length of time in operation in Canada and number of \nemployees in Canada; \n \ndetails of the permanent resident’s assignment or contract abroad such as the duration \nof the assignment; confirmation that the permanent resident is a full-time employee of \nthe “Canadian business” working abroad on a full-time basis as a term of their\nENF 23 Loss of permanent resident status \n2015-01-23 \n \n23 \nemployment or that the person is on contract working on a full-time basis abroad as a \nterm of their contract; a description or copy of the position profile regarding the \nassignment or contract abroad; \n \ndetails about the nature of the relationship between the Canadian business and the \nbusiness abroad indicating if the employment is with the Canadian business’s office \nabroad, an affiliated enterprise or a client; and \n \nconfirmation that the “Canadian business” has not been created primarily for the purpose \nof allowing a permanent resident to satisfy their residency obligation while residing \noutside of Canada. \nAdditional supporting documentary evidence may include, as applicable: \n \nPartnership agreement(s); \n \nBusiness license(s); \n \nCanadian Income Tax Notice of Assessment for the business; \n \nFinancial statement(s); \n \nA copy of the Employee Assignment Agreement or Contract; \n \nA copy of any agreement or arrangement between the “Canadian business” and the \nbusiness or client abroad concerning the permanent resident’s assignment to that \nbusiness or client. \nR61(1)(c): An organization or enterprise that is created by the laws of \nCanada or a province. \nExamples may include crown corporations, municipal bodies, certain agencies, universities, \nhospitals, etcetera. These organizations do not necessarily operate in anticipation of profit or \nare not necessarily capable of generating revenue. \nSuggested information and documentary evidence: \nA letter of declaration signed by an authorized officer of the “Canadian business” employer/ \ncontractor that states the position and title of the signing officer and indicates the following: \n \nthat the said business has been created by the laws of Canada or a particular province; \n \nthe name and style under which the business is operating in Canada, for example, doing \nbusiness as: [business name]; \n \nthe nature of the business, length of time in operation in Canada and number of \nemployees in Canada; \n \ndetails of the permanent resident’s assignment or contract abroad such as duration of \nthe assignment; confirmation that the permanent resident is a full-time employee of the \n“Canadian business” working abroad on a full-time basis as a term of their employment \nor that the person is on contract working on a full-time basis abroad as a term of their \ncontract; a description or copy of the position profile regarding the assignment or \ncontract abroad;\nENF 23 Loss of permanent resident status \n2015-01-23 \n \n24 \n \ndetails about the nature of the relationship between the Canadian business and the \nbusiness abroad indicating if the employment is with the Canadian business’s office \nabroad, an affiliated enterprise or a client; and \n \nconfirmation that the “Canadian business” has not been created primarily for the purpose \nof allowing a permanent resident to satisfy their residency obligation while residing \noutside of Canada. \nAdditional supporting documentary evidence may include, as applicable: \n \nArticles of Association; \n \nArticles of Incorporation; \n \nBusiness license(s); \n \nAnnual report(s); \n \nFinancial statement(s); \n \nA copy of the Employee Assignment Agreement or Contract; \n \nA copy of any agreement or arrangement between the “Canadian business” and the \nbusiness or client abroad concerning the permanent resident’s assignment to that client \nor business. \nNote: The aforementioned listings of Canadian employer documentation are not meant to be \nall encompassing nor exhaustive. Consequently, officers are encouraged to ask permanent \nresidents to provide such documentation as an officer deems necessary in order to make a \ndetermination that a permanent resident is (or was) employed, on a full-time basis, by a \nprescribed “Canadian business” or in the public service of Canada or of a province. \nR61(3): Determining if permanent residents are employed on a full-time basis by \na prescribed Canadian business \nWhen determining if permanent residents are “employed on a full-time basis” by a \nprescribed “Canadian business,” officers are encouraged to ask permanent residents to \nprovide such information, documentation and/or evidence - as is considered necessary by the \nofficer - to satisfy the officer that the permanent resident’s employment abroad complies \nwith: \n(a) the R61(3) regulatory provisions pertaining to qualifying criteria for employment abroad; \nand \n(b) the R61(1) definition of a “Canadian business”. \nSuggested information and documentary evidence: \n \nA letter of declaration and, as considered necessary by the officer, supporting \ndocumentation from the Canadian government body or “Canadian business” \nemployer/contractor – as the case may be - indicating compliance with the \ndefinitions/provisions of regulations R61(1) and R61(3). \n \nSee also preceding manual guidelines pertaining to examining information and \ndocumentary evidence under sub-headings R61(1)(a), (b) and (c).\nENF 23 Loss of permanent resident status \n2015-01-23 \n \n25 \nAdditional supporting documentary evidence may include: \n \npay statement(s); \n \nCanadian Income Tax Notice of Assessment; \n \nT4 slips; \n \nproof that the permanent resident is (or was) working abroad on a full-time basis; \n \ndetails and particulars concerning the assignment, secondment, contract or whatever \nother name might be given to that document, if such document exists, that requires (or \nrequired) the permanent resident to work abroad (in those cases where a copy of the \ndocument is not specific in itself); \n \nthe duration of the above referred to assignment, secondment or contract (as \nappropriate). \nDays worked abroad for a prescribed Canadian employer are to be added to the number of \ndays of physical presence in Canada in order to determine if the combined number of days \nequals or exceeds the 730-day threshold. \nNote: A28(2)(b) and A31(3) provide that the onus rests with the permanent resident to \nprovide information and evidence to satisfy an officer that the residency obligation has been \nmet. \nNote: This includes demonstrating that the permanent resident’s employment abroad is (or \nwas) in compliance with regulatory description R61(3) concerning qualifying criteria for \nemployment abroad; and the R61(1) definition of a “Canadian business”. \n7.5 Accompanying a Canadian citizen outside Canada \nR61(4) provides that each day a permanent resident is outside Canada accompanying (that \nis, ordinarily residing with) a Canadian citizen constitutes a day of physical presence in \nCanada, provided that the Canadian citizen they are accompanying is a spouse or common-\nlaw partner or parent. \nIn the case of a permanent resident outside Canada accompanying a Canadian citizen, it is \nnot necessary to determine who is accompanying whom, nor is it necessary to determine for \nwhat purpose. In other words, under A28(2)(a)(ii) and R61(4), as long as a permanent \nresident is accompanying a Canadian citizen, the intent and purpose of their absences are not \nrelevant as the residency obligation is met. \nFor the purposes of A28(2)(a)(ii) and (iv), R61(6) defines a “child” as being a child of a \nparent referred to in those subparagraphs, who has not and has never been a spouse or \ncommon- law partner and is less than 22 years of age. \nNote: The provisions respecting the age of a “child” apply equally to both permanent resident \nchildren of Canadian citizens and permanent resident children of permanent residents.\nENF 23 Loss of permanent resident status \n2015-01-23 \n \n26 \n7.6 Accompanying a permanent resident outside Canada \nIn accordance with R61(5), and in connection with A28(2)(a)(iv), a permanent resident \ncomplies with the residency obligation so long as the permanent resident they are \naccompanying is their spouse or common-law partner or parent and that spouse or common-\nlaw partner or parent is in compliance with their residency obligation. \nPut another way, an accompanying permanent resident may only count days of physical \npresence in Canada – while accompanying another permanent resident – if the permanent \nresident they are accompanying meets the prescribed conditions as specified in A28(2)(a)(iv); \nand that permanent resident is in compliance with their own residency obligation. \nR1(1) defines “common-law partner” to mean, in relation to a person, an individual who is \ncohabiting with the person in a conjugal relationship, having so cohabited for a period of at \nleast one year. R1(2) provides “Interpretation – common-law partner.” \nSpouse is not defined in the Immigration and Refugee Protection Act. \nSPOUSE, as defined by the Merriam-Webster’s on-line Collegiate Dictionary, means a married \nperson: to be precise, [HUSBAND], [WIFE]. \nFor the purposes of A28(2)(a)(ii) and (iv), R61(6) defines a “child” as being a child of a \nparent referred to in those subparagraphs, who has not and has never been a spouse or \ncommon- law partner and is less than 22 years of age. \nNote: The provisions respecting the age of a “child” apply equally to both permanent resident \nchildren of Canadian citizens and permanent resident children of permanent residents. \n7.7 Humanitarian and compassionate determinations \nA28 provisions require the consideration of humanitarian and compassionate factors before \nmaking a determination that may lead to a loss of permanent resident status. \nSpecifically, A28(2)(c) provides that when an officer determines that humanitarian and \ncompassionate considerations relating to a permanent resident justify the retention of \npermanent resident status, then such a determination will overcome any breach of the \nresidency obligation made before the determination. \nAccordingly, each decision-maker involved in a residency obligation determination case \nshould, as part of the decision-making process, assess any humanitarian and compassionate \nfactors brought to their attention to determine whether such factors justify retention of \npermanent resident status, notwithstanding a breach of A28. \nNote: The best interests of a child directly affected by the determination must also be \nconsidered when assessing humanitarian and compassionate factors; and as a result, may \njustify the retention of permanent resident status. \nOfficers should consider whether sufficient humanitarian and compassionate factors have \nbeen brought to an officer’s attention to justify the retention of permanent resident status\nENF 23 Loss of permanent resident status \n2015-01-23 \n \n27 \nbefore making a decision that there has been a failure to comply with the residency \nobligation. Officers should remember that the onus is on the permanent resident to satisfy an \nofficer that there are grounds to justify retention of status. Officers are not required to satisfy \nthe permanent resident that such grounds do not exist. Officers should consider the \nobjectives of the Act and that paragraph A28(2)(c) exists to allow flexibility for approving \ndeserving cases not anticipated in the legislation. \nFor more information within this section, see: \n \nHumanitarian and compassion (H&C) grounds; \n \nUnusual and undeserved hardship; \n \nDisproportionate hardship; \n \nFactors for consideration; \n \nEffects of the Supreme Court of Canada decision in Baker v. M.C.I. \nHumanitarian and compassionate (H&C) grounds \nA28(2)(c) provides the flexibility for allowing the retention of permanent resident status, in \ndeserving cases, under circumstances that were not anticipated in the legislation. \nA positive decision on retaining permanent resident status, based on humanitarian and \ncompassionate grounds, is an exceptional response to a particular set of circumstances. \nAn examination of humanitarian and compassionate factors includes an evaluation of reasons \ngiven and supporting evidence of events and circumstances that have occurred in the five-\nyear period immediately preceding an examination. \nWhile “intent” is no longer the determinative factor that it was under the previous act, the \napplicant’s intent can be taken into consideration as an element of humanitarian and \ncompassionate assessment. \nThe permanent resident bears the onus of satisfying the decision-maker that there are \ncompelling H&C factors in their individual circumstances that justify retention of permanent \nresident status. \nThe permanent resident also bears the onus of explaining why they were not able to comply \nwith the residency obligation and the extent of any hardship that the loss of permanent \nresident status may cause to the individual or family members who would be directly affected \nby the decision. The resulting hardship from loss of status may be unusual and undeserved, \nor disproportionate. \nThe following definitions are not meant as “absolute rules;” rather, they are an attempt to \nprovide guidance to decision-makers when they exercise their discretion in determining \nwhether sufficient H&C considerations exist to justify the retention of permanent resident \nstatus. \nUnusual and undeserved hardship\nENF 23 Loss of permanent resident status \n2015-01-23 \n \n28 \nThe hardship (of losing permanent resident status) that the permanent resident would face \nshould be, in most cases, unusual. In other words, a hardship not anticipated by the Act; and \nthis hardship should be, in most cases, the result of circumstances beyond the permanent \nresident’s control. \nDisproportionate hardship \nHumanitarian and compassionate grounds may exist in cases that would not meet the \n“unusual and undeserved” criteria but would be met where the hardship would have a \ndisproportionate impact on the permanent resident due to personal circumstances. \nMinors who left in order to accompany parents \nUnder the former Immigration Act, if a child under 18 years of age left Canada with their \nparents and, after becoming an adult, sought to re-enter Canada as a permanent resident, \njurisprudence dictated that the person could not have formed the intent to abandon Canada \nas a child and therefore retained permanent resident status. \nIn IRPA, intent to abandon is no longer the test for retaining permanent resident status. \nTherefore, the inability to form “intent” no longer results in automatic retention of permanent \nresident status. The new test requires that humanitarian and compassionate considerations \nbe taken into account. Although the reasons for leaving and remaining outside Canada may \nbe considerations, the fact that a minor did not have the intention to abandon Canada or left \nas a dependent is not determinative. \nFactors for consideration \nThe range of factors to be considered can not be restricted by these guidelines. Officers are \nobliged to consider all the information presented by a permanent resident. \nHumanitarian and compassionate factors must be reviewed on a case by case basis. \nPermanent residents are free to make submissions on any aspect of their personal \ncircumstances that they feel would warrant retention of their permanent resident status. \nThe following are examples of the kinds of factors or combinations of factors that an officer \nmight consider in determining whether humanitarian and compassionate grounds justify the \nretention of permanent resident status. Officers are to examine circumstances and events \nthat occurred in the last five-year period which led to the permanent resident’s breach of the \nresidency obligation. As required byA28(2)(c), officers are also to take into account the best \ninterests of a child directly affected by the determination and the degree of hardship that may \nbe caused because of a loss of permanent resident status. \nExamples of factors to weigh and consider: \n \nExtent of non-compliance\nENF 23 Loss of permanent resident status \n2015-01-23 \n \n29 \no \nHow many “days of physical presence in Canada” within the five-year period \nunder examination, has the permanent resident spent in Canada? \no \nWas the permanent resident outside of Canada for more than three years in the \nlast five-year period because of a medical condition or the medical condition of a \nclose family member? \no \nCould alternative arrangements for the care of the family member have been \nmade or was it the permanent resident’s choice to remain outside Canada? \no \nCircumstances beyond the permanent resident’s control: Are the circumstances \nthat led to the permanent resident remaining outside of Canada compelling and \nbeyond their control? \no \nWas the permanent resident prevented from returning to Canada; and if so, by \nwhom and by what event? \no \nIs the permanent resident now returning to Canada at the earliest possible \nopportunity? \no \nDid the permanent resident leave Canada as a child accompanying a parent? \no \nIs the permanent resident who left as a dependent child or family member \nreturning at the earliest opportunity? \no \nIs the permanent resident dependent on the parent they are accompanying \nbecause of a mental or physical disability? \n \nEstablishment in and outside Canada: \no \nIs the permanent resident a citizen or permanent resident of a country other than \nCanada? \no \nHas the permanent resident taken steps to establish any permanence in a \ncountry other than Canada; or the country they resided in immediately before \nbecoming a permanent resident of Canada (that is, any third country status)? \no \nTo what degree has the permanent resident established in Canada? \no \nWhat linkages and ties has the permanent resident maintained in Canada? \n \nPresence and degree of consequential hardship: \no \nA loss of permanent resident status will have the consequence of either having to \nvoluntarily leave or be removed from Canada. The removal of a status-less \nperson may have an impact on family members who do have the legal right to \nremain in Canada (for example, Canadian citizens and/or permanent residents). \nOfficers should consider the person’s degree of hardship in relation to personal \ncircumstances (that is, impact on family members, especially children). \nEffects of the Supreme Court of Canada decision in Baker v. M.C.I.: \nAlthough the “Baker case” did not specifically concern an appeal based on an A28 residency \nobligation determination, it does pertain to administative law principles and how humanitarian \nand compassionate factors are to be applied and given consideration. \nOfficers involved in assessing humanitarian and compassionate factors are therefore to \nremain cognizant of the issues that were raised in the “Baker case” and the resultant \n“Summary of issues and impact on Citizenship and Immigration Canada (CIC)” as outlined \nin Appendix A, Supreme Court of Canada decision in BAKER v. M.C.I.\nENF 23 Loss of permanent resident status \n2015-01-23 \n \n30 \nSee also Appendix B, “Strengthening decisions/ Guidelines on taking notes;” and the manual \nsection entitled “Principles of administrative law” contained within IP 5, Immigrant \napplications in Canada made on humanitarian or compassionate grounds. \nOnus rests with the permanent resident \nAs indicated throughout this manual chapter, the onus rests with the permanent resident to \nprovide the necessary information and evidence to satisfy an officer that they are in \ncompliance with the legislation. An officer, when deciding whether a permanent resident \ncomplies with A28(2)(a)(iv), may address, inter alia, the following factors: \n \nwhether the permanent resident is a bona fide spouse or common-law partner or child of \nthe person they are accompanying abroad; \n \nwhether the permanent resident normally resides with the person they are accompanying \nabroad; \n \nwhether the person the permanent resident is accompanying is a Canadian citizen or a \npermanent resident of Canada; and \n \nif the person concerned is accompanying a permanent resident, whether that permanent \nresident is in compliance with their own residency obligation. \nDocumentation and information presented by a permanent resident that may be considered \nby an officer may include, inter alia: a marriage license; a child’s birth certificate or baptismal \ndocument; adoption or guardianship documents; school and/or employment records; passport \nand/or other travel documents or documentation; employment letters; such other \ndocumentation from a permanent resident being accompanied – as considered necessary by \nan officer - to confirm that the permanent resident being accompanied is in compliance with \ntheir own residency obligation. \nNote: The above list is not meant to be all encompassing nor exhaustive. Officers may ask \npermanent residents to provide such documentation, as an officer deems necessary in the \ncircumstances, to allow for a determination to be made with respect to the residency \nobligation provision of the Immigration and Refugee Protection Act. \nThe effect of a recently made favourable humanitarian and \ncompassionate decision \nOfficers will sometimes make residency determinations for permanent residents who were the \nsubject of favourable decisions under A28(2)(c) for humanitarian and compassionate reasons \nin the recent past, either by an officer or the Immigration Appeal Division of the IRB. In this \nsituation, officers are required to exercise their statutory authority and render independent \ndecisions. However, officers should be mindful that the intent of the legislation was to enable \npersons to retain permanent resident status where it is determined that, having regard to all \ncircumstances, retention of status is warranted. Therefore, unless circumstances have \nchanged significantly or new information is available, it would not be consistent with the \nintent of the legislation for these clients to receive a negative determination.\nENF 23 Loss of permanent resident status \n2015-01-23 \n \n31 \n7.8 Examining permanent residents at a POE \nWhen a permanent resident appears at a POE for examination, the officer must confirm that \nthe person is a permanent resident. Officers must remain cognizant of the fact that the Act \ngives permanent residents of Canada the right to enter Canada at a port of entry once it is \nestablished that a person is a permanent resident, regardless of non-compliance with the \nresidency obligation in A28 or the presence of other grounds of inadmissibility. \nPort of entry (POE) officers can refuse entry to a permanent resident only when the person \nhas already lost the status in accordance with the provisions of A46 (such as when a final \ndetermination has been made that they have failed to comply with the residency obligations \nor when a removal order comes into force). In other words, once a permanent resident’s \nstatus is established, the person may enter Canada by right and the immigration examination \nunder IRPA concludes. \nIf an officer has concerns that a permanent resident has not complied with the residency \nobligation ofA28, the officer should advise the permanent resident when the examination is \nconcluded that they are authorized to enter Canada; however the permanent resident may \nwish to answer additional questions so the officer may determine whether their concerns are \nwell founded or not. \nIn cases where: \n \npermanent resident status is established; \n \nthe permanent resident refuses to provide any further information and enters Canada; \nand \n \nthe officer believes, on a balance of probabilities that the person is in non-compliance \nwith the residency obligation, \nofficers may report the person, pursuant to A44(1). if there is sufficient evidence to support \nan inadmissibility allegation. In the absence of sufficient evidence to support the writing of an \ninadmissibility report, officers may enter any available information into FOSS (date of entry, \nlast country of embarkation, current address in Canada etc.). \n7.9 Voluntary relinquishment of permanent resident status under the \nformer Immigration Act, 1976 \nWhere a person signed an IMM 1342B under the former IA, the person may be treated as a \nforeign national, if: \n \nthey formally signed a document [usually an IMM 1342B - Confiscated or Voluntarily \nSurrendered (IMM 1000B) form] voluntarily declaring abandonment of Canada as his/her \nplace of permanent residence(this is normally indicated by FOSS NCB code “10” : vol \nrelinq of status); \n \nthey are now seeking to enter or remain in Canada as a temporary resident; and\nENF 23 Loss of permanent resident status \n2015-01-23 \n \n32 \n \nthey acknowledge that in signing the IMM 1342B, they were relinquishing permanent \nresident status. This should be recorded in the officer’s notes and retained on the file. \nIf all of the above conditions are met, the officer may treat the person as a foreign national. \nWhere a person maintains they signed an IMM 1342B and there is no record in FOSS or no \npaper documentation to support their claim, an officer should conduct a determination on the \nresidency obligation under A28 or follow the procedures for voluntary relinquishment below if \napplicable. \nAll other persons who were landed under the former IA and who did not lose their status \npursuant to A24(1)(b) of the former IA as a result of a removal order should be treated as \npermanent residents under IRPA, subject to the residency obligation stated in A28. \n7.10 Voluntary relinquishment of permanent resident status under \nIRPA \nThe following section provides guidance on the procedures to follow in the limited \ncircumstances when a permanent resident may be allowed to relinquish status voluntarily. \nPerson applying to enter or remain in Canada as a temporary resident \nand who does not meet the residency obligation \nAs mentioned above, the officer shall first determine if the person is a permanent resident or \nnot. In the event that the person does not meet the residency obligations (A28) but still \nwishes to enter as a foreign national, and the person clearly states the intention of \nrelinquishing permanent resident status, the officer may proceed with the writing of the \nreport under A44(1), using the guidelines below. \nA44(1) report and voluntary relinquishment \nWhere a person does not meet the residency obligation, an A44(1) report should be \nprepared A41(b) for A28. Once a report is prepared, the provisions of R62(1)(a) take effect so \nthat any time spent in Canada subsequent to the report will not count as days towards the \nresidency obligation under paragraph A28(2) in the event the person rescinds their \ndeclaration within 30 days. \nProvided the person has made it clear from the beginning and throughout the examination \nthat they are only interested in temporary resident status, and the person truly and \nvoluntarily wishes to relinquish status, the officer may allow the person to complete \nform IMM 5538B – Declaration: Voluntary relinquishment of permanent resident status. A \ncopy of the IMM 5538B should be sent to the Query Response Centre (QRC) to be stored on \nmicrofiche. This procedure is not to be used in any situation where the person indicates at \nany time a desire to be considered a permanent resident, even if they subsequently maintain \nthey no longer wish to be a permanent resident.\nENF 23 Loss of permanent resident status \n2015-01-23 \n \n33 \nThe officer must first determine if the person has fulfilled the residency obligation (A28). Once \nthe officer has established that the person does not meet the residency obligation, the officer \nallows the person the opportunity to make submissions on humanitarian and compassionate \nconsiderations, which may lead the officer to determine that the person remains a permanent \nresident despite non-compliance with the residency obligation. If the person declines to \nproduce any evidence of compliance, if the person does not wish to make submissions on \nhumanitarian and compassionate grounds at the time of the examination, or if the person’s \nsubmissions are not sufficient to overcome the officer’s decision that the person has not \nfulfilled the residency obligation, then the officer may allow the person to sign a voluntary \nrelinquishment. \nThe officer must personally provide counselling to the person on the significance of the \ndeclaration and should ensure that the person fully comprehends the content of the \ndeclaration. The officer should further counsel the person to ensure that they understand that \nif they withdraw the declaration within 30 days, a departure order may be issued and they \nwould have a right to appeal that order. \nDuring counselling, the officer must provide, in writing, the full CIC address where the person \nis to send the notice to withdraw relinquishment of permanent resident status. The officer \nmust clearly note on file that the person did not wish to produce or produced insufficient \nevidence or submissions to allow the officer to conclude that the person satisfies A28, despite \nnon-compliance with residency obligations. Details of the evaluation of humanitarian and \ncompassionate grounds can be found in section 7.7 above. \nOnce the A44(1) report and the IMM 5538B are completed, they must be given to the \nMinister’s delegate for review. The Minister’s delegate may either dispose of the A44(1) report \nat that time by coding the disposition “14” (no further action) or, alternatively, the Minister’s \ndelegate may hold the report in abeyance for final disposition for a period of 37 days (30 days \nduring which the person may withdraw the IMM 5538B declaration, plus 7 days for delivery). \nIf the 37 days pass without a withdrawal, the report may then be disposed of with code “14” \n(no further action). \nIn either case, the Minister’s delegate must keep in mind that if the person were to withdraw \ntheir declaration relinquishing status, a removal order should be issued. Therefore, the \nMinister’s delegate’s notes on file should clearly demonstrate that the person was duly \ninformed that a removal order could be issued against them in the event of a determination of \npermanent residency status due to withdrawal of the declaration of relinquishment. \nEssentially, the Minister’s delegate should record in their notes that it is their decision that, \nbased on the information available at the time of the review of the A44(1) report, such an \norder is to be issued if the person should withdraw their declaration within the 30 days during \nwhich this is allowed. \nAn NCB with code “10” for relinquishment of status is to be entered at the time of entering \nthe A44(1) report disposition.\nENF 23 Loss of permanent resident status \n2015-01-23 \n \n34 \nWithdrawal of IMM 5538B – Declaration—Voluntary relinquishment of \npermanent resident status \nIf the person subsequently withdraws the voluntary relinquishment within the 30-day period, \nthey have already been given the opportunity to make humanitarian and compassionate \nsubmissions. Therefore, any additional evidence relating to the residency obligation and \nhumanitarian and compassionate considerations A28(2)(c); Section 7.7 above] must be \nconsidered by the Minister’s delegate before it is determined that the report remains well \nfounded and before proceeding to issue a departure order. File notes should reflect that the \nconsiderations of A28(2) were assessed before the final decision. Consequently, the Minister’s \ndelegate is to review the file as if the person had refused to sign a voluntary relinquishment \nat the original determination in which the officer had determined a non-compliance to the \nresidency obligation. \nIf no additional information is received with the notice of withdrawal of the declaration, then \nthe Minister’s delegate should refer to the officer’s original notes and decision of non-\ncompliance. Consequently, the A44(1) report should be reviewed and the Minister’s delegate \nenters in FOSS the disposition of a removal order. The Minister’s delegate shall issue said \nremoval order and send a copy to the person. The person must be advised that it is possible \nto appeal the removal order. If, at the initial examination which led to the relinquishment, an \nA44(1) report was prepared by the examining officer but the MD disposition was “no further \naction”, the Minister’s delegate should amend this report and change the MD disposition to \nreflect the appropriate removal order. \nAs long as the officer’s examination and notes are thorough and complete, there is no need to \nsend a further invitation to the person for submissions for the consideration humanitarian and \ncompassionate grounds since the person has already been given a full opportunity to make \nsuch submissions to the officer prior to being allowed to sign the declaration of voluntary \nrelinquishment. \nIf the client withdraws the declaration at a CIC other than the initial POE where the person \nsigned the declaration, the CIC that received the withdrawal notice shall ensure that they \nhave the person’s complete address, and that they send a copy of the withdrawal and any \nsubmissions regarding residency obligations and humanitarian and compassionate \nconsiderations to the Minister’s delegate who reviewed the report at the intial POE. The \nMinister’s delegate will issue a decision and inform the client. \nIn the event that the person has left Canada and sends the notice to withdraw the voluntary \nrelinquishment to a Canadian visa office abroad, the officer at the visa office shall clearly note \nthis in FOSS by entering and NCB “code 01: watch for” and shall put in all relevant notes and \nobservations stating that the person has given notice of withdrawal of voluntarily \nrelinquishment. Furthermore, the visa office shall advise the Minister’s delegate (who received \nthe initial report and entered the disposition of no further action) of the notice of withdrawal \nby the person at a visa office abroad. These procedures will allow the next POE officer in front \nof whom this person arrives to understand the circumstances that led to the writing of a \nreport under A44(1) for non-compliance of the residency obligations, but for which no\nENF 23 Loss of permanent resident status \n2015-01-23 \n \n35 \nremoval order was issued, since such an order cannot be issued while the permanent resident \nis abroad and counselling regarding the appeals rights cannot be given. \nWhere a copy of the IMM 5538B has already been forwarded to QRC, the Minister’s delegate \nis responsible for informing QRC of the withdrawal and returning it to the local file. \nPerson satisfies the residency obligation in A28 but wishes to relinquish \nstatus for other reasons \nAs mentioned in section 5 above, in exceptional circumstances, a person may be allowed to \nvoluntarily relinquish their status, despite satisfying the residency obligation in A28, for the \nfollowing reasons: \n \nthey have to relinquish permanent resident status in order to accept employment for a \nforeign government, including a diplomatic posting; or \n \nit is necessary in order to qualify for status in another country. \nWhen a person approaches CIC and requests to relinquish their status, they may be allowed \nto complete the IMM 5539B (Declaration: Relinquishment of Permanent Resident \nStatus/Residency Obligation Met) provided they are truly voluntarily relinquishing their status \nand fully understand the consequences. The person can then be treated as a foreign national. \nA copy of the IMM 5539B should be sent to the QRC to be stored on microfiche. \nOfficers should always conduct an interview in person when accepting voluntary \nrelinquishment of permanent resident status. This procedure is not to be used in lieu of \ncompleting a residency obligation determination for persons who might satisfy the residency \nobligation in A28 and where they are only seeking to come to Canada temporarily. \n7.11 Recording determination of obligations under A28 \nAt visa posts, all determinations made under A28 are to be recorded in CAIPS. At POE and \ninland CIC offices, all decisions are to be entered in FOSS as FDE – PR - PERMANENT \nRESIDENT DETERMINATION. \n7.12 Certificate of departure (IMM 0056B) when an order is not yet in \nforce \nIf a negative determination under A28 is made and a removal order has been issued, the loss \nof status becomes effective upon completion of the appeal period of 30 days if no appeal is \nmade. \nIf the person wishes to leave Canada before the order comes into force \nunder A49(1)(b) (prior to the 30-day appeal period), the following steps should be taken:\nENF 23 Loss of permanent resident status \n2015-01-23 \n \n36 \n \nThe officer must ensure that the person concerned is aware of the fact that the removal \norder is not yet in force and understands the implications. The officer should obtain a \nstatutory declaration indicating that the person concerned understands and declares the \nfollowing: \no \nthe officer has made a negative determination on their permanent resident \nstatus; \no \nthe criteria for this determination (A28); \no \nthey agree with the officer's conclusions; \no \nthey are aware of their right to appeal this decision to the IAD; \no \nthey have no intention to appeal the decision. (A sample statutory declaration is \nfound in Appendix C.) \n \nThe officer should obtain an address or facsimile number for serving the Certificate of \nDeparture (IMM 0056B) which will be completed and sent to the person concerned once \nthe removal order becomes enforceable after the expiration of the 30-day appeal period \nunder A49(1)(b). The person concerned will not have signed the IMM 0056B as they will \nhave left Canada prior to their order becoming enforceable. If the officer obtains a \nstatutory declaration, the address or facsimile number for service could be noted in the \ndeclaration. \n \nThe officer should ensure that an NCB in FOSS contains detailed notes explaining the \ncircumstances. FOSS notes should indicate: \no \nthat the person wanted to leave Canada voluntarily; \no \ntheir reasons for leaving; \no \nwhether a statutory declaration was obtained; \no \nwhether the statutory declaration was translated; \no \nwhere and when the IMM 0056B should be sent. \n \nThe officer should follow up the case and mail or fax the IMM 0056B to the address or fax \nnumber provided by the person concerned after the removal order has come into force \nunder A49(1)(b). \n \nShould the person return to Canada before the end of the period, the Certificate of \nDeparture (IMM 0056B) should not be issued and the order comes into force at the end \nof the appeal period. \n7.13 Permanent Resident Cards \nThe IRPA provides that permanent residents of Canada shall be issued with a document \nindicating their status (A31). \nThe Regulations define the term “status document,” by designating the permanent resident \ncard as the document issued to permanent residents to indicate their status under the IRPA \n(R53). \nThe requirement in A31(1) to provide permanent residents and protected persons with a \ndocument indicating their status is new in immigration law, as is the presumption that a \nperson in possession of such a document is a permanent resident, unless an officer \ndetermines otherwise.\nENF 23 Loss of permanent resident status \n2015-01-23 \n \n37 \nAlso new is the presumption that a person outside Canada, and who is not in possession of a \npermanent resident document, is presumed not to have permanent resident status A31(2)(b). \nOfficers should note that although the absence of a card creates a presumption that a person \nis not a permanent resident, officers should still complete an assessment to determine if the \nperson concerned has the requisite number of “days present in Canada” that would justify \nretention of permanent resident status. \nUnder the previous Act, the Department provided permanent residents with proof of landing \nin the form of an immigrant visa and “Record of Landing” (form: IMM 1000B). Legally, the \nIMM 1000B served only as evidence of the fact of landing (that is, lawful permission to live in \nCanada permanently), as possession of a “Record of Landing” was not regarded as \npresumptive proof of status. \nPermanent resident cards will be provided or issued in Canada (R55); they will not be \nprovided or issued outside of Canada. \nPermanent residents outside Canada, who are not in possession of a status document, may \nbe issued a travel document under the provisions of A31(3). An A31(3) travel document \nserves as a temporary travel document for permanent residents outside Canada who are \nwithout a permanent resident card and require a document to allow for travel back to Canada. \nOfficers should revoke permanent resident cards under the following \ncircumstances: \n \nThe permanent resident becomes a Canadian citizen A46(1)(a)/R60(a); \n \nUnder A46(1)(b), on “final determination” of a decision made outside Canada that a \npermanent resident has lost their permanent resident status for failing to comply with \nthe residency obligation under A28; \n \nWhen a removal order made against the holder of a permanent resident card comes into \nforce A46(1)(c); \n \nA final determination under A109, where the Refugee Protection Division (RPD) of the \nImmigration and Refugee Board (IRB) has vacated a person’s protected status; \n \nA final determination under A114(3), where a pre-removal risk assessment has vacated a \nperson’s protected status. \nSee also ENF 1, Inadmissibility; and ENF 27, Permanent Resident Cards. \n8 Overview: A31(3) travel documents; IAD processes; overseas \ndecisions and their effect at a POE \n8.1 A31(3) Travel documents \nAn officer outside Canada may issue a travel document in four circumstances:\nENF 23 Loss of permanent resident status \n2015-01-23 \n \n38 \n1. After an examination, an officer overseas determines that a permanent resident has \ncomplied with the residency obligation under A28. The permanent resident has lost or is \notherwise unable to use their IMM 1000B for travel back to Canada before December 31, \n2003 and the permanent resident is not in possession of a permanent resident card \n[A31(3)(a)]. \n2. After an examination, an officer overseas determines that a permanent resident has \nfailed to comply with the residency obligation under A28. The officer, however, has \ndetermined that the humanitarian and compassionate (H&C) factors overcome the \nbreach of the residency obligation and justify the retention of permanent resident status \nA31(3)(b). \n3. After an examination, an officer overseas has arrived at a decision that a permanent \nresident has failed to comply with the residency obligation under A28. The permanent \nresident is not in possession of a permanent resident card. The officer is satisfied that the \npermanent resident was physically present in Canada at least once within the 365 days \nbefore the examination. An appeal to the Immigration Appeal Division (IAD) filed \nunder A63(4) has not been finally determined or the period for making such an appeal \nhas not yet expired A31(3)(c). \nNote: IAD Rule 12 – In the case of a permanent resident who wants to appeal a \ndecision made outside Canada concerning the residency obligation, the IAD must \nreceive the notice of appeal no later than 60 days after the appellant received the \nwritten reasons for the decision. \n4. After an examination, an officer overseas has arrived at a decision that a permanent \nresident has failed to comply with the residency obligation under A28. The permanent \nresident is not in possession of a permanent resident card. The officer is not satisfied that \nthe permanent resident was physically present in Canada at least once within the 365 \ndays before the examination. The permanent resident has filed an appeal with the \nImmigration Appeal Division (IAD) [under A63(4)], within the prescribed time period, \nand the IAD has ordered the presence of the permanent resident in Canada to attend at \ntheir appeal hearing A175(2). \nFurther, on item No. 4 above, and pursuant to A175(2), when an appellant is not eligible for a \ntravel document under A31(3), they must make an application to the IAD requesting that \nthey be allowed to return to Canada for their hearing [IAD Rule 46(1)]. Applications must be \nfiled with the IAD and the Minister no later than 60 days after the notice of appeal is filed. \nIf the IAD is satisfied that the presence of the permanent resident at the hearing is \nnecessary, they will order that the permanent resident physically appear at the hearing. \nWhere the IAD has ordered that the appellant be physically present, an officer shall issue a \ntravel document for that purpose pursuant toA175(2). \nIt is to be noted that, regarding the validity period of an A31(3) travel document, this will be \nset by the officer overseas approving the case. Generally, the validity of an A31(3) travel\nENF 23 Loss of permanent resident status \n2015-01-23 \n \n39 \ndocument will be short; for example, between 1-3 months range. However, it is also \nrecognized that there might be good reason for the validity period to be longer. \nAccordingly, the Computer Assisted Immigration Processing System (CAIPS) will not prevent \nlonger periods of validity if an officer overseas deems same warranted. Notwithstanding this, \nofficers should remain cognizant that the purpose of the A31(3) travel document is to \nfacilitate travel to Canada; it is not intended to serve as a document to guarantee \nthe ability of a permanent resident to return to Canada for an extended period in the \nfuture. \n8.2 IAD appeal requirements \nPermanent residents may appeal to the Immigration Appeal Division (IAD) against a decision \nmade outside Canada on the residency obligation under A28 [A63(4)] \nIAD Rule 9 requires: \n \nThat the notice of appeal be filed with the Immigration and Refugee Board (IRB) registry \noffice for the region in Canada where the appellant last resided; \n \nThe written reasons for the residency obligation - non-compliance decision must be filed \nwith the notice of appeal; \n \nIf the appellant wants to return to Canada for the hearing of the appeal, they must \nindicate it on the notice of appeal; \n \nAppellants have 60 days after they receive the written reasons for the decision to file a \nnotice of appeal and the written reasons with the IRB registry office. \nIt is important to note that a permanent resident does not lose their status \nunder A46(1)(b) until there is a \"final determination\" of the decision made outside Canada \nthat they have failed to comply with the residency obligation under A28. Permanent residents \nare not “finally determined” to have lost their permanent resident status until the right of \nappeal has been exhausted. \nNote: If a permanent resident does not submit an appeal to the Immigration Appeal Division \n(IAD) within the time period allowed for the filing of such an appeal (relating to permanent \nresidents who want to appeal a decision made outside Canada that they have failed to comply \nwith the residency obligation under A28), then the decision made outside Canada will become \na final determination, in accordance with A46(1)(b), once the time period for filing such an \nappeal has expired. Officers overseas will inform permanent residents of this information by \nway of a “residency determination – refusal letter.” \nNote: The consequence of this determination will be that the permanent resident loses their \npermanent resident status and will no longer be considered a permanent resident of Canada. \nFurthermore, they will no longer be accorded any of the rights of a permanent resident of \nCanada, including the right of entry as provided for in A19(2) of the Immigration and Refugee \nProtection Act. \nSee also OP 10, Permanent residency status determination.\nENF 23 Loss of permanent resident status \n2015-01-23 \n \n40 \n8.3 Decisions made overseas on loss of PR status and their effect at a \nPort of Entry \nIf an overseas A28 non-compliance decision has been made, then a record of it should exist in \nthe Field Operational Support System (FOSS). \nThis is because the officer overseas will have completed a “Permanent Resident \nDetermination” input screen on the Computer Assisted Immigration Processing System \n(CAIPS). As CAIPS information is routinely uploaded to FOSS, this will effectively give officers \nthe information they require on matters relating to an overseas A28 non-compliance decision. \nIt is important to note that it will not be necessary for POE officers to \nwrite A44(1) inadmissibility reports on permanent residents who arrive at the POE and have \nbeen determined outside Canada to have failed to comply with the residency obligation under \nA28. This is because under A69(3), the Immigration Appeal Division (IAD) has the authority \nto make a removal order, without need of an A44(1) inadmissibility report, where \nan A63(4) appeal is dismissed and the permanent resident is in Canada. \nIt should be noted that in A31(3)(c) travel document cases, a permanent resident will have \n60 days to file a notice of appeal with the Immigration Appeal Division (IAD Rule 9). This \nmeans that some holders of A31(3) travel documents (and some IMM 1000B holders, at least \nuntil 31 December 2003) may well arrive at a port of entry without having yet filed their \nnotice to appeal. \nTherefore, in all cases involving an overseas A28 non-compliance decision, the approach to be \nmaintained is that POE officers will conduct a Field Operational Support System (FOSS) query \nto check and confirm the status of the permanent resident’s appeal notification; also, to \nconfirm that the permanent resident is still within the 60-day time period within which an \nappeal may be filed. \nIf the 60-\nday appeal \nperiod \nhas/has \nnot \nelapsed: \nThe officer will: \nNote: \nIf the 60-\nday appeal \nperiod has \nelapsed \nInform the person of the fact and advise \nthem that they no longer hold \npermanent resident status. \nThis is due to the fact that if a \npermanent resident does not submit an \nappeal to the Immigration Appeal \nDivision (IAD) within the time period \nallowed for the filing of such an appeal \n(relating to permanent residents who \nPermanent residents who arrive at \nthe POE, and have been determined \noutside Canada to have failed to \ncomply with the residency obligation \nunder A28, will generally know of \nthis “loss of status” information \nalready as overseas officers make \nmention of this in their “residency\nENF 23 Loss of permanent resident status \n2015-01-23 \n \n41 \nwant to appeal a decision made outside \nCanada that they have failed to comply \nwith the residency obligation \nunder A28), then the decision made \noutside Canada will become a final \ndetermination, in accordance \nwith A46(1)(b), once the time period for \nfiling an appeal has expired. \nConsequently, such persons will be \nconsidered foreign nationals whether at \na port of entry or inland. \nSee also OP 10. \ndetermination refusal letter.” \nIf the 60-\nday appeal \nperiod has \nnot elapsed \n1. allow the permanent resident to enter \nCanada during the 60-day appeal \nperiod, even if the permanent resident \nhas not yet filed their notice of appeal. \n2. confirm, in FOSS, the date the \npermanent resident was the recipient of \na decision made outside Canada that \nthey had not complied with the \nresidency obligation under A28; \n3. update FOSS, if known, with either \nan address or a contact address in \nCanada where the permanent resident \nmay be contacted for all matters \nrelating to their IAD hearing. \n4. Notify the appropriate Hearings office \nof the permanent residents arrival, and \nconvey address/ contact information, if \navailable. \nHearings offices should monitor the file \nfrom then on to determine if a notice of \nappeal is filed. When a notice of appeal \nis received, the Hearings office will:  \n(a) ensure that the FOSS and NCMS \nAppeals screens are completed \npromptly; and  \n(b) enter any motions or applications \nassociated with the appeal in the FOSS \nMotions screen. \nIf an appeal is not filed within the 60-\nday period allowed for the filing of an \nappeal, FOSS is to be updated by the \nHearings office with appropriate \nremarks; and the case file referred to \nthe appropriate Investigations office for \nfollow-up and investigation to locate the\nENF 23 Loss of permanent resident status \n2015-01-23 \n \n42 \nperson. \nFailure to appear at an appeal hearing \nIf an appellant fails to appear for their appeal, Hearings officers should ask the Immigration \nAppeal Division (IAD) to dismiss the appeal. Where an appellant was determined to have \nfailed to comply with the residency obligation outside of Canada, Hearings officers should ask \nthat the IAD issue the appropriate removal order in absentia. It is extremely important, from \nthe standpoint of program integrity, that appeals not be declared abandoned in cases where \npersons have returned to Canada and fail to appear for their appeal. Hearings officers should \nmaintain a position such that the issuance of a removal order is preferable to having the \nappeal declared abandoned. \nDismissed appeals – type of removal order \nA69(3) requires that if the Immigration Appeal Division (IAD) dismisses an appeal made \nunder A63(4), and the permanent resident is in Canada, it shall make a removal order. \nThe Immigration and Refugee Protection Act does not specify what type of removal order \nshould be issued by the IAD. For that reason, Hearings officers should request that the IAD \nissue a departure order (for failure to comply with the residency obligation) so as to ensure \nconsistency with “in Canada” determinations involving failure to comply with the residency \nobligation. \nSee also ENF 19. \n9 In-Canada procedures pertaining to A44(1) reports: Reports \non permanent residents and persons claiming to be permanent \nresidents \nWhere an officer concludes that a person who claims to be a permanent resident is not a \npermanent resident, or has lost their permanent resident status, and for that reason decides \nto report the person under the provisions of A44(1), the officer – depending on the \ncircumstances – shall cite as grounds for the report, either: \n(a) that the person is a permanent resident in Canada who is, in the officer’s opinion, \ninadmissible pursuant to A41(b) because the person failed to comply with the residency \nobligation of A28; or \n(b) in the case of a person who is unable to present any evidence of permanent resident \nstatus, that the person is a foreign national in Canada who has not been authorized to enter \nand who is, in the officer’s opinion, inadmissible pursuant to A41(a) because the person has \nfailed to comply with a requirement of the Act; specifically, the requirement of A20(1)(a) that \nevery foreign national who seeks to enter or remain in Canada must establish, to become a\nENF 23 Loss of permanent resident status \n2015-01-23 \n \n43 \npermanent resident, that they hold the visa or other document required under the regulations \n. . . . \nThe A44(1) inadmissibility report should then be transmitted to a Minister’s delegate. \nFurthermore, the officer cannot seize the person’s documents, such as the Immigration Visa, \nConfirmation of Permanent Residence or Record of Landing (IMM1000), despite the writing of \nan A44(1) report and the issuance of a removal order unless the officer believes there are \nreasonable grounds to do so in accordance with A140. The rationale behind this is that the \nperson has a right to appeal the removal order and, until final determination of status, they \nremain a permanent resident and lawful owner of said documents. \nSee also ENF 1, ENF 2, ENF 5 and ENF 6.\nENF 23 Loss of permanent resident status \n2015-01-23 \n \n44 \nAppendix A Supreme Court of Canada decision in Baker v. \nM.C.I. [1999] 2 S.C.R. 817 \nSee also IP 5. \nThe following summarizes the issues and impact on Citizenship and Immigration Canada \n(CIC) as a result of the Supreme Court of Canada decision in the case of BAKER, an appeal \nagainst a negative decision on an application for permanent residence made in Canada on \nH&C grounds. \nCase details \n \nIn 1981, Ms. Baker came to Canada as a visitor. She worked illegally for the next \neleven years as a domestic worker. \n \nIn December 1992, a deportation order was issued against her for working illegally \nand overstaying visitor status. \n \nIn January 1993, an H&C application was submitted. Factors put forward included \nMs. Baker’s medical condition, lack of medical treatment in country of origin, and the \neffect of deportation on four Canadian-born children (born 1985; twins in 1989; \n1992). \n \nIn April 1994, Ms. Baker was advised of the negative H&C decision by letter stating \nthat there were insufficient H&C grounds to warrant processing from within Canada. \nAccording to procedures, no written reasons were given. \n \nUpon request by Ms. Baker’s counsel, the immigration officer’s notes were provided. \n \nIn May 1994, Ms. Baker was directed to report for removal in mid-June. \n \nIn June 1994, the Federal Court – Trial Division (FCTD) stayed the deportation order \npending disposition of an application for leave to commence judicial review. \n \nIn June 1995, the Federal Court – Trial Division (FCTD) dismissed the application for \njudicial review and certified one question: “Given that the Immigration Act does not \nexpressly incorporate the language of Canada’s international obligations with respect \nto the International Convention on the Rights of the Child, must federal immigration \nauthorities treat the best interests of the child as a primary consideration in \nassessing an applicant under s.114(2) of the Immigration Act?” \n \nIn November 1996, the Federal Court of Appeal dismissed the appeal from the Trial \nDivision and held that the question was not properly before the Court and that the \ncertified question be answered in the negative. \n \nIn November 1998, the appeal was heard before the Supreme Court of Canada. \n(Note: Once before the Supreme Court, there is no limitation to address only a \ncertified question. The Court may consider all aspects of an appeal lying within its \njurisdiction.) \n \nIn July 1999, the Supreme Court released the decision in the case of Baker. The appeal \nwas allowed on the grounds of violation of the principles of fairness owing to a \nreasonable apprehension of bias and because the exercise of discretion was\nENF 23 Loss of permanent resident status \n2015-01-23 \n \n45 \nunreasonable. The matter was returned to the Minister for redetermination by a different \nimmigration officer. \nCourt's reasons for deciding to return for redetermination \nThe following excerpts from the Court's decision explain some of the rationale for deciding to \nreturn the application for redetermination by another officer: \nThe notes of Officer L. in relation to the consideration of ‘‘H&C factors” reads as follows: \n“The PC is a paranoid schizophrenic and on welfare. She has no qualifications other than as \na domestic. She has FOUR CHILDREN IN JAMAICA AND ANOTHER FOUR BORN HERE. She \nwill, of course, be a tremendous strain on our social welfare systems for (probably) the \nrest of her life. There are no H&C factors other than her FOUR CANADIAN-BORN \nCHILDREN. So we let her stay because of that? I am of the opinion that Canada can no \nlonger afford this type of generosity.” \nIn my opinion, the approach taken to the children's interests shows that this decision was \nunreasonable in the sense contemplated in Southam, supra. The officer was completely \ndismissive of the interests of Ms. Baker's children. \nAs I will outline in detail in the paragraphs that follow, I believe that the failure to give serious \nweight and consideration to the interests of the children constitutes an unreasonable exercise \nof the decision conferred by the section, notwithstanding the important deference that should \nbe given to the decision of the immigration officer. \nProfessor Dyzenhaus has articulated the concept of 'deference as respect' as follows: \ndeference as respect requires not submission but a respectful attention to the reasons offered \nor which could be offered in support of a decision [D. Dyzenhaus, \"The Politics of Deference: \nJudicial Review and Democracy\", in M. Taggart, ed., The Province of Administrative Law \n(1997), 279, at p. 286]. \nThe reasons of the immigration officer show that his decision was inconsistent with the values \nunderlying the grant of discretion. They therefore cannot stand up to the somewhat probing \nexamination required by the standard of reasonableness. \nEmphasis on the rights, interests, and needs of children and special attention to childhood are \nimportant values that should be considered in reasonably interpreting the 'humanitarian' and \n'compassionate' considerations that guide the exercise of the discretion. \nI conclude that because the reasons for this decision do not indicate that it was made in a \nmanner which was alive, attentive, or sensitive to the interests of Ms. Baker's children, and \ndid not consider them as an important factor in making the decision, it was an unreasonable \nexercise of the power conferred by the legislation, and must, therefore, be overturned. \nIn addition, the reasons for decision failed to give sufficient weight or consideration to the \nhardship that a return to Jamaica might cause Ms. Baker, given the fact that she had been in\nENF 23 Loss of permanent resident status \n2015-01-23 \n \n46 \nCanada for 12 years, was ill and might not be able to obtain treatment in Jamaica, and would \nnecessarily be separated from at least some of her children. \nTherefore, both because there was a violation of the principles of procedural fairness owing to \na reasonable apprehension of bias, and because the exercise of the H&C discretion was \nunreasonable, I would allow this appeal. \nWhy the Baker decision was not upheld \nThe Court concluded that the officer’s decision in the case of Baker was unreasonable. \nThe officer’s notes pertaining to the Canadian-born children were completely dismissive of \ntheir interests or needs. Failure to give serious weight and consideration to the interests of \nthe children constituted an unreasonable exercise of discretion. \nSpecifically, the Court stated: “... the reasons for this decision do not indicate that it was \nmade in a manner which was alive, attentive, or sensitive to the interests of Ms. Baker’s \nchildren, and did not consider them as an important factor in making the decision ...” \nAlso, the comments made in the notes to file gave rise to a reasonable apprehension of bias \non the part of the immigration officer as they did not disclose the existence of an open mind \nor a weighing of the particular circumstances of the case, free from stereotyping. \nThe statements made by the officer gave the impression that the decision was made, not on \nthe evidence before him, but because Ms. Baker was a single mother with several children \nand she had been diagnosed with a psychiatric illness. \nThe use of capital letters highlighting the number of children suggested this was a reason for \nmaking the negative decision. Comments about the [immigration] “system” and Canada’s \n“generosity” reflected the officer’s frustration and a lack of impartiality. \nAs reflected in the officer’s notes, inattention to the interests of the children and his lack of \nimpartiality led the Court to find that, in the circumstances of the case, his exercise of \ndiscretion could not be upheld as it was an unreasonable decision. \nSummary of issues and impact on CIC \nThe following summarizes the issues and the impact of the decision on CIC: \n \nParticipatory rights (right to an interview) – There is no general requirement to hold \ninterviews prior to making H&C decisions. There is no requirement for Canadian born \nchildren to receive separate notices of H&C decision-making nor a separate opportunity \nto make their own submissions. \n \nAppropriateness of H&C guidelines – The Court noted that the guidelines in immigration \nmanual chapter IE 9 (in effect at the time Ms. Baker’s application was refused), were \nconsistent with the approach that decisions must consider humanitarian and \ncompassionate values. The principles underlying the IE 9 guidelines have been expanded\nENF 23 Loss of permanent resident status \n2015-01-23 \n \n47 \nin the current version of the immigration manual chapter dealing with H&C applications \n(IP 5). \n \nConsideration of children’s interests – While the best interests of children must always be \ntaken into account as an important factor that is given substantial weight, this does not \nmean that they will outweigh other factors of the case. There may be grounds for \nrefusing an H&C application even after considering the best interests of children. \n \nWritten reasons for decision and impact on note-taking – The issue of written reasons for \ndecision is dealt with extensively in OM IP 00-07– Providing Written Reasons – \nHumanitarian or Compassionate (H&C) Decisions. The Court’s willingness to accept notes \nto file as reasons for decision does not mean that note-taking practices have to change \nor become more elaborate. Adhering to the principles of note-taking as set out in \nimmigration manual chapter IP 5, Section 9 is all that is required. \n \nAppropriate standard of review for discretionary H&C decisions: \nReasonableness simpliciter – The rule of administrative law relating to review of \ndiscretionary decisions has traditionally been on limited grounds, such as decisions made \nin bad faith or for improper purpose or where irrelevant considerations were used or, \nfrom time to time, if the decision was considered “unreasonable”. Discretion must be \nexercised in a manner that is within a reasonable interpretation of the statute, in \naccordance with general principles of rule of law and administrative law governing \ndiscretion, reflective of the fundamental values of Canadian society and consistent with \nthe Canadian Charter of Rights and Freedoms. \n \nThe Court concluded that significant deference should be accorded to immigration officers \nexercising discretionary H&C authority; however, the standard of reviewing H&C \ndecisions should be reasonableness simpliciter. This means that decisions must be \nsupported by reasons that can withstand a somewhat probing examination; that is, there \nmust be a solid foundation of evidence and conclusions drawn must be logical. \n \nCertified question: Canada’s international obligations – Although Canada may be a \nsignatory to international treaties and conventions, they are not part of Canadian law \nunless they have been implemented by statute; they have no direct application within \nCanadian law. They may, however, help inform the context of statutory interpretation \nand judicial review. In the instance of the Convention on the Rights of the Child, it is an \nindicator of the importance of considering the interests of children when making H&C \ndecisions.\nENF 23 Loss of permanent resident status \n2015-01-23 \n \n48 \nAppendix B Strengthening decisions / guidelines on taking \nnotes \nBe objective: record facts, not your opinions or interpretation of the facts. \nBe clear and concise: use common language and avoid jargon. \nUse complete words: avoid extraneous comments. \nNotes should contain: \n \nhow the decision was made (for example, the decision was based on a paper file review \nor an interview); \n \nthe exact time period being examined; \n \nif an interpreter was used, include the name of the interpreter and relationship to the \nperson concerned, language of interpretation and instructions given to the interpreter; \n \nsummary of correspondence and communication; \n \ncontents of all non-routine correspondence, form numbers of routine correspondence \nsent and summary of any telephone conversations. FOSS and CAIPS notes should \nrepresent a complete record of all action taken in the case - there should be no \ninformation that appears only on the paper file. \nDescription of the interview \nNotes should include: \n \nwho was present; \n \nthe person’s disposition; \n \nany significant occurrences, if applicable; \n \nthe duration of the interview. \nOfficers’ notes should be dated and initialed \nGuidelines on Reasons for decisions: \n \nall the factors considered in making the decision, both positive and negative, should be \nrecorded; \n \nthe thought process should be explained and no assumptions made. The gap between \nthe facts listed and the decision should be filled in. It is possible to divide the facts into \ntwo categories: compelling reasons for H&C grounds, including a finding of hardship; and \nthose facts that were not considered to be justifiable reasons and do not favour a finding \nof hardship. Some facts will be more important than others; \n \nabsolute statements like there is no evidence or there would be no hardship should be \navoided; usually what is meant is that there is insufficient evidence or insufficient \nhardship;\nENF 23 Loss of permanent resident status \n2015-01-23 \n \n49 \n \nneutral terms should be used; for example, it is preferable to say, he states rather than \nhe claims or he admitted; \n \nwhere possible, strong comments on the credibility of the information should be avoided; \nfor example, if an officer were to use the phrase I am not satisfied instead of the phrase \nI do not believe, it is less contentious and keeps the onus on the person concerned to \nsatisfy an officer; \n \nofficers should comment on evidence rather than drawing any inference from it; \n \nofficers’ notes should be written in simple, straightforward and dispassionate language; \n \nofficers should record how the person concerned was given the opportunity to be heard; \nthat is, how the permanent resident was provided with an opportunity to satisfy an \nofficer that there were H&C considerations in relation to the case.\nENF 23 Loss of permanent resident status \n2015-01-23 \n \n50 \nAppendix C Declaration \nDECLARATION \nCANADA \nProvince of \nProvince de \nCity of \nVille de \nIn the matter of the Immigration and Refugee Protection Act and in the matter of \nConcernant la Loi sur l'immigration et la protection des réfugiés et concernant \nI Je, soussigné(e)(Full name)(Nom au complet) \nof , de \nsolemnly declare that déclare solennellement que \nAcknowledgement of decision \nI, understand that the Minister’s delegate has determined that I have not complied with the \nrequirements of the residency obligation under section A28 of the Immigration and Refugee \nProtection Act (IRPA). I further understand that a departure order has been issued to me \npursuant to section A228(2) of IRPA and, if I do not file an appeal to the Immigration Appeal \nDivision (IAD) of the Immigration and Refugee Board pursuant to section A63(3), I will cease \nto be a permanent resident in accordance with section A46(1)(c) of IRPA. \nLoss of residency criteria \nPursuant to subsection A28(2), a permanent resident complies with the residency obligation \nprovisions with respect to a five-year period if, for at least 730 days in that five-year period, \nthe permanent resident is physically present in Canada, or: \ni) is outside Canada accompanying a Canadian citizen who is his or her spouse or common-\nlaw partner or is a child accompanying a parent; \nii) is outside Canada employed on a full-time basis by a Canadian business or in the public \nservice of Canada or of a province; \niii) is an accompanying spouse, common-law partner or child of a permanent resident who is \noutside Canada and is employed on a full-time basis by a Canadian business or in the public \nservice of Canada or of a province;\nENF 23 Loss of permanent resident status \n2015-01-23 \n \n51 \n(iv) is outside Canada accompanying a permanent resident who is their spouse or common-\nlaw partner or, in the case of a child, their parent and who is employed on a full-time basis by \na Canadian business or in the public service of Canada or of a province; or \n(v) is referred to in regulations providing for other means of compliance. \nRegulation \nR328. (1) A person who was a permanent resident immediately before the coming into force \nof this section is a permanent resident under the Immigration and Refugee Protection Act. \n(2) Any period spent outside Canada within the five years preceding the coming into force of \nthis section by a permanent resident holding a returning resident permit is considered to be a \nperiod spent in Canada for the purpose of satisfying the residency obligation under section 28 \nof theImmigration and Refugee Protection Act if that period is included in the five-year period \nreferred to in that section. \n(3) Any period spent outside Canada within the two years immediately following the coming \ninto force of this section by a permanent resident holding a returning resident permit is \nconsidered to be a period spent in Canada for the purpose of satisfying the residency \nobligation under section A28 of the Immigration and Refugee Protection Act if that period is \nincluded in the five year period referred to in that section. \nLoss of status \nSubsection A46(1)(c) reads: \nA46(1) A person loses permanent resident status: \n(c) when a removal order made against them comes into force \nAppeal rights \nA63(3) A permanent resident or a protected person may appeal to the Immigration Appeal \nDivision against a decision at an examination or admissibility hearing to make a removal \norder against them. \nI, understand that pursuant to section A63(3) of the IRPA, I have a right to appeal the \ndecision to issue a removal order against me to the Immigration Appeal Division (IAD) of the \nIRB. \nSOLEMN DECLARATION \nI, of the city of, , in the province of , Canada SOLEMLY DECLARE THAT: \nI agree with the Minister’s delegate’s decision that I have not met the residency obligation \nunder section A28 of the Immigration and Refugee Protection Act (IRPA). \nI understand that as a consequence of this decision I have been issued a departure order.\nENF 23 Loss of permanent resident status \n2015-01-23 \n \n52 \nI am fully aware of my appeal rights pursuant to section A63(3) of the IRPA and I will not be \nsubmitting an appeal to the IAD. I fully understand that if I do not appeal the decision I will \nno longer have the right to enter Canada or remain as a permanent resident without first \nobtaining a permanent resident visa. \nI am signing this declaration of my own volition, not due to force or the influence of any other \nperson and, I make this solemn declaration conscientiously believing it to be true and \nknowing that it is of the same force and effect as if made under oath. \nDeponent \nDeclared before me at \nin the city of \nin the province of , Canada \nthis day of , \n  \n  \nMinister’s Delegate \nInterpreter's declaration \nI, ___________________________________, solemnly declare that I have faithfully and \naccurately interpreted in the _______________________ language the information provided \nabove. I make this declaration conscientiously believing it to be truth and knowing that it is of \nthe same force and effect as if made under oath. \nSignature of Interpreter ___________________________"
}