{
  "type": "pdf",
  "source": "Overview_on_Information-Sharing.pdf",
  "text": "IN 1\nOverview on Information-Sharing\nIN 1 Overview on Information-Sharing \n2005-06-15 \n \n1 \nUpdates to chapter........................................................................................................................................2 \n1. \nWhat this chapter is about .....................................................................................................................3 \n2. \nProgram objectives ................................................................................................................................3 \n3. \nThe Act and Regulations........................................................................................................................3 \n4. \nInstruments and delegations..................................................................................................................7 \n5. \nDepartmental policy ...............................................................................................................................7 \n5.1. \nResponsibility to protect the personal information of all clients...................................................7 \n5.2. \nPrivacy Act compliance................................................................................................................8 \n5.3. \nOptimum use of personal information..........................................................................................8 \n5.4. \nPrivacy impact assessment (PIA)................................................................................................8 \n5.5. \nRecording the sharing of information...........................................................................................8 \n5.6. \nMethods of sharing information ...................................................................................................8 \n5.7. \nWho may share information.........................................................................................................8 \n5.8. \nWhat information may be shared.................................................................................................9 \n5.9. \nWhat information may not be shared...........................................................................................9 \n6. \nDefinitions ..............................................................................................................................................9 \n6.1. \nAcronyms...................................................................................................................................10 \n7. \nProcedures...........................................................................................................................................10 \nAppendix \nA: Agreements and Arrangements........................................................................................11 \nA.1 Provincial and territorial agreements and arrangements ..............................................................11 \nA.2 Other domestic arrangements and agreements............................................................................11 \nA.3 Canada / U.S. Agreements and Arrangements.............................................................................13 \nA.4 Other International Arrangements and Agreements .....................................................................13\nIN 1 Overview on Information-Sharing \n2005-06-15 \n \n2 \nUpdates to chapter \nListing by date: \nDate: 2005-06-15 \nUnder Section 6, Definitions, the definition of “Personal Information\" was amended to include \n“photographs or facial images.”\nIN 1 Overview on Information-Sharing \n2005-06-15 \n \n3 \n \n1. \nWhat this chapter is about \nThis chapter will: \n• \nprovide background information for personnel authorized to engage in the sharing of personal \ninformation with third parties. \n• \nhighlight the provisions of various acts that apply to the collection, retention, sharing and use \nof personal information. \n• \nidentify and reflect departmental and Treasury Board policy governing the sharing of personal \ninformation with third parties. \n• \nlist selected agreements and arrangements entered into with domestic and foreign partners \nthat permit information-sharing.  \n2. \nProgram objectives \nThe object of information-sharing is to support the effective administration and enforcement of \nCanada’s citizenship and immigration programs including, but not limited to, such matters as: \n• \ntravel to Canada, authorization to enter into Canada, the investigation of matters relating to \nprogram abuse, criminality, public safety and health, the coordination and streamlining of \nenforcement cases and the sharing of services and facilities, i.e.,  those used for detention \npurposes; \n• \nthe selection of foreign nationals, issuance of visas, protection of refugees, integration of \nnewcomers, support of provincial and territorial immigration programs and settlement \nservices; \n• \nthe support of Canada’s public safety and security objectives with respect to the management \nof the global movement of people and combating international terrorism, war crimes, crimes \nagainst humanity and organized crime. \n3. \nThe Act and Regulations \nWhile there is no explicit right to privacy of personal information in Canada's Constitution (1867), \nBill of Rights (1960) or the Charter of Rights and Freedoms (1982), Canada's courts have \nrecognized an individual's right to a reasonable expectation of privacy when interpreting section 8 \nof the Charter (which grants the right to be secure against unreasonable search or seizure). \nSince the 1960s, the Government has acted to modernize and improve government records \nincluding the collection and use of personal information. For example, in 1966, the Public \nRecords Order expressed the Government's intention to inventory, control and organize \ngovernment records and reduce the need for numerous government departments to repeatedly \ncollect the same personal information from clients. Later came the Privacy Act (1985), the Access \nto Information Act (1985) and the Personal Information Protection and Electronic Documents Act \n(2000) which, subject to statutory constraints, speak to privacy protection issues yet continue to \nmaintain the benefits of disclosing information.\nIN 1 Overview on Information-Sharing \n2005-06-15 \n \n4 \nInternationally, Canada is a signatory of the United Nations (UN) International Covenant on Civil \nand Political Rights (March 1976) in which article 17.1 provides a basis for Canadian privacy \nlegislation governing the sharing of personal information as follows:  \n17.1 No one shall be subjected to arbitrary or unlawful interference with his privacy, \nfamily, home or correspondence, nor to unlawful attacks on his honour and reputation. \nFor the full text of the Covenant, see http://www.ohchr.org/english/law/ccpr.htm \nIn addition, Canada is a member of the Organisation for Economic Co-operation and \nDevelopment (OECD) and relied on the OECD Guidelines on the Protection of Privacy and \nTransborder Flows of Personal Data (1980) in the drafting of the federal Privacy Act of 1985. \nAs the result of Canada’s domestic advances in information management and its participation in \ninternational forums, strong privacy values and principles are embedded in Canada’s legislation \nand policy governing the sharing of personal information. See the Privacy Act, Access to \nInformation Act and the Personal Information Protection and Electronic Documents Act as well as \nthe Treasury Board’s Management of Government Information (MGI) Policy, the, Use and \nDisclosure of Personal Information Policy, the Privacy and Data Protection Policy and the Data \nMatching Policy.  \nA fundamental premise of these values and principles is that personal information shall not be \nshared with third parties without the consent of the individual to whom the information relates. \nThis is because the sharing of personal information by government agencies with third parties \ncould infringe on the personal rights, freedoms and liberties that exist in Canada today. However, \nthere are a number of exemptions that allow government agencies to use personal information, \nwithout the individual’s consent, in order to efficiently administer programs, enforce the law, act to \nprotect the safety of Canada and contribute to international peace and good order.  \nFederal public servants need to be aware of these broad values and principles in order to utilize \nthe specific acts, regulations and policies governing the sharing of personal information with third \nparties. It is also important to be aware of the exemptions and their sources.  \nTable 1: Values and principles governing the use of personal information. \nPrinciple \nExemption \nExemption/Exemption \nAuthority \nPersonal information should be obtained \nonly if it relates directly to an operating \nprogram or activity of the collecting \ninstitution. \nNo \nNo exemption \nPersonal information should be obtained \nfairly and lawfully. \nNo \nNo exemption \nPersonal information should be obtained \nfrom the individual. \nYes \ns. 5.3 of the Privacy Act \nPersonal information should be used only \nfor the original specified purpose for which \nit was obtained. \nYes \ns. 7(b) and s. 8(2) of the Privacy \nAct \nPersonal information should be adequate, \nrelevant and not excessive to the original \npurpose for which it was obtained. \nNo \nNo exemption \nWhen used for administrative purposes \npersonal information should be reasonably \naccurate and up to date. \nNo \nNo exemption \nPersonal information should be accessible \nto the subject. \nYes \ns. 13-26 of the Access to \nInformation Act – “Exemptions” \ns.18-28 of the Privacy Act –\n\"Exemptions\" \nPersonal information should be kept \nsecure. \nNo \nNo exemption\nIN 1 Overview on Information-Sharing \n2005-06-15 \n \n5 \nPersonal information should be shared only \nwith the subject’s consent. \nYes \ns. 8(2) of the Privacy Act \nPersonal information should be disposed of \nafter its purpose is achieved and legal \nretention requirements are satisfied. \nNo \nNo exemption \nThe President of the Treasury Board is the minister responsible for government-wide \nadministration of information collection, use, sharing and retention. This includes the \nresponsibility of issuing to the public a directory of federal government information holdings \nknown as Info Source, which lists federal institutions, the information (including personal \ninformation) they collect and how it is used.  \nAlthough the Privacy Act is the federal legislation that governs the vast majority of personal \ninformation-sharing carried out by public servants with third parties, other Acts of Parliament also \ncontain requirements related to the sharing of personal information with third parties. These other \nActs of Parliament address very specific types of personal information-sharing, for example, \njuvenile criminal records. Whenever one of these other Acts of Parliament authorizes, prohibits or \nregulates the sharing of information, then it takes precedence over the Privacy Act. \nInformation concerning individuals in immigration and citizenship records falls within the definition \nof “personal information” under section 3 of the Privacy Act. Section 8 of the Privacy Act states \nthat personal information cannot be disclosed (shared) without the written consent of the \nindividual concerned OR unless it is shared under specific legislation, as set out in the Privacy \nAct or in another federal Act of Parliament. \nThree of the most often cited legal methods by which personal information may be shared without \nthe written consent of the individual concerned are contained in the Privacy Act. \nFirstly, paragraph 8(2)(a) of the Privacy Act allows personal information to be shared with a third \nparty “for a purpose for which the information was obtained or compiled . . . or for a use \nconsistent with that  purpose.” A test of whether a proposed use or disclosure is \"consistent\" may \nbe whether it would be reasonable for the individual who provided the information to expect that it \nwould be used in the proposed manner. This means that the original purpose and the proposed \npurpose are so closely related that the individual would expect that the information would be used \nfor the consistent purpose, even if the use is not spelled out. \nSecondly, paragraph 8(2)(e) of the Privacy Act allows personal information to be shared on a \nwritten request of an investigative body (see Schedule II of the Privacy Regulations for a listing \nof investigative bodies), “. . . for the purpose of enforcing any law of Canada or a province or \ncarrying out a lawful investigation, if the request specifies the purpose and describes the \ninformation to be disclosed.”  \nThirdly, paragraph 8(2)(f) of the Privacy Act allows personal information to be shared with \nprovincial and foreign governments and international bodies for administering or enforcing any \nlaw or carrying out any lawful investigation when the sharing of personal information is carried out \nunder the terms of an agreement or arrangement.  \nThese and other Privacy Act exemptions to the requirement for consent are noted in Table 2. \nTable 2: Privacy Act (1985) \nSection 8 authorities for sharing personal information without the individual’s consent \n \nIn the absence of the written consent of the individual, sharing of their personal information with a third \nparty is prohibited by section 8 of the Privacy Act, except in the specific instances listed below. \ns. 8(2)(a) \nFor the purpose for which the information was obtained or compiled or for a use \nconsistent with that purpose. \ns. 8(2)(b) \n \nFor any purpose in accordance with any Act of Parliament or regulation that authorizes \nits sharing. \ns. 8(2)(c) \nFor the purpose of complying with a subpoena, warrant or court order. \ns. 8(2)(d) \nTo the Attorney General of Canada for use in legal proceedings involving the Crown.\nIN 1 Overview on Information-Sharing \n2005-06-15 \n \n6 \ns. 8(2)(e) \nTo investigative bodies specified in the regulations, for law enforcement and lawful \ninvestigations. \ns. 8(2)(f) \nTo provincial and foreign governments and international bodies, under agreement, for \nadministering or enforcing any law or carrying out any lawful investigation. \ns. 8(2)(g) \nTo a member of Parliament for the purpose of assisting the individual whom the \ninformation concerns. \ns. 8(2)(h) \nTo staff of the institution for internal audit purposes; to the office of the Comptroller \nGeneral. \ns. 8(2)(i) \nTo the Library and Archives of Canada for archival purposes. \ns. 8(2)(j) \nFor research or statistical purposes under certain conditions. \ns. 8(2)(k) \nTo any aboriginal government, association of aboriginal people, Indian band, \ngovernment institution, etc. for research and validation of Aboriginal claims, disputes or \ngrievances. \ns. 8(2)(l) \nTo any government institution to locate an individual in order to collect a debt owed to \nthe Crown or make a payment to an individual. \ns. 8(2)(m) \nFor any purpose where sharing would: i) be in the public interest; or, ii) clearly benefit \nthe individual to whom the information relates. \nNote: Subsection 8(2) of the Privacy Act permits the sharing of information but does not require it. The \ninstitution continues to have discretion in deciding whether or not to share the personal information \nwithout the consent of the individual concerned. \nAlso pertinent is subsection 5(3) of the Privacy Act which provides for two exceptions to the \nrequirement to collect personal information directly from the individual to whom it relates. These \ninstances are where the direct collection of such information might result in collecting inaccurate \ninformation or might defeat the purpose or prejudice the use for which the information is collected. \nThese exceptions are primarily intended for use by investigative bodies in those circumstances \nwhere direct collection would jeopardize an investigation. \nFor detailed discussion of all section 8 exemptions please consult the CIC Privacy Manual at \nhttp://www.ci.gc.ca/cicexplore/english/guides/guides/pm/index.htm \nOther relevant Canadian legislation \nTable 3: Other applicable federal acts and their provisions \nAct \nProvision(s) \nNotes \nAccess to \nInformation \nAct 1985 \ns. 19(2)(c) \nprovides for \nsharing with a \nthird party without \nconsent. \nWhen the disclosure is in accordance with s. 8 of the Privacy Act. \nCitizenship \nAct 1985 \nn/a \nNo references to information-sharing without consent appears in the \nCitizenship Act and its Regulations \nCriminal \nRecords Act \n \n1985 \ns. 6(2)  \nNo information may be released concerning an individual’s criminal \nconvictions for which a pardon has been granted unless the \npermission of the Minister (Public Safety and Emergency Preparedness \nCanada) has been obtained -- or with the written consent of the \nindividual concerned. \nCustoms Act \n \n1985 \ns.107(5)(j)  \nPersonal information collected by a customs inspector may be shared \n(without consent of the individual to whom the information pertains) \nwith “an official of the Department of Citizenship and Immigration \nsolely for the purpose of administering or enforcing the Immigration \nand Refugee Protection Act, if the information relates to the \nmovement of people into and out of Canada;” \nImmigration \nand Refugee \nA7, A8 and A9  \n \nProvides for agreements to be entered into with provinces, \ngovernment of a foreign state and international organizations for the\nIN 1 Overview on Information-Sharing \n2005-06-15 \n \n7 \nProtection \nAct…. \n \n \n \n \n \n \n \n \n \n \n \n \n….. and \nRegulations \n \n2002 \nA148(1)(d), s. \nA149(a) and \nA149(b)  \n \n \n \n \nA150.1(1)(b)  \n \n \n \n \n \n \nR264, R265, \nR267, R268, \nR270  \n \nR269  \npurposes of the Act. \nAuthorizes sharing of information provided by a transportation \ncompany providing that “A149(a) the information may be used only for \nthe purposes of this Act or to identify a person for whom a warrant of \narrest has been issued in Canada; and (b) notice that the information \nwas used must be given to the person to whom it relates.” This means \na person who is subject to an inadmissibility report, arrest, or a \nremoval order. \nProvides for “the disclosure of information [gathered under IRPA] for \nthe purposes of national security, the defence of Canada, and the \nconduct of international affairs,…” \nWith respect to persons carried to Canada: \n• \nA “transporter” is required to share with CIC information \nconcerning an individual’s itinerary, ticket information and \ntravel/identity document AND crew list details and changes. \n• \nA ‘transporter” must provide advance passenger information to \nCIC. \nYouth \nCriminal \nJustice Act \n \n2002 \ns. 118(1) of the \nAct. \n \nFor exceptions to \ns. 118(1) see s. \n125(1) – s. 125(6) \ninclusively. \nNo person shall be given information that may identify the young \nperson, to whom it relates, as a young person dealt with under the \nYouth Criminal Justice Act. \nPublic Safety \nAct \n \n2002 \ns. 4.82 of the \nAeronautics Act \n(Not yet in force). \nRequires airlines to share personal information of persons on \ndomestic and international flights with Public Safety and Emergency \nPreparedness Canada.  \n \n4. \nInstruments and delegations \nThere are approximately 150 arrangements and agreements in which the sharing of immigration \nand citizenship information is referenced. Each agreement or arrangement, and its related \nimplementation material, specifies the detailed requirements to be met when sharing information, \nincluding, in some cases, the designation of officials.  \n5. \nDepartmental policy \nThe following policy applies to all information-sharing with third parties and is general in nature. \nFor specific guidelines, the particular agreement / arrangement and its implementation material \nmust be consulted. \n5.1. \nResponsibility to protect the personal information of all clients \nA large number of immigration and citizenship clients are not Canadian citizens, permanent \nresidents or even residents in Canada. Staff must be aware of the responsibility to protect clients’ \npersonal information regardless of an individual's status or location even if they have never been \nto Canada. Thus, the sharing of any client’s personal information, without their consent, must \ncomply with applicable requirements. [CIC’s Privacy Manual at 1.05 at \nhttp://www.ci.gc.ca/cicexplore/english/guides/guides/pm/index.htm]\nIN 1 Overview on Information-Sharing \n2005-06-15 \n \n8 \n5.2. \nPrivacy Act compliance \nAll personal information-sharing and exchange shall be carried out in accordance with the Privacy \nAct or the provisions of another Act of Parliament. [CIC’s Privacy Manual at 9.04(3)(b) at above \naddress] \n5.3. \nOptimum use of personal information \nThe departmental (CIC) Privacy Manual, at 2:3(c), notes that it is necessary to balance the \nrequirements for privacy with the need to ensure the optimum use of personal information for any \npurpose permitted by the Privacy Act, in order to promote general efficiency in government \noperations, eliminate unnecessary collection of information, reduce the response burden on \nindividuals and facilitate the sharing of data for research or statistical purposes. \n5.4. \nPrivacy impact assessment (PIA) \n In May 2002, the Treasury Board of Canada Secretariat (TBS) implemented its Privacy Impact \nAssessment Policy. The policy requires that, where a government institution commences a new \nprogram or service or significantly changes an existing one, the institution be required to do a \nprivacy impact assessment (PIA). For existing programs, a PIA is required if there is a significant \nchange to the manner in which personal information is collected, used or disclosed. The goal of \nthe PIA is a comprehensive report that ensures that privacy protection is a core consideration in \nthe initial framing of program or service objectives and in all subsequent activities. \n5.5. \nRecording the sharing of information \nPursuant to sections 8(4),  8(5), 10 and 11 of the Privacy Act, government institutions must take \nsteps to ensure that individuals shall have the opportunity to be aware that their personal \ninformation has been or may be shared without their consent and with whom and for what \npurpose.  \nThis is accomplished in four ways: \n• \neach program should ensure that all disclosures under section 8(2)(f) of the Privacy Act – \nAgreements and arrangements – are listed in InfoSource;  \n• \neach instance of sharing with a third party that is not listed in InfoSource must be recorded on \nthe individual’s file;  \n• \nwhen required by arrangement or agreement; \n• \nwhen required as part of administrative and/or case-noting practices. \n5.6. \nMethods of sharing information \nAuthorized sharing of personal information with third parties without the consent of the \nindividual(s) concerned may be carried out in a number of ways. Case-by-case information-\nsharing may take place between individual officers; sharing of client information may also take \nplace using databases to undertake data matching exercises; and the systematic sharing of data \nsets containing multiple personal records may also be carried out.  \n5.7. \nWho may share information \nAuthorization to share information is restricted to those persons/categories of positions that need \nand/or have access to the information in order to carry out specific administrative and program \nactivities. These activities include, by way of example: visa issuance and extension; overseas \ninterdiction of improperly documented travellers; passenger analysis; examination at port of \nentries; asylum seeker/refugee protection; integration/settlement work; investigations; detention;\nIN 1 Overview on Information-Sharing \n2005-06-15 \n \n9 \nremovals; and data management. As a result of this wide range of activities, there are a \ncorrespondingly large number of agreements and arrangements that permit the sharing of \ninformation.  \nThe appropriate agreements/arrangements must be consulted in order to determine who is \nauthorized to share specific information. \n5.8. \nWhat information may be shared \nThere are provisions in the Privacy Act and in a large number of departmental/agency \nagreements and arrangements that permit the sharing of a wide range of personal information by \ngovernment officials administering and enforcing Canada’s citizenship and immigration programs. \nThe personal information that is permitted to be shared varies under the terms of each \narrangement and agreement and is restricted to the information needed to advance specified \nprogram objectives. The appropriate agreements/arrangements must be consulted in order to \ndetermine what information may be shared. \n5.9. \nWhat information may not be shared \nFew, if any, agreements and arrangements permit the sharing of information related to young \noffenders, an individual’s medical information or an individual’s social insurance number.  \nDue to the large number and variety of information-sharing agreements, it is not possible to \nspecify in this chapter what may be shared. The appropriate chapter or information-sharing \nagreement/arrangement must be consulted for specific guidance on what information may be \nshared. \n6. \nDefinitions \nTable 4. Definitions \nAdministrative \nPurpose \nIn relation to the use of personal information about an individual, it means the use of that \ninformation in a decision-making process that directly affects that individual. \nAgreement \nA legally binding document such as a treaty. \nArrangement \nA non-legally binding statement of cooperation between two or more parties such as a \nmemorandum of understanding or statement of mutual understanding. \nCitizenship and \nimmigration \nlaws \nLaws and regulations of Canada relating to authorization to enter into Canada, permanent \nresidence, temporary residence, asylum, detention, removal, naturalization, \ndenaturalization, or loss of nationality. This includes but is not limited to: laws and \nregulations relating to provisions contained in the Immigration and Refugee Protection Act, \nthe Citizenship Act, the Crimes Against Humanity and War Crimes Act; and any other laws \nthat relate to immigration and citizenship matters contained in an Act of Parliament. \nData \nPersonal information stored electronically. \nData-matching \nData-matching is defined as the comparison of personal data obtained from different \nsources, including personal information banks, for the purpose of making administrative \ndecisions about the individuals to whom the data pertains. \nInfoSource \nInfoSource is a series of publications containing information about the Government of \nCanada, its organization and information holdings. It supports the Government's policy to \nexplain and promote open and accessible information regarding its activities. It is a key \nreference tool to assist members of the public in exercising their rights under the Access to \nInformation Act and the Privacy Act. \nPersonal \nInformation \nMeans information about an identifiable individual that is recorded in any form including: \n• \ninformation relating to the race, national or ethnic origin, colour, religion, age or marital \nstatus of the individual;\nIN 1 Overview on Information-Sharing \n2005-06-15 \n \n10 \n• \ninformation relating to the education or the medical, criminal or employment history of \nthe individual or information relating to financial transactions in which the individual has \nbeen involved; \n• \nany identifying number, symbol or other particular assigned to the individual; \n• \nthe address, fingerprints or blood type of the individual; \n• \nphotographs or facial images; \n• \nthe personal opinions or views of the individual except where they are about another \nindividual or about a proposal for a grant, an award or a prize to be made to another \nindividual by a government institution or a part of a government institution specified in \nthe regulations; \n• \ncorrespondence sent to a government institution by the individual that is implicitly or \nexplicitly of a private or confidential nature, and replies to such correspondence that \nwould reveal the contents of the original correspondence; \n• \nthe views or opinions of another individual about the individual; \n• \nthe views or opinions of another individual about a proposal for a grant, an award or a \nprize to be made to the individual by an institution or a part of an institution referred to \nin paragraph (e) above, but excluding the name of the other individual where it appears \nwith the views or opinions of the other individual; and \n• \nthe name of the individual where it appears with other personal information relating to \nthe individual or where the sharing of the name itself would reveal information about the \nindividual. \nSharing of \nInformation \nRefers to the disclosure, exchange or receipt of personal information, by any method, e.g., \ntransmission, provision of a copy, examination of the record, to/from anybody or person. \nTransporters \nCommercial passenger carriers. \n6.1. \nAcronyms \nCBSA \nCanada Border Services Agency \nCIC \nCitizenship and Immigration Canada \nDHS \nU.S. Department of Homeland Security \nMGI \nManagement of Government Information \nMOU \nMemorandum of Understanding \nOECD \nOrganisation for Economic Co-operation and Development \nPIA \nPrivacy Impact Assessment \nSMU \nStatement of Mutual Understanding \nUN \nUnited Nations \n7. \nProcedures \nSpecific procedures for sharing information with a third party \nDue to the large number and wide variety of information-sharing agreements, it is necessary that \nthe appropriate agreement or arrangement be consulted.\nIN 1 Overview on Information-Sharing \n2005-06-15 \n \n11 \n \nAppendix \nA: \nAgreements and Arrangements \n \nA.1 Provincial and territorial agreements and arrangements \nThese agreements set out the responsibilities of each party with respect to a range of matters \nrelating to the movement of refugees, visitors, and immigrants to the specified province or \nterritory. Included are aspects of recruitment and selection of foreign nationals, settlement and \nintegration activities and cooperation in sharing information in order to ensure the integrity of \ncitizenship and immigration programs. \nTable 5:  Federal-Provincial/Territorial Agreements \n# Province/Territory \nDate signed \nExpiry date \n1 Canada-Newfoundland and Labrador Agreement on Provincial Nominees 1999 \n2004 \n2 Agreement for Canada-Prince Edward Island Co-operation on Immigration 2001 \n2006 \n3 Canada-Nova Scotia Agreement on Provincial Nominees \n2002 \n2007 \n4 Canada-New Brunswick Agreement on Provincial Nominees \n1999 \n2004 \n5 Canada-Quebec Accord \n1991 \nOngoing \n6 Canada-Ontario Memorandum of Understanding on Information Sharing  \n2004 \nOngoing \n7 Canada-Manitoba Immigration Agreement \n1996 \n(Renewed 2003) Ongoing \n8 Canada-Saskatchewan Immigration Agreement \n1998 \n(Amended  \n2004) \n2005 \n9 Canada-Alberta Agreement on Provincial Nominees \n2002 \n2004 \n10 Canada-Alberta Agreement on Information Sharing \n2003 \nOngoing \n11 Agreement for Canada-British Columbia Co-operation on Immigration \n2004 \n2009 \n12 Agreement for Canada-Yukon Co-operation on Immigration \n2001 \n2006 \nLocal/regional written agreements to share information may exist with provincial/territorial \nchildren's aid agencies, social services, health services and corrections services–and should be \nconsulted as required \n \nA.2 Other domestic arrangements and agreements \nTable 6: Other domestic agreements and arrangements \n# \nArrangement / Agreement \nDate Signed \nDescription \n1 \nMemorandum of Understanding \nbetween Citizenship and Immigration \nand Canada Customs and Revenue \nAgency. \n2003 \nSets out roles and responsibilities at ports of \nentry and ensures effective examination of \npersons seeking entry to Canada. \n2 \nMemorandum of Understanding \nCanada Employment and \nImmigration Commission and \nExternal Affairs and International \nTrade Canada. \n1992 \nConcerns the management of Canada's \nimmigration programs. \n3 \nMemorandum of Understanding \nbetween the Documentation, \nInformation and Research Branch, \nImmigration and Refugee Board of \nCanada (DIRB-IRB) and the \nRefugees Branch, Citizenship and \nImmigration Canada. \n1997 \nPermits CIC Refugee Branch to share \nclaim/claimant-specific information with DIRB-\nIRB. \n4 \nInformation sharing agreement \nbetween Citizenship and Immigration \nCanada and the Immigration and \n1997 \nIncludes sharing of personal information on \ninquiries, detention reviews, appeals and refugee \ndeterminations.\nIN 1 Overview on Information-Sharing \n2005-06-15 \n \n12 \nRefugee Board of Canada. \n5 \nAgreement between Citizenship and \nImmigration and the Immigration and \nRefugee Board of Canada regarding \nclaim-related information from \nrefugee claimants. \n1999 \nPermits CIC officers to share personal \ninformation with the IRB that was obtained during \nrefugee claimant examinations. \n6 \nMemorandum of Understanding  \nconcerning the resettlement of \nwitnesses appearing before the \nInternational Criminal Tribunal of the \nformer Yugoslavia [signed by CIC \nand the Criminal Tribunal of the \nformer Yugoslavia] \n2002 \nPermits sharing of personal information with CIC \nin order to assess the admissibility of persons \nwho need to be relocated as a means of giving \nthem protection. \n7 \nAgreement between CIC and CSIS \non joint interviews. \n1996 \nSets out the responsibilities of officers from \ncustoms, immigration and Canada’s intelligence \nservice in the examination of persons seeking \nentry into Canada who may represent a threat to \nnational security. \n8 \nMemorandum of Understanding \nbetween the Minister of National \nDefence, the Minister of Citizenship \nand Immigration Canada (CIC) and \nthe Solicitor General of Canada. \n2002 \nDefines the scope and process for the provision \nof Canadian Forces assistance for the purpose of \nenforcing immigration laws with respect to \nirregular maritime arrivals. It Includes the sharing \nof relevant information and intelligence. \n9 \nOur Missing Children's Program – \nAgreement between DFAIT, CIC, \nCCRA and the Department of Justice \n1993 \nPermits sharing of personal information in order \nto reunite children with their families. \n10 \nMemorandum of Understanding \nbetween Citizenship and Immigration \nand the Royal Canadian Mounted \nPolice concerning partnership, \ncommunication, cooperation and \ninformation sharing \n2002 \nConcerns the provision of mutual assistance \nbetween CIC and the RCMP with respect to \nenforcement actions and their respective \nprogram operations. \n11 \nMemorandum of Understanding \nbetween Citizenship and Immigration \nand Canada and the Canadian Police \nInformation Centre \n1995 \nConcerns the conditions under which CIC \npersonnel may access the Canadian Police \nInformation Centre \n12 \nMemorandum of Understanding \nbetween Citizenship and Immigration \nCanada and the Correctional \nServices of Canada (Regional MOUs \nwere signed in 1993) \n1994 \nConcerns the arrangements for services, \nincluding custodial services, and the necessary \nsharing of personal information. \n13 \nReciprocal arrangement between the \nCanada Employment and \nImmigration Commission and the \nUnited States Immigration and \nNaturalization Service, Department of \nJustice, for the exchange of \ndeportees between the United States \nof America and Canada \n1987 \nProvides for the orderly and expeditious return of \ndeportees between the immigration services of \nCanada and the United States (includes 3rd \ncountry nationals) \n14 \nMemorandum of Understanding \nbetween the Canadian Red Cross \nand Citizenship and Immigration \nCanada \n2002 \nProvides for an external monitoring mechanism \nto assess the conditions and treatment of \ndetainees in accordance with international and \ndepartmental standards.\nIN 1 Overview on Information-Sharing \n2005-06-15 \n \n13 \n \nA.3 Canada / U.S. Agreements and Arrangements \nTable 7: Canada / U.S. Agreements and Arrangements \n# \nArrangement / Agreement \nDate signed \nDescription \n1 \nStatement of Mutual \nUnderstanding on Information \nSharing (SMU) with the U.S. \nImmigration and Naturalisation \nService (INS) and the U.S. State \nDepartment \n1999 \nrenewed \n 2003 \nThe 2003 arrangement permits the exchange of \ninformation, including pro-active sharing, on a \ncase-by-case basis. It includes provisions for \nincorporating annexes for systematic information \nexchanges. \n2 \nAnnex Regarding the Sharing of \nInformation on Asylum and \nRefugee Status Claims to the \nStatement of Mutual \nUnderstanding on Information \nSharing \n2003 \nAn annex to the SMU permitting the exchange of \npersonal information on asylum claimants. \n3 \nAgreement Between Canada and \nthe United States for Co-operation \nin the Examination of Refugee \nStatus Claims by Nationals of \nThird Countries (Canada-US Safe \nThird Country Agreement) \n2002 \nAn agreement between Canada and the U.S. that \ndiscourages asylum shopping and optimizes \nresource allocation in both participant countries \nand promotes the orderly processing of refugee \nprotection claims in both Canada and the U.S. \n4 \nTUSCAN/TIPOFF Aide-Memoire \nbetween the United States and \nCanada \n1997 \nCitizenship and Immigration Canada and the \nU.S. Department of State share data in order to \ndeny entry to foreign terrorists who may attempt \nto travel to Canada and/or the United States. \n \nA.4 Other International Arrangements and Agreements \nTable 8: Other international Agreements and Arrangements \n# \nArrangement / Agreement \nDate \nsigned \nDescription \n1 \nMemorandum of Understanding on the Removal \nof Hong Kong Residents from Canada \n1996 \n2 \nMemorandum of Understanding on the Removal \nof Canadian Residents from Hong Kong \n1996 \n3 \nMemorandum of Understanding with Hong Kong \non Mutual Co-operation in Combating Illegal \nMigration \n1996 \nPermits sharing of information to the \nextent needed for removal activity and \ncombating illegal migration. \n \n4 \nMemoranda of Understanding between \nCitizenship and Immigration and Transporters. (45 \nMOUs are maintained with airlines operating \nflights into Canada) \nOngoing \nIncludes requirement that airlines \nprovide information pertaining to \npassenger identity, itinerary, etc., in \norder to support efforts to identify \npassengers whose identity is in doubt \nand to assist in deterring organized \nsmuggling activity. \nNote: Hyperlinks: Web links have been provided for the convenience of readers. All links provided are \nworking at the time of the publication and updating of this chapter. Even so, users may experience \nproblems using the hyperlinks when Web addresses are changed by their respective site managers.   \nNote: Listing of agreements and arrangements: This chapter does not contain an exhaustive listing of \nall agreements and arrangements pertaining to the exchange of personal information in citizenship \nand immigration records."
}