{
  "type": "pdf",
  "source": "Part_4.pdf",
  "text": "IP 3 – In-Canada Processing of Convention Refugees Abroad and Members of the \nHumanitarian-Protected Persons Abroad Classes – Part 4 \n \n2011-10-07 \n \n1 \n48. \nJAS Introduction.................................................................................................................................. 2 \n49. \nRoles and Responsibilities under the JAS program ........................................................................... 3 \n49.1. \nCIC’s Role ...................................................................................................................................... 3 \n49.2. \nThe Sponsoring Group’s Role ....................................................................................................... 3 \n49.3. \nThe Service Provider Organization’s (SPO’s) Role ....................................................................... 3 \n50. \nSharing of responsibilities ................................................................................................................... 3 \n51. \nProcessing JAS cases ........................................................................................................................ 3 \n51.1. \nWho can sponsor a JAS case? ..................................................................................................... 3 \n51.2. \nProcess for JAS ............................................................................................................................. 4 \n52. \nJAS under One-Year Window of Opportunity Program (OYW) .......................................................... 5 \n52.1. \nGeneral Guidelines ........................................................................................................................ 5 \n52.2. \nSpecial circumstances --  Separated minors ................................................................................. 5 \n52.3. \nProcedures for processing separated minors, including de facto dependants and \nconsanguineous minors: ............................................................................................................................ 5 \n52.4. \nMonitoring/Tracking – Local CIC ................................................................................................... 7 \n53. \nBasic Orientation ................................................................................................................................ 7 \n54. \nMonitoring JAS sponsorships ............................................................................................................. 7 \n54.1. \nReviews done by Local CICs ......................................................................................................... 7\nIP 3 – In-Canada Processing of Convention Refugees Abroad and Members of the \nHumanitarian-Protected Persons Abroad Classes – Part 4 \n \n2011-10-07 \n \n2 \nUpdates to chapter \nListing by date:  \nDate: 2011-10-07 \nParts 1, 2, 3 and 4 have been amended to remove all references to Source Country Class. \n \nDate: 2010-04-30 \nPart 4 of chapter IP 3 has been completely revised and expanded. Previous versions of this chapter \nshould be deleted. \n1. \nJAS Introduction \nJoint Assistance Sponsorship (JAS) refers to a joint undertaking by the sponsoring group and \nCitizenship and Immigration Canada to sponsor a refugee(s) requiring special assistance and who \nwould benefit from government assistance combined with the additional support of a sponsor. \nThe JAS program enables Sponsorship Agreement Holders (SAHs) and their Constituent Groups \n(CGs) to partner with the Government of Canada in the resettlement of refugees who are \nidentified as having special needs, as outlined below.  \nNote: Groups of Five and Community Sponsors are not eligible to participate in Joint Assistance \nSponsorships. \nVisa offices identify which cases require a JAS. The sponsoring groups do not designate JAS \ncases. \nOften, JAS cases require more than the standard 12 months of government-funded income \nsupport to establish successfully in Canada. Consequently, these refugees are matched with a \nprivate sponsor, in addition to receiving resettlement services and  income support from the \nResettlement Assistance Program (RAP). Under the JAS program, this combination of \ngovernment assistance and private sponsorship is generally offered for up to 24 months. In \nexceptional cases, the private sponsorship component can be extended to 36 months. \nJAS cases do not require that sponsoring groups have the same financial capacity as regular \nprivate sponsorship cases; however, these cases often require considerable dedication in terms of \ntime and effort in helping the clients get established. \nIn order to be eligible for a JAS, the refugee: \n \nmust be a member of the Convention Refugees Abroad Class or the Country of Asylum \nClass;  \n \nmust have a greater need of settlement assistance than other Government Assisted Refugees \n(GARs) because of exceptional resettlement needs such as one or more of the following: \n physical or mental disability which could require treatment in Canada;  \n unusual family configuration such as single-parent families with several young children or \nfamilies consisting only of siblings, one or more of whom has assumed parental \nresponsibilities;  \n separated minors; \n elderly persons; \n other special needs identified by the visa office\nIP 3 – In-Canada Processing of Convention Refugees Abroad and Members of the \nHumanitarian-Protected Persons Abroad Classes – Part 4 \n \n2011-10-07 \n \n3 \n2. \nRoles and Responsibilities under the JAS program \n2.1. \nCIC’s Role \nCIC’s role is to provide JAS refugees with similar assistance as that which is provided to GARs under the \nResettlement Assistance Program (RAP), including income support and access to government-funded \nresettlement services if required. For more information on RAP, refer to IP3 – Part 2 – Resettlement \nAssistance Program. \n2.2. \nThe Sponsoring Group’s Role \nThe sponsor's role is to provide the same type of orientation, settlement assistance and emotional \nsupport as they would provide to a privately sponsored refugee (PSR). Since  these are special \nneeds cases they usually require added sponsor support in terms of time and effort in helping the \nclients get established. JAS clients are eligible to receive the same orientation and resettlement \nservices as GARs. These services are provided by Service Provider Organizations (SPOs).  \nSponsors are encouraged to attend orientation sessions with the JAS clients to maximize their \ncontact with the refugees during their first crucial days and to familiarize themselves with what \ninformation the refugees are receiving. \n2.3. \nThe Service Provider Organization’s (SPO’s) Role \nThe SPO’s role is to provide immediate and essential resettlement services to the JAS clients as \nrequired. Services may include: ensuring temporary accommodation is provided, ensuring \narrangements are in place for newcomers to get from the point of final destination (e.g. airport) to \ntheir temporary accommodation, linking newcomers to mandatory federal and provincial \nprograms, orienting newcomers to income support by ensuring they understand their financial \nresponsibilities, providing basic orientation specific to their immediate needs, and assisting \nnewcomers to access settlement and broader-based services.   \n3. \nSharing of responsibilities \nIt is recognized that the sharing of responsibilities, in particular between sponsors and SPO, could lead to \nsome confusion. For that reason, it is strongly recommended that the CIC RAP officer make arrangements \nfor a meeting between the sponsors and the SPO prior to the planned arrival of the JAS clients. If there \nare family members already in the community who plan to be involved with the JAS clients’ resettlement, \nthey may be invited to attend the meeting. The purpose of the meeting is to clearly outline the roles and \nresponsibilities of all partners and to determine which responsibilities will be handled by which partner. \nThe CIC RAP officer should also attend the meeting.  \nAnnex D – “Checklist for Reception Arrangements on the Arrival and Resettlement of JAS Newcomers” \nshould be completed at this meeting and signed by all parties who will be involved in providing \nresettlement support. Copies should be given to all attendees.  \n \nAfter the clients arrive, if the CIC officer feels it is required, the final section of the Checklist – JAS HOF \nDisclosure of Information – can be completed and signed by the head of family (HOF). A copy of this \nsection of the checklist should be retained by the RAP officer, and a copy given to the head of family. \n4. \nProcessing JAS cases \n4.1. \nWho can sponsor a JAS case? \nOnly SAHs and their CGs can sponsor JAS cases.  \nIn some cases, two SAHs can partner together to support a JAS case.\nIP 3\nIn Canada Processing of Convention\nRefugees Abroad and Members of the\nHumanitarian Protected Persons\nAbroad Classes\nPart 4 (Joint Assistance Sponsorship Program)\nIP 3 – In-Canada Processing of Convention Refugees Abroad and Members of the \nHumanitarian-Protected Persons Abroad Classes – Part 4 \n \n2011-10-07 \n \n4 \n4.2. \nProcess for JAS \nThe following table describes the steps in processing JAS cases. For the overseas processes, \nplease refer to OP 5. \n \nStep \nAction \n1 \nVisa Office \nThe visa officer requests a sponsor by submitting a JAS Referral. For more \ninformation please refer to OP5. \n2 \nMatching Centre \nThe Matching Centre (MC) will  \n review the request for a sponsor as well as information provided by the \nvisa office and CAIPS notes on the case, \n contact the visa office if information is missing or if clarification is required. \n post a brief profile of the case on the JAS/VOR website:  \nhttp://www.cic.gc.ca/jas-pac/index_e.aspx. This website is accessible only \nto local CIC officers and to Sponsorship Agreement Holders (SAHs). \n \nIf additional settlement information is available, the profile on the website will \nrecommend that the sponsor contact either the local CIC office or the MC. \nThe profile will be posted for a maximum of 6 months. In some cases, short-\nterm extensions may be given. If no sponsor has been found within the time \nframe, the profile will be removed from the website and referred back to the \nvisa office. \n \nNote:  For Urgent Protection (UPP) cases the MC will send the profile directly to \nlocal CICs, asking that a sponsor be found urgently and explaining why. \nThese cases will not be placed on the website, due to time constraints. \n3 \nLocal CIC/sponsor \nThe sponsoring group and community should be able to meet the needs of the \nrefugee(s) according to the profile. Some things to look for in a potential \nsponsorship are: \n \nDo(es) the refugee(s) have family in the area? \n \nIs the refugee from an ethnic background that is already \nestablished in the community? \n \nIs there available housing to accommodate the family size? \n \nDoes the community have the proper supports such as medical \nfacilities, trauma counselling, language training etc? \n \nAre there employment opportunities in the community? \n \nAnd any other relevant information. \n \n \n4 \nSponsor/local CIC \n \nOnce the sponsoring group has decided to sponsor the case, they should \nimmediately contact the local CIC to confirm their commitment to submit an \nundertaking to sponsor.  \nThe local CIC will contact the MC so that the profile can be removed from the \nweb site. \nThe local CIC will then provide the pertinent tombstone data to the sponsoring \ngroup (i.e. names, DOB, etc.) so that the appropriate sponsorship undertaking \nforms can be completed and submitted.  \nThe sponsoring group will complete the undertaking forms and submit them to\nIP 3 – In-Canada Processing of Convention Refugees Abroad and Members of the \nHumanitarian-Protected Persons Abroad Classes – Part 4 \n \n2011-10-07 \n \n5 \nthe local CIC office. \nWhen the undertaking has been received at the local office, the CIC officer will \nmail a copy to the MC and to the visa office.  \n \n5 \nLocal CIC \nThe local CIC will notifiy the sponsor  5-10 working days prior to the refugees’ \narrival, when the Notice of Arrival Transmission (NAT) is received.  \n \n5. \nJAS under One-Year Window of Opportunity Program (OYW) \n5.1. \nGeneral Guidelines \nSponsors should be made aware that they are responsible for any additional dependants that have \nbeen declared on the IMM 0008, should they travel to Canada under the One Year Window of \nOpportunity (OYW) program. \nIn cases where the Principal Applicant (PA) was selected under the JAS Program, the PA may \nsubmit a request for the processing of the non-accompanying family members at the local CIC \nresponsible for providing their RAP income support benefits. \nThe local CIC will re-evaluate the level of support required to cover the non-accompanying family \nmembers who will be arriving under OYW.  For example, a case may no longer qualify as a JAS if the \narrival of the non-accompanying family members will provide adequate care and support to the PA. \nFor information regarding eligibility under the OYW, please refer to Section 24 in IP3 Part 2 - \nResettlement Assistance Program. \n5.2. \nSpecial circumstances --  Separated minors  \nIf a refugee minor in the care of a principal applicant (PA) does not meet the definition of family \nmember, but is considered to be an integral part of the PA’s family unit, the visa officer will ensure \nthat the relationship between the minor and the PA is a bona fide dependent relationship. It will be \nflagged in the subject line of the PA file that the case involves a de facto dependant or \nconsanguineous minor. \nFor more information about separated minors please refer to Section 44 – IP 3 Part 3 – Privately \nSponsored Refugees (PSR). \n \n5.3. \nProcedures for processing separated minors, including de facto dependants and \nconsanguineous minors: \nNote: For consanguineous minors, this section applies when the local CIC, upon meeting the blood \nrelative, determines that the relative does not have the resources necessary to care for the minor \nwithout additional support. \n \n52.3.1 For de facto dependants: \n \nNHQ/Matching Centre \nThe case will be posted on the secure JAS website so an appropriate sponsor may be found. \nDetails indicating that the family includes de facto dependants and that the family will rely on the \nsponsor for help in following through with the process to become a legal guardian will be \nforwarded to the local CIC when potential sponsors inquire.  \n \nLocal CIC \n \nchecks the CIC Intranet site for information on the guardianship process and contact \ninformation for the province where the PA and minor will reside.\nIP 3 – In-Canada Processing of Convention Refugees Abroad and Members of the \nHumanitarian-Protected Persons Abroad Classes – Part 4 \n \n2011-10-07 \n \n6 \n \nprovides the sponsor with the guardianship information relevant to the province where the PA \nand the de facto dependent minor will reside.  \n \nensures that the sponsor understands they have a role in assisting the PA to follow through \nwith the guardianship process.  \n \nconfirms the sponsorship undertaking.  \n \ninstructs the visa office and the Matching Centre to proceed with the case (cc Regional \nHeadquarters).  \n \ninforms the provincial Director of child welfare that there is a de facto minor arriving in the \nprovince. The local CIC will specify if the JAS request indicates any concern for the child’s \nsafety and will indicate that the minor will be receiving support from a private sponsor.  \nFrom this point on, normal JAS procedures as outlined earlier can be followed. \n \n52.3.2 For consanguineous minors: \n \nNHQ/Matching Centre \nThe JAS case will be posted on the secure JAS website with a recommended destination (where \nthe relative lives). The Matching Centre indicates on the file, and forwards to the local CIC, that \nthis is a situation of a consanguineous minor being united with a relative in Canada. The relative \nwill rely on the sponsor for support to provide care for the minor and help in following through with \nthe process to become a legal guardian.  \n \nLocal CIC \n \nchecks the CIC Intranet site for information on the guardianship process and contact \ninformation for the province where the relative and the minor will reside.  \n \ncontacts the relative to confirm that they understand their responsibilities as guardian of the \nchild once in Canada.  \n \nmakes sure the relative understands that as guardian they will be responsible for the care and \nprotection of the minor until the minor reaches the age of majority in the province in which \nthey reside.  \n \nencourages the relative to secure legal guardianship, letting them know that the RAP officer \nwill be in touch with information on how to initiate that process once the child arrives in \nCanada.  \n \nwhere necessary, has the relative sign the Immigration Loan/Contribution form [IMM 0500E]  \n \nwhen approached by an interested sponsor, ensures that the sponsor understands their role \nin assisting the family to follow through with the guardianship process. It provides the sponsor \nwith the guardianship information relevant to that province.  \n \nconfirms the undertaking.  \n \ninforms the RAP service provider that a consanguineous minor will be arriving to be united \nwith a relative in Canada and provides the RAP service provider with the necessary \nguardianship information for use during the orientation.  \n \ninforms the visa office and the Matching Centre to proceed with the case (cc Regional \nHeadquarters).  \n \ninforms the provincial director of child welfare that a separated minor will be resettled with a \nfamily member in their province and that a sponsor is in place to help the relative because this \nsituation has special needs.  \n \narranges a meeting with the relative to go over the details involving RAP services and \nsupport.\nIP 3 – In-Canada Processing of Convention Refugees Abroad and Members of the \nHumanitarian-Protected Persons Abroad Classes – Part 4 \n \n2011-10-07 \n \n7 \n5.4. \nMonitoring/Tracking – Local CIC \n \nThe local CIC should conduct a monitoring interview with 100% of the cases (as part of their \nregular monitoring requirements) 7 months after their arrival. This will include a reminder to \nthe PA and sponsor of the importance in following through with the guardianship process.  \n \nAny follow-up action required will be dealt with on a case-by-case basis. \n \nThe local CIC updates the Matching Centre (cc Regional Headquarters) once the monitoring \ninterview has been completed and the file is closed.  \n6. \nBasic Orientation \nJAS cases are entitled to the same orientation services as GARs. These services are provided by \ngovernment-funded service provider organizations (SPOs). \nSponsors should be encouraged to attend orientation sessions with the refugees to maximize their \ncontact with the refugees during their first crucial days and to familiarize themselves with what the \nrefugees do and do not know. \nSponsors should be provided with a schedule of orientation dates and times well in advance, in \norder to facilitate their participation in these sessions. \nBasic orientation, similar to that for GARs, is usually provided by SPOs. It may be delivered by \nlocal CICs in communities without RAP SPOs. \nSponsors should be involved as much as possible in all stages, including: \n \norientation sessions,  \n \nsearch for housing,  \n \naccompanying the refugee(s), as much as possible, to appointments etc. \n7. \nMonitoring JAS sponsorships \n7.1. \nReviews done by Local CICs \nLocal CICs should conduct formal reviews of JAS cases approximately 6 to 10 months after their \narrival in Canada. Earlier intervention may be undertaken in cases of potential sponsorship \nbreakdown or if other problems have been reported to the CIC officer. \nThe purpose of the local CIC review is to determine: \n \nhow the refugee is establishing him/herself; \n \nwhether the refugee’s needs are being met; \n \nif the refugee situation has changed  \n \nif income support is still required . \nNote:   All requests to modify assistance must be done in consultation with RHQ and the sponsor."
}