{
  "type": "pdf",
  "source": "Persons_Serving_Sentences.pdf",
  "text": "ENF 22 Persons serving a sentence \n1 \n2020-03-16 \n \nContents \n1 What this chapter is about.......................................................................................................................... 3 \n2 Program objectives .................................................................................................................................... 3 \n3 Legislative authorities ................................................................................................................................. 3 \n3.1 The Act and Regulations ..................................................................................................................... 3 \n3.2 The Corrections and Conditional Release Act (CCRA) ....................................................................... 5 \n3.3 Forms................................................................................................................................................... 7 \n4 Instruments and delegations ...................................................................................................................... 8 \n5 CBSA policy relating to persons serving a sentence ................................................................................. 9 \n6 Overview of correctional services ............................................................................................................ 10 \n6.1 Federal sentences ............................................................................................................................. 10 \n6.2 Provincial sentences .......................................................................................................................... 10 \n7 Definitions and specific terminology ......................................................................................................... 11 \n7.1 General .............................................................................................................................................. 11 \n7.2 Terminology related to federal offenders ........................................................................................... 13 \n8 Procedure: Identification of inadmissible inmates .................................................................................... 15 \n8.1 Policy on identification of inadmissible persons serving a sentence ................................................. 15 \n8.2 Information sharing ............................................................................................................................ 16 \n8.3 Identification through correctional services ....................................................................................... 16 \n8.4 Information sharing at the federal level ............................................................................................. 17 \n8.5 Information sharing at the provincial level ......................................................................................... 17 \n9 The Impact of A59 .................................................................................................................................... 18 \n10 Case management: Inadmissibility assessment and investigation ........................................................ 18 \n11 Management of risk and effective monitoring ........................................................................................ 19 \n11.1 Assessment of risk .......................................................................................................................... 19 \n11.2 Alternatives to detention .................................................................................................................. 21 \n11.3 Procedures where detention under the IRPA is determined to be necessary following completion \nof the person’s custodial sentence .......................................................................................................... 22 \n11.4 Summary of steps to be completed where detention under the IRPA is determined to be \nnecessary following completion of the person’s custodial sentence ....................................................... 23 \n12 Impact of removal orders on Federal conditional releases under the CCRA ........................................ 24 \n13 Procedure: Removal of persons who are detained ................................................................................ 24 \n14 Cases where the person was sentenced prior to the enactment of the IRPA ....................................... 25 \n15 Case examples ...................................................................................................................................... 26\nENF 22 Persons serving a sentence \n2 \n2020-03-16 \nUpdates to chapter  \n \nListing by date:  \n \n2020-03-16 \nSubstantive and minor changes, as well as clarifications, have been provided throughout the \nchapter. \nNew content has been added to provide more detailed guidance, reflect policy changes and \nensure consistent application of the IRPA.    \nSections have been re-written for clarity and/or moved and re-organized for more logical flow of \ninformation. \n \n2005-12-06 \nChanges were made to chapter ENF 22 in order to reflect the Citizenship and Immigration \nCanada (CIC) and the Canada Border Services Agency (CBSA) policy responsibility and service \ndelivery roles.\nENF 22 Persons serving a sentence \n3 \n2020-03-16 \n1 What this chapter is about  \n \nThis chapter explains an officer's responsibilities and authorities relative to permanent residents \nand foreign nationals who are serving a sentence in a federal or provincial correctional \ninstitution.  \n \nThe chapter outlines the role of the Canada Border Services Agency (CBSA) as it relates to \nprocesses governed by Correctional Services Canada (CSC) and provincial correctional \nservices, and the impact of decisions of the courts as well as federal and provincial parole \nboards on the administration and enforcement of the Immigration and Refugee Protection Act \n(IRPA). It also describes the transitional provisions regarding permanent residents and foreign \nnationals who were sentenced before the IRPA came into force and who are serving sentences \nin provincial and federal correctional institutions. \n \n2 Program objectives  \nThe objectives of the IRPA with respect to its enforcement and inadmissibility provisions are: \n \nto protect the health and safety of Canadians and to maintain the security of Canadian \nsociety; \n \nto promote international justice and security by fostering respect for human rights and \ndenying access to Canadian territory to persons, including refugee claimants, who are \ncriminals or security risks. \nIn collaboration with its correctional partners, the CBSA will achieve government objectives by: \n \nsupporting the IRPA examination, investigation, and removal processes through the \nearly identification of inadmissible permanent residents and foreign nationals who are \nserving a sentence; and \n \nprotecting Canadian society by detaining those who pose a danger to the public or \nsecurity risk and through effective management and monitoring of persons serving a \nsentence who are the subject of IRPA enforcement action. \n3 Legislative authorities  \n3.1 The Act and Regulations   \nThe IRPA provides the authority for an officer to report, arrest, detain, and remove inadmissible \npersons. \nThe following are some relevant legislative authorities to assist an officer in dealing with persons \nserving a criminal sentence who are subject to IRPA enforcement :\nENF 22 Persons serving a sentence \n4 \n2020-03-16 \nTable 1:  Relevant sections of the IRPA  \n \nDescription of IRPA provision \nIRPA \nSection  \nArrest and detention with warrant \nAn officer may issue a warrant for the arrest and detention of a permanent \nresident or a foreign national who the officer has reasonable grounds to believe \nis inadmissible and is a danger to the public or is unlikely to appear for \nexamination, for an admissibility hearing, for removal from Canada or at a \nproceeding that could lead to the making of a removal order by the Minister \nunder subsection 44(2). \nA55(1) \nNotice to the Immigration Division  \nIf a permanent resident or a foreign national is taken into detention, an officer \nshall without delay give notice to the Immigration Division.  \n \nA55(4) \nRelease: officer  \nAn officer may order the release from detention of a permanent resident or a \nforeign national before the first detention review by the Immigration Division if the \nofficer is of the opinion that the reasons for the detention no longer exist. The \nofficer may impose any conditions, including the payment of a deposit or the \nposting of a guarantee for compliance with the conditions, that the officer \nconsiders necessary.  \nA56(1) \n \nOrder to deliver inmate \nIf a warrant for arrest and detention under this Act is issued with respect to a \npermanent resident or a foreign national who is detained under another Act of \nParliament in an institution, the person in charge of the institution shall deliver the \ninmate to an officer at the end of the inmate’s period of detention in the \ninstitution. \n \nA59 \nStay of removal until sentence completed \nA stay of removal applies when a foreign national is sentenced to a term of \nimprisonment in Canada. Officers must not enforce a removal order if the foreign \nnational is an inmate of a penitentiary, jail, reformatory or prison, or if they are \nserving a conditional sentence order in the community.  \n \nThe stay of removal is effective until the sentence being served is completed. \nThe sentence is completed when the foreign national is released from \nimprisonment by reason of expiration of sentence, commencement of statutory \nrelease or grant of parole. \n \n \nA50(b)\nENF 22 Persons serving a sentence \n5 \n2020-03-16 \n3.2 The Corrections and Conditional Release Act (CCRA) \n \nThe Corrections and Conditional Release Act (CCRA) is the law that governs the Correctional \nService of Canada (CSC). CSC is responsible for supervising offenders serving a sentence of \ntwo years or more, and supervises offenders both in custody and in the community. The CCRA \nalso governs the Parole Board of Canada (PBC). The PBC has exclusive authority to grant, \ndeny or revoke the conditional release of an offender. The PBC also has the authority to impose \nspecial conditions on offenders who are supervised in the community on statutory release or \nlong term supervision orders.  \nNote: Under paragraph 16(1)(b) of the CCRA, a federal institution may also house persons \nserving a sentence of less than two years where there are service agreements in place. \n \nTable 2: Relevant sections of the CCRA \n \nDescription of \nProvision under the \nCCRA \n \nCCRA Text \nSection \nof the \nCCRA \nCorrectional \nService of Canada \n(CSC) \nThere shall continue to be a correctional service in and for \nCanada, to be known as the Correctional Service of Canada, \nwhich shall be responsible for \n \n(a) the care and custody of inmates; \n(b) the provision of programs that contribute to the \nrehabilitation of offenders and to their successful reintegration \ninto the community; \n(c) the preparation of inmates for release; \n(d) parole, statutory release supervision and long-term \nsupervision of offenders; and \n(e) maintaining a program of public education about the \noperations of the Service \n5 \nConstitution and \nJurisdiction of \nprovincial Boards \nJurisdiction of boards \nSubject to subsection (2), a provincial parole board for a \nprovince shall exercise jurisdiction in accordance with this \nPart in respect of the parole of offenders serving sentences in \nprovincial correctional facilities in that province, other than \n(a) offenders sentenced to life imprisonment as a minimum \npunishment; \n(b) offenders whose sentence has been commuted to life \nimprisonment; or \n(c) offenders sentenced to detention for an indeterminate \nperiod. \nDay parole jurisdiction \n(2) A provincial parole board may, but is not required to, \nexercise its jurisdiction under this section in relation to day \nparole. \n \n112(1)\nENF 22 Persons serving a sentence \n6 \n2020-03-16 \nIncorporation of \nCCRA by \nreference by \nprovince \nWhere a provincial parole board has been established for a \nprovince, the lieutenant governor in council of the province \nmay, by order, declare that all or any of the provisions of this \nPart that do not otherwise apply in respect of provincial parole  \nboards shall apply in respect of that provincial parole board \nand offenders under its jurisdiction. \n113(1) \nChange of \nprovince of \nresidence \nSubject to any agreement entered into pursuant to this \nsection, an offender who is released on parole in one \nprovince and moves to another province remains under the \njurisdiction of the board that granted the parole. \n114 (1) \nStatutory Release \nSubject to any provision of this Act, an offender sentenced, \ncommitted or transferred to penitentiary is entitled to be \nreleased on the date determined in accordance with this \nsection and to remain at large until the expiration of the \nsentence according to law. \n127 (1) \nContinuation of \nsentence \nAn offender who is released on parole, statutory release or \nunescorted temporary absence continues, while entitled to be \nat large, to serve the sentence until its expiration according to \nlaw. \n128(1) \nFreedom to be at \nlarge \nExcept to the extent required by the conditions of any day \nparole, an offender who is released on parole, statutory \nrelease or unescorted temporary absence is entitled, subject \nto this Part, to remain at large in accordance with the \nconditions of the parole, statutory release or unescorted \ntemporary absence and is not liable to be returned to custody \nby reason of the sentence unless the parole, statutory release \nor unescorted temporary absence is suspended, cancelled, \nterminated or revoked. \n128(2) \nSentence deemed \nto be completed \nDespite subsection (1), for the purposes of paragraph 50(b) \nof the Immigration and Refugee Protection Act and section \n64 of the Extradition Act, the sentence of an offender who has \nbeen released on parole, statutory release or an unescorted \ntemporary absence is deemed to be completed unless the \nparole or statutory release has been suspended, terminated \nor revoked, the unescorted temporary absence is suspended \nor cancelled or the offender has returned to Canada before \nthe expiration of the sentence according to law. \n128(3) \nRemoval order \nDespite this Act, the Prisons and Reformatories Act and the \nCriminal Code, an offender against whom a removal order \nhas been made under the Immigration and Refugee \nProtection Act is not eligible for day parole or an unescorted \ntemporary absence until they are eligible for full parole. \n128(4) \nParole inoperative \nwhere parole \neligibility date in \nfuture \nIf, before the full parole eligibility date, a removal order is \nmade under the Immigration and Refugee Protection Act \nagainst an offender who has received day parole or an \nunescorted temporary absence, on the day that the removal \norder is made, the day parole or unescorted temporary \nabsence becomes inoperative and the offender shall be re-\nincarcerated. \n128(5)\nENF 22 Persons serving a sentence \n7 \n2020-03-16 \nException \nAn offender referred to in subsection (4) is eligible for day \nparole or an unescorted temporary absence if the removal \norder is stayed under paragraph 50(a), 66(b) or 114(1)(b) of \nthe Immigration and Refugee Protection Act. \n128(6) \nException \nWhere the removal order of an offender referred to in \nsubsection (5) is stayed under paragraph 50(a), 66(b) or \n114(1)(b) of the Immigration and Refugee Protection Act \non a day prior to the full parole eligibility of the offender, the \nunescorted temporary absence or day parole of that offender \nis resumed as of the day of the stay. \n128(7) \nParole reviews \n \n \nDay parole review \nSubject to subsection 119(2), the Board shall, on application, \nat the time prescribed by the regulations, review, for the \npurpose of day parole, the case of every offender other than \nan offender referred to in subsection (2). \n122 (1) \nFull parole review \nThe Board shall, within the period prescribed by the \nregulations and for the purpose of deciding whether to grant \nfull parole, review the case of every offender who is serving a \nsentence of two years or more and who is not within the \njurisdiction of a provincial parole board. \n123 (1) \nFurther review — \nBoard does not \ngrant parole \nIf the Board decides not to grant parole following a review \nunder subsection (1) or section 122 or if a review is not made \nby virtue of subsection (2), the Board shall conduct another \nreview within two years after the later of the day on which the \nreview took place or was scheduled to take place and \nthereafter within two years after that day until \n(a) the offender is released on full parole or on statutory \nrelease; \n(b) the offender’s sentence expires; or \n(c) less than four months remain to be served before the \noffender’s statutory release date. \n123(5) \n3.3 Forms  \nThe following table includes some common forms that may relate to permanent residents and \nforeign nationals who are serving a sentence in a federal or provincial correctional institution. \nThis is a non-exhaustive list. \nTable 3: Forms \nForm Title  \nForm number  \nWarrant for Arrest  \nBSF499  \nOrder of the Canada Border Services Agency to \nDeliver Inmate (under section 59 of the IRPA) \nBSF498 \nNotice of Arrest under Section 55 of the Immigration \nand Refugee Protection Act  \nBSF561\nENF 22 Persons serving a sentence \n8 \n2020-03-16 \nNotice of Rights Conferred by the Canadian Charter \nof Rights and Freedoms and by the Vienna \nConvention Following Section 55 Immigration and \nRefugee Protection Act Arrest or Detention \nBSF776 \nOrder for Detention \nBSF304 \nNational Risk Assessment for Detention \nBSF754 \nDetainee Medical Needs \nBSF674 \nAcknowledgement of Conditions  \nBSF 821* \nIMM1262** \nAcknowledgement of Conditions for IRPA Section \n34 Cases \nBSF798 \nRequest for Admissibility Hearing/Detention Review \nPursuant to the Immigration Division Rules \nBSF524 \nNotes to File  \nBSF788 \n \n**currently available in GCMS \n* currently available only in CBSA Atlas \n \n4 Instruments and delegations \n \nA4 sets out which Minister is responsible for the administration of the IRPA. The Minister of \nCitizenship and Immigration [also known as Immigration, Refugees and Citizenship Canada \n(IRCC)] and the Minister of Public Safety and Emergency Preparedness (PS) are jointly \nresponsible for the administration and enforcement of the IRPA, however there are some \ndifferences. The IRCC Minister is responsible for the overall administration of the IRPA, unless \notherwise specified. The Minister of PS has the primary responsibility for the administration of \nthe IRPA as it relates to the following:  \n \n• port of entry examinations; \n \n• policy lead relating to enforcement of the IRPA including arrest, detention and removal; \n \n• establishment of policies respecting the enforcement of the IRPA and inadmissibility \nunder A34/A35/A37; and \n \n• declarations referred to under A42.1 (Ministerial Relief provision) \n \nPursuant to A6(1), the responsible Minister has the authority to designate specific persons or \nclasses of persons to carry out any purpose of any provision of the IRPA with respect to their \nindividual mandates as described in A4, and to specify the powers and duties of the officers so \ndesignated. In addition, A6(2) authorizes that anything that may be done by the Minister under \nthe Act and the Immigration and Refugee Protection Regulations (IRPR) may be done by a \nperson that the Minister authorizes in writing. This is referred to as delegation of authority. \n \nA designated authority refers to the position that has been given the legal authority by the \nMinister to carry out the delegated function.\nENF 22 Persons serving a sentence \n9 \n2020-03-16 \nThe Delegation of Authority and Designations of Officers (D & D) instruments stipulate who has \nthe authority to perform specific immigration-related functions. CBSA officials should always \nconsult the D & D instruments with respect to their authorities to take any enforcement \naction under the IRPA, including the issuance of warrants and arrests under A55, writing \nA44(1) reports, reviewing reports under A44(2) and release on conditions under A44(3). \nFor example, under the CBSA D & D instrument, the designated authority to issue warrants for \narrest under A55(1) for permanent residents is different from the authority for issuing warrants \nfor foreign nationals.    \n \n5 CBSA policy relating to persons serving a sentence \nThe CBSA is responsible for providing integrated border services that support national security \nand public safety. As part of its legislative mandate, the CBSA uses offender information to \nidentify and investigate permanent residents and foreign nationals who are inadmissible to \nCanada in order to enforce the objectives of the IRPA and ensure the safety of Canadians.   \nTo achieve program objectives, the CBSA tracks criminally inadmissible inmates through the \nfollowing priorities: \n \nearly identification of inmates who are permanent residents and foreign nationals who are \nserving sentences in federal or provincial correctional institutions; \n \ncommunication with correctional partners to ensure that persons who are serving \nsentences and subject to a removal order under the IRPA are not released in \ncontravention of the CCRA; \n \ncooperation and communication with partners to ensure that at full parole or statutory \nrelease, inmates subject to an IRPA warrant (for examination, admissibility hearing, \nremoval or a proceeding that could lead to the making of a removal order by the Minister) \nare delivered to the CBSA for their detention under IRPA where a decision is made that \nIRPA detention is necessary; \n \ncommitment to the maintenance of effective working arrangements with CSC and \nprovincial correctional services relating to permanent residents and foreign nationals who \nare subject to IRPA enforcement action; and \n \nminimizing delays in administrative enforcement action taken under the IRPA while a \nperson is serving sentence.  \nIn achieving departmental objectives pertaining to safety with respect to persons serving \ncriminal sentences, an enforcement officer will: \n \ndevelop and maintain good working relationships and sound networking systems with a \nbroad range of partners and key contacts; \n \nbe proactive in obtaining and sharing information with CSC and provincial correctional \nservices pursuant to information sharing agreements and privacy legislation regarding \npermanent residents and foreign nationals serving a sentence to ensure appropriate \nenforcement action under the IRPA; \n \nconduct appropriate risk assessments for persons serving sentence who are subject to \nIRPA enforcement action to determine, at the earliest opportunity and taking into \nconsideration alternatives to detention and the IRPA objectives regarding the safety and \nsecurity of Canadians, a strategy in regards to detention/release and appropriate \nmonitoring upon the person’s release from criminal detention;\nENF 22 Persons serving a sentence \n10 \n2020-03-16 \n \nwhere the continued detention of an individual serving a sentence is determined to be \nnecessary under the provisions of the IRPA, issue a warrant for arrest and A59 order to \nthe person in charge of the institution and notify the institution of their legal obligations \nunder A59 at the end of the inmate’s sentence; \n \ninvestigate leads from key partners and take appropriate action; and \n \ninvestigate permanent residents and foreign nationals serving a sentence who are \nsuspected to be inadmissible and, where appropriate, gather evidence, prepare reports \nunder A44(1) and ensure timely processing of cases within the immigration enforcement \ncontinuum, in accordance with the provisions of the IRPA.  \n \n6 Overview of correctional services \n \nCorrectional services operate on both the provincial and federal level. A person serving a \ncustodial sentence of two years or more falls under federal jurisdiction; a person who receives a \ncustodial sentence of less than two years will serve their sentence in a provincial correctional \nfacility.   \n6.1 Federal sentences \n \nCBSA policy with respect to the management of inadmissible permanent residents and foreign \nnationals serving a federal sentence in Canada is achieved through the IRPA and the CCRA \nand managed by the CBSA and CSC. While CBSA requires offender information from CSC, \npursuant to its mandate, CSC requires information regarding the immigration status of persons \nsubject to IRPA enforcement as they relate to federal offenders in order to enforce their \nmandate under the CCRA.  \n \nOffenders serving a federal sentence are managed by CSC. As part of the information sharing \nagreement with CSC, CBSA is informed of offenders admitted into a federal institution \n(penitentiary) where there is reason to believe that the offender is not a Canadian citizen, so \nthat CBSA may determine their immigration status and if any immigration enforcement is \nwarranted. In turn, CBSA provides CSC with information it requires to conduct sentence \nmanagement in accordance with the provisions of the CCRA. A person subject to arrest and \ndetention under the IRPA who is serving a federal sentence will be transferred to either a \nprovincial correctional facility or an immigration holding centre (IHC) at the end of their \nsentence, as persons on immigration hold are not ‘housed’ in federal facilities. Moreover, CBSA \nis responsible for making the necessary transportation arrangements to transfer an inmate from \nthe Federal facility at the end of their sentence. \n6.2 Provincial sentences \n \nProvincial correctional services generally have jurisdiction over offenders 18 years of age and \nover who are:  \n \nsentenced to terms of imprisonment of less than two years  \n \nterms of probation of up to three years  \n \nconditional sentences of up to two years less a day  \n \noffenders under parole supervision, as granted by a provincial parole board  \n \nadults on remand, awaiting trial or sentencing  \n \noffenders awaiting transfer to federal institutions to serve sentences of two years \nor more.\nENF 22 Persons serving a sentence \n11 \n2020-03-16 \nIn such cases, provincial correctional services establish, maintain and operate adult correctional \ninstitutions and probation and parole offices. Provincial correctional services also have \njurisdiction over adult offenders under parole supervision, as granted by a provincial parole \nboard (Quebec and Ontario). \n \nIn addition, adults held in immigration detention under the IRPA may be housed in a provincial \nfacility following an arrest/detention under A55, depending on the results of the National Risk \nAssessment for Detention (NRAD). For further information, see ENF 20 Detention. \n \n \n7 Definitions and specific terminology \n7.1 General  \nThe following general terms relate to the serving of criminal sentences in Canada. Some terms \nmay be more applicable within the context of sentences served under provincial jurisdiction; \nothers apply to sentences served under both federal and provincial jurisdiction.1 \nTable 3:  General terms pertaining to persons serving a sentence \nTerm \nDescription \nSentence \nA sentence is a ruling handed down by a court in the criminal \njustice system which determines an accused person's punishment \nafter the person is found guilty or pleads guilty at trial. The Court \ncan impose different types of sentences or combinations of \npenalties.  \nConcurrent sentence \nA concurrent sentence is merged and served simultaneously with \nanother sentence. It is also referred to as an ‘aggregate’ or \n‘combined’ sentence. For example: a person who receives a \nsentence of two concurrent terms of 6 months each would serve a \n6-month sentence, not a sentence of 12 months. \nSentences are merged in order to calculate a person's parole \neligibility date, discharge possible date and warrant expiry date.  \nConsecutive sentence \n \n718.3(4) CCC \nConsecutive sentences are served separately, one after the other.  \nFor example: a person who receives a sentence of  two consecutive \nterms of 6 months each would serve a 12-month sentence. \nUnder the Criminal Code of Canada (CCC), sentences are \nconcurrent unless otherwise specified by the court. \nIntermittent sentence \n \n \n \nAn intermittent sentence may be imposed for a sentence of 90 days \nor less and is served in blocks of time on specific days of the week \n(e.g., on weekends). \nAn intermittent sentence must be accompanied by a probation order. \n                                                           \n1 Sources referenced include: Department of Justice (https://www.justice.gc.ca); Correctional Service Canada \n(https://www.csc-scc.gc.ca); Parole Board of Canada (https://www.canada.ca/en/parole-board.html); Ontario Ministry of the \nSolicitor General (https://www.mcscs.jus.gov.on.ca/english/default.html). For further details, please refer to these \npublications.\nENF 22 Persons serving a sentence \n12 \n2020-03-16 \nConditional sentence \n742.1 CCC \nA conditional sentence is served in the community under \nsupervision rather than in a correctional facility.  \nIf the person does not meet the conditions imposed by the court, \nthey may be returned to court and ordered to serve some or all of \nthe remainder of the sentence in custody. \nNote: In Tran v. The Minister of Public Safety and Emergency \nPreparedness, (2017 SCC 50), the Supreme Court of Canada  \nruled that conditional sentence does not constitute a “term of \nimprisonment” for the purpose of determining inadmissibility for \nserious criminality under A36(1)(a). \nParole \nParole is a form of release granted by the PBC or a provincial \nparole board that allows persons serving sentences in provincial or \nfederal custody to serve the remainder of their sentence in the \ncommunity under the supervision of a probation/ parole officer. \nMost provincial offenders are able to apply for parole. In Ontario \nand Quebec, provincial parole boards are responsible for the \nrelease of offenders from incarceration, outside the normal \nexpiration of sentence.  \nProbation \nProbation is a court disposition that allows the person to be in the \ncommunity following the completion of their sentence subject to \nconditions set out in a probation order. The person is supervised by \na probation officer. \nAbsolute or Conditional \ndischarge \nA disposition where the court orders that accused be discharged of \nan offence after a finding of guilt, and no conviction is registered. \nThe court may then grant an absolute discharge (no conditions) or \nimpose conditions for a specified period of time as set out in a \nprobation order and the accused will be discharged when the \nconditions are met (conditional discharge). If an offender is \nconvicted of a subsequent offence during the term of probation, the \ncourt may decide to revoke the probation order and impose any \nsentence that could have been imposed at the time the order was \nmade.  \nSuspended Sentence \nA conviction where the passing of sentence is suspended.  \nLike a conditional discharge, the order may be revoked if a \nprovision is in place for revoking the order. \nParole Board of \nCanada (PBC) \nAn independent administrative tribunal which reports to Parliament \nthrough the Minister of Public Safety. The PBC operates under the \nauthority of the CCRA and has exclusive authority to grant, deny, \nand revoke parole for offenders serving sentences of two years or \nmore. \nThe PBC also makes parole decisions for offenders serving \nsentences of less than two years in all provinces and territories \nexcept Ontario and Quebec, which have their own parole boards.\nENF 22 Persons serving a sentence \n13 \n2020-03-16 \nDay Parole \nThe authority granted to an inmate by the PBC or a provincial \nparole board to be at large during that inmate's sentence in order to \nprepare the inmate for full parole or statutory release. Eligibility for \nday parole is six months into the sentence or six months before full \nparole, whichever is later.  \nDay parole requires the inmate to return to a penitentiary, a \ncommunity-based residential facility or a provincial correctional \nfacility each night unless otherwise authorized in writing. \nCorrectional services \nBoth federal CSC and its provincial counterparts \n7.2 Terminology related to federal offenders \nThe following table contains terms that pertain to persons serving a federal sentence and types \nof federal releases under the CCRA for which persons serving a federal sentence may be \neligible during their incarceration: \nTable 4: Terms pertaining to persons serving a federal sentence \nTerm \nDescription \nPenitentiary \nSection 2(1) of the CCRA describes a penitentiary as  \n(a) a facility of any description, including all lands connected therewith, \nthat is operated, permanently or temporarily, by the CCRA and \n(b) any place declared to be a penitentiary pursuant to section 7 of the \nCCRA \nConditional \nrelease \nThe PBC has sole authority to grant both day parole and full parole to \nFederal offenders under the CCRA, based on information and \nassessments prepared by CSC prison and community staff. Before \ngranting conditional release, Parole Board members must be satisfied that \nthe offender will not pose undue risk to the community and will fulfill \nspecific conditions. \nFull Parole \nA form of conditional release by the PBC that allows an offender to serve \npart of a prison sentence (normally 1/3) in the community under specific \nconditions. The offender is placed under supervision and is required to \nabide by conditions designed to reduce the risk of re-offending, and to \nfoster reintegration of the inmate into the community. Under full parole, the \nperson does not have to return nightly to an institution, but must report \nregularly to a parole supervisor, and in certain cases, to the police. If the \noffender is performing successfully in the community, full parole may \ncontinue, under supervision, for the remainder of the sentence. \nOffenders (except those serving life sentences for murder) are eligible to \napply for full parole after serving either 1/3 of their sentence, or seven \nyears, whichever is less. \nOffenders serving life sentences for first-degree murder are eligible to \napply for full parole, after serving 25 years. Dates for offenders serving life \nsentences for second-degree murder are set between 10 and 25 years\nENF 22 Persons serving a sentence \n14 \n2020-03-16 \nDay Parole \nSee definition in section 7.1 above \nEligibility to apply for day parole for federal offenders: \n \nOffenders serving sentences of two years or more:  6 months before  \nfull parole eligibility date (PED) or 6 months into the sentence, \nwhichever is greater \n \nOffenders serving life sentences: 3 years before PED \nTemporary \nAbsences \nThe first type of release that an offender may receive. Under the CCRA, \nthere are three types of temporary absences from prison: escorted \ntemporary absences (ETA), unescorted temporary absences (UTA) and \nwork releases. Such releases may be authorized for various reasons, \nincluding for work in community service projects, contact with family, \npersonal development, and medical reasons. \nEscorted \nTemporary \nAbsence (ETA) \n \nCCRA s. 17 \nA release of temporary duration in which an offender, either alone or as a \nmember of a group, leaves the institution accompanied by one or several \nescorting correctional officers. The duration of the ETA is limited. Medical \nabsences, however, may be unlimited. Offenders may apply for ETAs at \nany time during their sentence. Most ETAs are at the discretion of the \nCSC, however others (e.g. for some life sentences) must be approved by \nthe PBC.  \nUnescorted \nTemporary \nAbsence (UTA) \n \nCCRA s. 116 \nA release of temporary duration in which an offender leaves the institution \nunaccompanied by CSC staff. Offenders must have served a portion of \ntheir sentence before being eligible to apply for a UTA.  \n \nFor sentences of 3 years or more: offenders are eligible for UTAs after \nserving 1/6 of their sentence \n \nFor sentences of 2-3 years: offenders are eligible at 6 months into the \nsentence  \n \nOffenders serving life sentences are eligible for UTAs 3 years before \ntheir full parole eligibility date  \n \nOffenders classified as maximum security are not eligible for UTAs  \nAccelerated Day \nParole \nA streamlined process of review (Accelerated Parole Review or APR) for \nday parole for first-time offenders serving a sentence for a non-violent \noffence. It is a conditional release granted by the PBC if the inmate meets \ncertain criteria. The eligibility date for accelerated day parole is at 1/6 of \nsentence or six months into the sentence, whichever is later. APR is only \navailable to offenders who were sentenced prior to March 28, 2011; in \nBritish Colombia, this eligibility is extended to offenders who committed an \noffence before March 28, 2011, but who were sentenced on or after that \ndate. \nStatutory Release \nDate  \n \nCCRA s. 127 \nStatutory release is a mandatory release by law. It is not a form of parole \nand is not a decision of the PBC; rather, it is an inmate's legal entitlement \nto be released into the community at 2/3 of the sentence. Unlike parole, \nstatutory release is a right, not a privilege. Statutory Release requires \nfederally sentenced offenders to serve the final third of their sentence in \nthe community, under supervision and under conditions of release similar \nto those imposed on offenders released on full parole. Offenders serving \nlife or indeterminate sentences are not eligible.\nENF 22 Persons serving a sentence \n15 \n2020-03-16 \nOffenders on statutory release are offenders who either did not apply for \nparole, or who were denied release on full parole. Although statutory \nrelease is legislated (i.e. it is not 'conditional' and is not granted by the \nPBC), the PBC can keep an offender in the institution after his/her \nstatutory release where there are reasonable grounds to believe that the \noffender is likely to commit an offence causing serious harm or death, a \nsexual offence involving a child or a serious drug offence.  \n \nOffenders on statutory release are required to follow standard conditions \nincluding reporting to a parole officer. In some instances offenders on \nstatutory release are required to reside in a halfway house or community \ncorrectional centre operated by CSC. \nWarrant Expiry \nDate \nThe final date in the inmate's current sentence. \nRelease on Expiry \nof Sentence \nRelease on expiry of sentence is not a conditional release; it is the full \nrelease required when the entire sentence has been served.  \nWork release \n \nCCRA s. 18 \nA structured and supervised program of release, established for a \nspecified period of time, involving work or community service outside the \npenitentiary. Offenders who are eligible for a UTA are also eligible to apply \nfor a work release. \nCSC’s Offender \nManagement \nSystem (OMS) \nA CSC database containing sentence information on every offender under \nfederal jurisdiction. Access to CSC offenders' information is based on \ngoverning legislation to ensure that partner organizations receive only the \ninformation required to perform their duties, and to which they are legally \nentitled. Based on a memorandum of understanding (MOU), CSC has \ngranted CBSA access to OMS whereby certain officers can consult \nrelevant offender information and also input data related to an offender's \nimmigration status. \n \n \n8 Procedure: Identification of inadmissible inmates   \n8.1 Policy on identification of inadmissible persons serving a sentence  \nIdentifying and monitoring inadmissible foreign nationals and permanent residents who are \nserving a sentence in Canada is essential to CBSA’s ability to achieve its statutory objectives.  \nThe identification of inadmissible foreign nationals and permanent residents serving sentences \nis dependent on the interrelationship between CBSA and other government institutions, \nincluding CSC, the provincial correctional facilities, the provincial courts and police agencies.   \nMaintaining effective liaison practices and processes ensures that foreign nationals and \npermanent residents are identified early in their sentence, investigated and tracked to ensure \nthat appropriate enforcement action can be taken by CBSA. In this way, the development and \nmaintenance of working arrangements with key partners within the judicial system are crucial to \nCBSA investigations. \nAs officers respond to information or leads regarding permanent residents and foreign nationals \nserving a sentence, they should follow established investigative procedures. These include \ncitizenship determination, interviewing of individuals, fact-finding, recording of evidence,\nENF 22 Persons serving a sentence \n16 \n2020-03-16 \npreparation of reports and execution of appropriate documents relevant to CBSA enforcement \nmeasures.  \nFor further guidance, officers should refer to ENF 7 Investigations and arrests, ENF 5 Writing \n44(1) reports, and ENF 6 Reviewing reports under A44(2). \n8.2 Information sharing \nIdentifying inadmissible foreign nationals and permanent residents who are serving sentences is \nachieved through information sharing with correctional services, police services and the criminal \ncourts. Officers will access different sources of information in their efforts to identify incarcerated \npermanent residents and foreign nationals serving sentences.  \nWhen obtaining and disclosing information obtained from a third party, CBSA officers must be \naware of their legal obligations under written collaborative arrangements and privacy legislation. \nIn all cases, officers are required to assess the accuracy and reliability of information received, \nand properly characterize this information in any further dissemination.  \nInformation sharing agreements make it possible to effectively manage information between \norganizations in order to ensure effective monitoring through data exchange.  Even where there \nis no formal written agreement in place, the Privacy Act may authorize the disclosure of \ninformation under a government institution’s control to another government body. For example, \nunder the Privacy Act, a government institution may disclose personal information to another \ngovernment institution for the purpose for which the information was obtained or compiled by \nthe institution or for a use consistent with that purpose [8(2)(a)]. \nCBSA employees are responsible for ensuring that personal information is only disclosed in \naccordance with the Privacy Act and should be guided by the CBSA Policy on the Disclosure of \nPersonal Information: Section 8 of the Privacy Act. \nCBSA officers should also consult the CBSA Information Sharing Toolkit, including the Written \nCollaborative Arrangements Toolkit. \n8.3 Identification through correctional services \nOfficers will liaise regularly with correctional institutions in accordance with regionally \nestablished procedures and written collaborative agreements to ensure that permanent \nresidents and foreign nationals subject to enforcement action under the IRPA are managed \neffectively through the Sentence Management offices of correctional services.  \nGenerally, CBSA may require the following information from correctional facilities: \n \noffender details \n \ndate of committal \n \ndate and details of conviction(s) \n \ndocumentation to substantiate conviction (e.g.’ warrant of committal) \n \nstatutory release date \n \nwarrant expiry date \n \nparole eligibility date \n \nparole board decisions \n \ncorrectional service reports\nENF 22 Persons serving a sentence \n17 \n2020-03-16 \nFor further information on documentation that may be required to establish inadmissibility under \nthe IRPA, see ENF 2 Evaluating Inadmissibility. \nLikewise, correctional services may request information from CBSA in order to achieve their \nmandates, for example: \n \nconfirmation of offender’s status/citizenship \n \ninformation pertaining to removal orders issued under the IRPA \n \nstage of an offender’s immigration proceedings under the IRPA. \n8.4 Information sharing at the federal level \nFor federal offenders, information sharing is achieved primarily through extraction and inputting \nof relevant information into CSC’s OMS in relation to the offenders status, and whether the \nCBSA intends to arrest and detain the offender upon completion of their sentence. For CSC, \ninformation from the CBSA is entered by a designated CBSA official into CSC’s OMS to \nfacilitate effective file management. OMS terminals are available at various CBSA offices. \nRegional offices must ensure that the running of appropriate OMS reports and monitoring of \noffender information through OMS and parole/probation contacts are utilized in accordance with \nestablished practices and procedures.   \nIn regards to CSC, there is a written collaborative arrangement between CBSA and CSC which \nestablishes the conditions and procedures for the exchange of information between CSC and \nthe CBSA and outlines mutual obligations and responsibilities with respect to management of \ninmates who are subject to enforcement action under the IRPA through data exchange.  \nUnder this agreement, CBSA shall provide to CSC, any information in its possession which is \nrelevant to the risk assessment of the offender, as soon as practicable, for consideration in the \nCSC case management and release decision-making processes. \nFor example, CSC may require the assistance of local CBSA offices when the citizenship of an \ninmate is in doubt. When such a request is made, the CBSA official must inform the CSC \ninstitutional chief, Sentence Management, of the inmate’s citizenship status and indicate \nwhether the inmate is of interest to CBSA and whether enforcement action under the IRPA is \nunderway. \nIn addition, where a person is already under a removal order, CBSA also needs to ensure that \nthe appropriate CSC contacts have been given this information and any related documentation \nthey may require under the CCRA. For further information, refer to section 12 of this manual \nchapter, ‘Impact of removal orders on Federal conditional releases under the CCRA’. \n8.5 Information sharing at the provincial level \nCBSA has specific MOUs with some provinces authorizing the detention of persons detained \nunder the IRPA in provincial correctional facilities (NB, BC, Ontario, Quebec, NS, Alberta).  \nThese agreements also deal with the transfer of custody of a person detained under IRPA at a \nprovincial correctional institution. \nCBSA also has information sharing agreements with some provinces which govern procedures \nsurrounding the exchange of information.\nENF 22 Persons serving a sentence \n18 \n2020-03-16 \n9 The Impact of A59  \nA warrant for the arrest and detention of a foreign national or permanent resident is issued \npursuant to A55(1). Where an immigration warrant has been issued against a person who is \nalready detained under another Act of Parliament (e.g. incarcerated while serving a sentence in \na correctional facility), A59 provides legislative authority for the transfer of the inmate at the end \nof the criminal sentence from correctional services custody into CBSA custody.   \nSection A59 does not legally authorize correctional institutions to continue detention of a person \nonce their sentence is completed and they are released from criminal detention. Rather, A59 of \nthe IRPA imposes an obligation on correctional institutions to notify CBSA that the person’s \ncriminal sentence/detention has ended and turn the person over to CBSA to execute an \nimmigration warrant for arrest and take the person into immigration custody. This means that a \nperson is not legally detained under the IRPA until the immigration warrant is executed. This is \nwhy the section A59 Order (BSF498) must always be coupled with the A55(1) warrant for arrest. \nFor example, when a permanent resident or foreign national subject to IRPA enforcement action \nis eligible for full parole or statutory release, the effect of the A59 order is that the institution \nshall notify CBSA and release the person to the CBSA so that an immigration warrant can be \nexecuted. It is at that point that certain legal processes under the IRPA would be triggered. For \nexample, once detained under the IRPA, the officer shall without delay give notice to the \nImmigration Division (ID) [A55(4)] and the detained person must be brought before the ID within \n48 hours of being taken into detention to review the reasons for detention. \n \nNote:  Persons who are detained in a provincial psychiatric hospital under the jurisdiction of a \nprovincial Review Board are not serving a sentence.  Such persons have been found by a \ncourt or a provincial Review Board to be either not criminally responsible (NCR) or unfit to \nstand trial for criminal offences on account of a mental disorder.  \n \nProvincial Review Boards are independent tribunals established pursuant to the Criminal Code \nof Canada, which stipulates that each province and territory must establish or designate a \nReview Board to oversee these individuals.  \n \nFollowing a finding that an accused is NCR (not criminally responsible) or unfit to stand trial, a \ncourt or a provincial Review Board may make an order directing that the accused be detained in \ncustody in a hospital, subject to such conditions as the court or Review Board considers \nappropriate. Such persons are detained under the jurisdiction of the provincial Review Board \nand are therefore not detained under an Act of Parliament. Therefore, in such cases, an A59 \nOrder cannot be used to impose a legal obligation on the institution to notify CBSA in case there \nis a warrant.  \n \n10 Case management: Inadmissibility assessment and investigation \n \nOnce a CBSA official identifies that a foreign national or permanent resident is serving a \ncustodial sentence, a case review will need to be conducted to determine whether enforcement \naction is warranted and to initiate appropriate enforcement steps under the IRPA.  \n \nOnce the initial investigation confirms that the person is a permanent resident or a foreign \nnational, a preliminary investigation into the status of the person’s admissibility or current\nENF 22 Persons serving a sentence \n19 \n2020-03-16 \nimmigration processes will need to be conducted. Where the facts indicate the presence of an \ninadmissibility (or new/additional inadmissibility), an officer will need to review the file to \ndetermine whether an A44(1) process should be initiated. If necessary, the file will be \ntransferred and assigned to the appropriate office or unit responsible for processing the A44 \ninvestigation.  \n \nOfficers will need to consider the following: \n \n \nIs the person already the subject of a removal order?   \n \nIf so, would an additional A44(1) report and another removal order serve the objectives \nof the IRPA? \nEven where the person is already the subject of proceedings under the IRPA, including removal, \na CBSA officer will need to conduct a case review to determine whether a new A44(1) process \nis warranted. Where it is determined that the person is already under a removal order and no \nnew A44(1) proceedings are warranted, the case will need to be assessed to determine next \nsteps in enforcing the removal order. This may require transferring the file to the appropriate \noffice or unit in the jurisdiction where the person is serving their custodial sentence. Where the \nperson is serving a federal sentence and is already under a removal order, CBSA will also need \nto ensure that CSC has been notified of the removal order in accordance with section 12 of this \nmanual chapter, ‘Impact of removal orders on Federal conditional releases under the CCRA’.  \n \nIn cases where enforcement action originates at the port of entry (e.g., warrant for arrest and \nA59 Order are issued following a criminal arrest by another law enforcement agency), case \nmanagement and monitoring should be coordinated regionally with inland offices and next steps \nwill be determined by the circumstances of the case.   \n \nFor further details on investigating inadmissibility, refer to ENF 7 Investigations and arrests and \nENF 2 Evaluating inadmissibility. \n \nFor further details on writing A44(1) reports, see ENF 5 Writing 44(1) reports.  \n \nFor further information on Minister’s Delegate reviews under A44(2), see ENF 6 Reviewing \nreports under A44(2). \n \n \n11 Management of risk and effective monitoring  \n11.1 Assessment of risk \n \nDuring the initial inadmissibility investigation, a concurrent assessment of the file should also be  \nconducted to consider whether CBSA should seek detention of the permanent resident or \nforeign national upon completion of their sentence, having regard to all of the circumstances of \nthe case. This assessment will also entail considering whether risks can be offset by any \nalternatives to detention, including the imposition of conditions under the IRPA. \n \nRisk identification requires an evaluation of the information available at the time of the \nassessment and includes any information or evidence available that may help predict future \nbehaviour.\nENF 22 Persons serving a sentence \n20 \n2020-03-16 \nFor persons serving a federal sentence, there will generally be an ongoing opportunity to \nevaluate the need for immigration detention prior to the person completing their criminal \nsentence. In general, this will include an initial file review prior to any immigration warrant being \nissued, and an additional assessment of risk factors closer to the statutory release date, prior to \nexecuting any warrant (if one was previously issued, along with the A59 order).  \n \nNote: There is no specific form to document this process, however Notes to File may be used. \nFor further clarity, this is separate from the requirement for a formal risk assessment following \nthe execution of the warrant through the process for completion of the BSF754 form—National \nRisk Assessment for Detention (NRAD). Officers should consult ENF 20 Detention for further \ndetails. \n \nIt is important for officers to keep in mind that, even if during an earlier review of the file it is \ndetermined that the risk can be mitigated upon release from serving sentence, a warrant for \narrest and A59 Order can be issued at a later time where circumstances and facts warrant a \ndifferent assessment.  \n \nConversely, there may be circumstances where an initial review of the case leads to a \ndetermination that IRPA arrest and detention are necessary and therefore that a warrant for \narrest and A59 Order should be issued and filed with the correctional institution. Where \ncircumstances change prior to the completion of the sentence, officers may later determine that \ndetention under the IRPA is no longer necessary. In such circumstances, a delegated officer or \nsupervisor/manager may cancel the warrant where the initial reasons for the warrant no longer \nexist and document the reasons in the Global Case Management System (GCMS) and the \nNational Case Management System (NCMS). See ENF 7 Investigations and arrests for further \ninformation regarding warrant cancellation.  \n \nNote:  A person serving a sentence may already be subject to conditions imposed under the \nIRPA by either CBSA, IRCC or the Immigration and Refugee Board (IRB). In such cases, an \nofficer will need to assess whether the existing conditions are sufficient to offset risks upon \ncompletion of the sentence, whether these conditions have been violated or whether a new \narrest and detention process under the IRPA is warranted.  \n \nRisks are related to the objectives of the IRPA and can generally be divided into: \n \n \nRisk to public safety, as related to A3(1)(h) and A3(2)(g). Public safety is the top priority for \nthe CBSA. When the associated risks to public safety are significant, these risks need to be \nvirtually eliminated before release.    \n \n \nRisk to program integrity. This risk relates to a negative impact on achieving all other \nobjectives of the IRPA. The acceptable degree of risk depends on the specific \ncircumstances of the case. \nFor further details regarding the assessment of risk see ENF 34 Alternatives to detention. \n \nFor persons serving a sentence, a layered approach to the evaluation of risk is generally \nrecommended where circumstances permit:\nENF 22 Persons serving a sentence \n21 \n2020-03-16 \nAn initial file assessment should be conducted once it is determined that CBSA will pursue \nenforcement action under the IRPA against the person serving a sentence. The officer will need \nto consider information such as: \n \n \nNature and extent of recent criminal activity \n \nNature of the conviction and type of sentence imposed; \n \nStatutory release dates; \n \nCircumstances of the offence(s) for which the person was convicted; \n \nPresence of any other serious IRPA inadmissibility (e.g., security, organized crime) \nirrelevant of the conviction(s) for which the person is currently serving sentence; \n \nWhether removal is imminent once the person finishes serving their sentence; \n \nWhether the person is already subject to IRPA conditions imposed by CBSA, IRCC \nor the IRB  \n \nTools identified to manage or mitigate risk upon release from correctional services \ncustody, including those imposed by the criminal courts. \n \nWhere possible, there should be an ongoing evaluation of risk and a final review of the person’s \ncase conducted closer to the person’s statutory release date or anticipated conditional release \nby correctional services. This will be particularly important in cases for persons serving a federal \nsentence who are serving longer sentences and the circumstances pertaining to their level of \nrisk may change over time based on institutional behaviour, programs completed while serving \nsentence, reports from CSC, and PBC decisions/assessments. Officers should liaise with CSC, \nprobation and parole officers, institutional reports and any other relevant documentation \npertaining to institutional programs completed (e.g., anger management) pertaining to the \nperson’s behaviour while serving sentence. Officers assessing risk for federal offenders should \nalso obtain decisions of the PBC to determine conditions of release, including residency in CSC \nfacilities (e.g., half-way houses). Once all available information has been gathered, officers \nshould analyze the information to identify risks, determine whether these risks can be offset, \nand evaluate residual risk. This will require a case-by-case analysis of the information gathered. \n \nNote: This process is not intended to replace the procedures set out in ENF 20 Detentions. \n \nFor further guidance regarding the assessment of alternatives to detention, officers should refer \nto ENF 34, section 8, ‘Assessment of alternatives”. \n11.2 Alternatives to detention \n \nOfficers handling cases for persons serving a sentence should always consider whether \ncontinued detention upon completion of the sentence will be necessary under the IRPA and \nwhether a release plan incorporating alternatives to detention may be appropriate. Where a \nperson serving a sentence is also the subject of enforcement action under the IRPA, it remains \nopen to a delegated CBSA official at any stage to place the person on IRPA conditions following \nan assessment of risk factors and all the circumstances of the case.  \n \nAn alternative to detention (ATD) is any condition that may be imposed on an individual to offset \na risk they represent to the enforcement objectives and the mandate of the CBSA. ATDs include \ngeneral conditions, deposits, guarantees, in-person reporting, and, depending on the region, \nmay include other types of community based supervision tools and electronic supervision tools.\nENF 22 Persons serving a sentence \n22 \n2020-03-16 \nAs part of the arrest process, an officer must consider the factors outlined in R245–R248, \nincluding alternatives to detention, to form a recommendation regarding detention and release. \nOfficers are required to document their assessment of alternatives to detention and the reasons \nthe decision to continue detention or release on the basis of alternatives to detention was made. \nOfficers should refer to ENF 7 Investigations and arrests, ENF 20 Detention and ENF34 \nAlternatives to Detention for further procedural guidance. \n \nFollowing an arrest, if an officer determines that risk can be offset by alternatives to detention \nupon completion of the person’s sentence, the person may be placed on conditions by a CBSA \nofficial [see Acknowledgement of Conditions (BSF821/IMM1262) and Acknowledgement of \nConditions for IRPA Section 34 Cases (BSF798)] unless the person is already subject to \nconditions imposed under the IRPA by the Immigration Division (ID) (for further information, see \nENF 8 Deposits and guarantees). Officers may also consult with their local Community Liaison \nOfficer (CLO) in accordance with ENF 34 Alternatives to detention.   \n \nThe person may also be placed on conditions by a delegated CBSA official at any time during \ntheir sentence prior to the issuance or execution of a warrant (i.e., arrest) unless the person is \nalready subject to conditions imposed by the ID. In such cases, the officer has no authority to \nvary or supersede an order previously issued by the ID. The ID retains jurisdiction with respect \nto the variation of previous terms and conditions imposed by the Board. In circumstances where \nan officer believes that previously imposed conditions by the ID are no longer required or are \ninsufficient to ensure compliance, but may not necessarily require that the person be re-arrested \nfirst, officers will refer the file to Hearings articulating the need to amend the existing conditions \nand request that a Hearings Officer make a request to the ID to vary the order.   \n \nFor further information and guidance on Alternatives to Detention (ATD) Program tools available \nunder the ATD Program and assessment of alternatives to detention, refer to ENF 34 \nAlternatives to detention. \n11.3 Procedures where detention under the IRPA is determined to be necessary \nfollowing completion of the person’s custodial sentence \n \nIf it is determined that detention under the IRPA is warranted following the completion of the \nperson’s sentence, the CBSA officer will need to file an unexecuted warrant for arrest (BSF499) \nand a Section A59 Order to Deliver Inmate (BSF498) with the institutional Chief of Sentence \nManagement. This ensures that the provincial correctional services or CSC are made aware \nthat an inmate serving sentence is subject to enforcement action under the IRPA, and that the \ninmate is to be arrested by a designated official under the IRPA upon completion of their \nsentence. \n \nCBSA officers must then liaise with correctional services to monitor the offender’s detention \nstatus to ensure that on the day that the inmate is eligible for release from criminal detention \n(i.e., custodial sentence ends), an official designated under the IRPA meets the inmate in order \nto execute the immigration warrant and effect the arrest under A55.  \n \nNote: Should the IRPA process change during the time of the sentence following the issuance \nof a warrant, officers must cancel the original warrant and re-issue the warrant under the correct \nIRPA process. For example, where the original warrant was issued for an admissibility hearing \nbut the hearing has taken place and a removal order has been issued, the original warrant shall\nENF 22 Persons serving a sentence \n23 \n2020-03-16 \nbe cancelled and a new warrant issued for removal. In this circumstance, a new A59 Order will \nalso need to be completed. \n \nFollowing an arrest, the officer must also complete all required forms, including a Notice of \nArrest (BSF561), which outlines the circumstances of the arrest and factors that led to their \ndecision to recommend continued detention. In addition, an Order for Detention form (BSF304) \nshall be completed and left with the authority (correctional services) responsible for housing the \nperson. Officers should refer to ENF 7 Investigations and arrests, ENF 20 Detention and ENF \n34 Alternatives to detention for more detailed procedural guidance. \n \nWhere applicable, and depending on an officer’s assessment of detention placement, CBSA \nmay need to arrange for the transfer of the person to another detention facility (provincial \ncorrectional facility or an immigration holding centre) upon completion of the person’s sentence, \nin accordance with CBSA policy and regionally established procedures. It is to be noted that \nfederal correctional service facilities do not house individuals who are on immigration \nhold only. Officers should refer to ENF 20 Detention for further procedural details. \n \nCBSA will also need to send notice to the ID without delay so that a detention review is \nscheduled (BSF524). If the person is not released within 48 hours of their arrest by a CBSA \nofficer, the person is required to have a detention review before the ID. \n11.4 Summary of steps to be completed where detention under the IRPA is \ndetermined to be necessary following completion of the person’s custodial \nsentence \n \nThe following is a summary of required steps and forms to be completed where detention under \nthe IRPA is determined to be necessary following completion of the person’s custodial \nsentence: \n \nPrior to completion of the sentence: \n \n \nUnexecuted warrant for arrest (BSF499) and A59 Order to Deliver Inmate (BSF498) \nissued and left with detaining authority (Sentence Management at correctional facility); \n \nFederal offenders subject to a removal order: ensure that CSC has been notified of an \nexisting removal order and copy of removal order is provided if necessary. \nOnce person has completed custodial sentence: \n \n \nExecute warrant on day sentence is completed (includes conditional releases); \n \nArrest and detention forms completed as required (see ENF 7 Investigations and arrests \nand ENF 20 Detention for further details). \n \nArrange transfer to provincial facility or IHC as appropriate based on detention \nplacement assessment;  \n \nOrder for Detention form (BSF304) issued and left with institution; and \n \nSend notification and request for detention review to the ID.\nENF 22 Persons serving a sentence \n24 \n2020-03-16 \n12 Impact of removal orders on Federal conditional releases under the \nCCRA \nOfficers should be aware that under the provisions of the CCRA, the issuance of a removal \norder against a non-citizen federal offender may impact their eligibility for certain types of \nconditional releases.  \nPursuant to subsection 128(4) of the CCRA, a permanent resident or foreign national is not \neligible for day parole or an unescorted temporary absence (UTA) before their full parole \neligibility date if they are subject to a removal order issued under the IRPA.   \nUnder this provision, if a removal order is issued against the person serving a sentence after \nday parole is granted, the day parole or UTA becomes inoperative and the offender shall be re-\nincarcerated by CSC. It should be noted, however, that this does not apply once the full \neligibility date has passed. \nOfficers should recognize that delays in the timely execution of appropriate enforcement action \nunder A44 [including delays in referring a case to an MD for a review under A44(2) and/or the ID \nfor an admissibility hearing] could have an adverse impact on CBSA’s ability to effectively \nmanage and offset risks posed by permanent residents and foreign nationals serving a federal \nsentence as the person could be granted conditional release by the PBC prior to the issuance of \na removal order. \nIn situations where a removal order is stayed under A50(a), A66(b), or A114(1)(b) of the IRPA, \nthe non-citizen becomes eligible for day parole or UTA under subsection 128(6) of the CCRA. In \nsuch cases, it is the CBSA officer’s responsibility to advise CSC of the change by providing the \nChief of Sentence Management with a copy of the stay order. For further details regarding stays \nof removal, see ENF 10 Removals. \nNotification to CSC for federal offenders \nTo ensure that CSC has all relevant information they require to enforce their mandate under the \nCCRA, CBSA officials must notify CSC when a removal order has been issued against the \nperson in accordance with established procedures. In most cases, this will be achieved through \ncommunication by CBSA to Sentence Management of the correctional institution where the \nperson is incarcerated.   \nCBSA officials are also responsible for ensuring that documents required by CSC though the \ninformation sharing agreement have been completed and provided to the appropriate CSC \nofficials in Sentence Management and that all relevant systems updates (e.g., OMS) have been \ncompleted after a removal order has been issued to a federal offender.  \n \n13 Procedure: Removal of persons who are detained  \n \nIt is important for officers to be aware that a person serving a sentence in Canada, including a \nconditional sentence order being served in the community, is subject to a stay of removal under \nA50(b) of the IRPA and cannot be removed until the sentence is complete. \n \nOfficers can remove detained persons from Canada who:  \n \n \nare in CBSA custody after being arrested and detained under A55 for removal from \nCanada upon completion of a custodial sentence at an institution under the authority \nof A59 at the end of their custodial sentence; or\nENF 22 Persons serving a sentence \n25 \n2020-03-16 \n \nhave been detained pursuant to A81 and ordered released under A82.4 for their \ndeparture from Canada.  \nIn addition, officers should ensure that regionally established procedures are followed when a \nperson under a removal order is serving a sentence in a correctional institution or other \ndetention facility. \n \nFor further information on removal of detained persons, see ENF 10 Removals. \n \n14 Cases where the person was sentenced prior to the enactment of \nthe IRPA  \nThe transitional provisions in the IRPA govern cases where the person was sentenced prior to \nits enactment (June 28, 2002) when the former Immigration Act, 1976, was in force. For \nindividuals sentenced after the coming into force of the IRPA, the provisions of the CCRA will \napply, and the presence of a removal order will render the non-citizen ineligible for UTA or day \nparole until the full parole eligibility date.  \nThe transitional provisions create a parallel system for offenders who were sentenced prior to \nthe coming into force of the IRPA and the date of sentence will determine the legislative \nprovisions and procedures that apply to persons under IRPA enforcement action who are \nserving a federal sentence.  \nFor example, where a person was sentenced prior to June 28, 2002 (i.e., pre-IRPA), they are \neligible for conditional release whether or not they are subject to a removal order. \nConversely, where a person was sentenced on or after June 28, 2002, they are ineligible for \nday parole conditional release until the date of full parole eligibility if they are subject to a \nremoval order. However the person is eligible for day parole conditional release if they are not \nsubject to a removal order before reaching their full parole eligibility date. \nUnder the Transitional provisions: \n \nAn order issued by a Deputy Minister under subsection 105(1) of the former Act (the \n1976 Immigration Act) continues to be in force and the review of reasons for continued \ndetention shall be made under the IRPA (R323); \n \nInmates subject to subsection 105(1) orders under the former Immigration Act are eligible \nfor consideration of day parole, including accelerated day parole or a UTA. If conditional \nrelease is granted by the PBC, the subsection 105(1) order and the Warrant of arrest \nprevent the inmate from being released on day parole or UTA before a detention review \nis conducted by the ID;  \n \nA warrant for arrest and detention made under the former Act is a warrant for arrest and \ndetention made under the IRPA [R325(1)]; \n \nIf an inmate subject to an order under subsection 105(1) of the former Immigration Act is \nordered released by the ID, the subsection 105(1) order is lifted and is no longer valid. If \ndetention is maintained, the detention review will be conducted under the \nprovisions of the IRPA [R322(1)].\nENF 22 Persons serving a sentence \n26 \n2020-03-16 \n15 Case examples \nThe following scenarios are some examples to illustrate case assessments and recommended \nnext steps for managing cases where the permanent resident or foreign national is serving a \nsentence. \nScenario 1    \nNotification is received from CSC that a person serving sentence at a federal correctional facility \nhas been granted bail pending an appeal of their conviction and sentence by a provincial court \nof appeal. The person is already the subject of a removal order issued based on the conviction \nunder appeal. A warrant for arrest under A55 and a section A59 Order to Deliver Inmate have \nalready been issued and filed with CSC Sentence Management by CBSA officials. \nNext steps: \nPrior to executing the warrant, assess risk to determine whether person should be arrested and \ndetained under the IRPA or placed on conditions, including the posting of deposits or \nguarantees. Obtain bail conditions from courts or through CSC to review conditions. Where \ncontinued detention is warranted under the IRPA, execute A55 warrant and complete required \narrest and detention steps, including arrangements for transfer to provincial facility or IHC and \nsend request for detention review to the ID. If determined that release on conditions under the \nIRPA is warranted, ensure that any conditions imposed do not conflict with bail conditions \nimposed by the court. \n \nScenario 2   \nA person is serving a three-year sentence at a federal correctional facility for aggravated \nassault. An investigation confirms that the person is a permanent resident of Canada and that \nenforcement action is warranted based on inadmissibility for serious criminality. A report under \nA44(1) is issued and referred for admissibility hearing by the MD under A44(2).   \nNext steps: \nAssess risk to determine whether person should be detained under IRPA or placed on \nconditions following the completion of their custodial sentence. Where IRPA detention is \nwarranted and depending on the end of sentence expiry and anticipated schedule for \nadmissibility hearing, issue warrant for arrest (for admissibility hearing) and section A59 Order \nto Deliver Inmate. If admissibility hearing concludes before end of sentence and a removal order \nis made at an admissibility hearing, cancel the previous/unexecuted warrant for admissibility \nhearing and issue a new warrant for arrest (for removal) and new section A59 Order to Deliver \nInmate and provide to CSC Sentence Management. Notify CSC of the removal order and \nprovide required documentation. Monitor risk and conduct a further risk assessment closer to \nthe person’s release from serving sentence. \nNote: Where there are no time constraints and the admissibility hearing is anticipated to \nconclude well before end of sentence, officers should defer issuance of warrant and A59, until \nthe admissibility hearing has concluded to avoid having to issue multiple warrants. \n \nScenario 3 \nA person is serving a two-year sentence at a federal correctional facility for fraud. The person is \nissued a deportation order for serious criminality while serving sentence. Prior to the person’s\nENF 22 Persons serving a sentence \n27 \n2020-03-16 \nstatutory release date, CBSA is advised by CSC that the person has been granted conditional \nrelease by the PBC.   \nAn initial evaluation of the file leads an officer to determine that detention under IRPA will not be \nnecessary upon completion of the person’s sentence, taking into account that the fact that the \nperson will be subject to parole supervision until their warrant expiry date and that the prospect \nof obtaining a travel document to effect removal is low. An officer determines that the permanent \nresident does not pose a danger to the public and that flight risk concerns can be offset with \nappropriate conditions. The person is not currently subject to any prior conditions of release \nunder the IRPA.  \nNext steps: \nIt is recommended that no immigration warrant be issued and that CBSA consider placement of \npermanent resident on IRPA conditions (possibly including posting of bonds/guarantees) prior to \ncompletion of the sentence and release from court hold. CBSA will monitor compliance with \nconditions and continue appropriate enforcement action following the person’s release from \ncourt hold. \n \nScenario 4:   \nA federal offender is serving a sentence for a second-degree murder conviction from 1978 (i.e., \npre-IRPA). The person is the subject of a deportation order issued under the former Immigration \nAct of 1976. CBSA is advised that the person has become eligible for conditional release under \nthe CCRA and has applied for release on an unescorted temporary absence (UTA).   \nNext steps:  \nThis case falls under the transitional provisions. CBSA should conduct an assessment of the \nrisks before determining next steps. If it is determined that the person constitutes a high flight \nrisk or danger to the public under IRPA and that continued detention under the IRPA is \nwarranted, CBSA should follow the steps in section 11.3 of this manual chapter, ‘Procedures \nwhere detention under the IRPA is determined to be necessary following completion of the \nperson’s custodial sentence’. This means that the issuance of a warrant for arrest (for removal) \nand a section A59 Order to Deliver Inmate will need to be issued each time the person becomes \neligible for release on UTA. Each time the person is granted a UTA by the PBC, a CBSA officer \nwill need to execute the warrant and request a detention review from the ID each time a UTA is \ngranted. \n \nScenario 5   \nA foreign national who is under a removal order issued after June 28, 2002 is serving a federal \nsentence. An A59 Order to Deliver Inmate and warrant for arrest have already been issued by \nCBSA and provided to CSC Sentence Management. After serving 1/3 of their sentence, the \noffender is transferred to a correctional facility outside the jurisdiction/province of the CBSA \noffice monitoring the file.  \nNext steps: \nNotify the regional CBSA office handling cases from the destination jurisdiction/province of the \ntransfer. Ensure appropriate file transfer for continued monitoring by the new CBSA office. \nNotify the parole officer (CSC) in the new jurisdiction of the immigration hold (i.e. warrant for \narrest and section A59 Order to Deliver Inmate) and provide the contact information for the \nCBSA office now assigned to the file."
}