{
  "type": "pdf",
  "source": "Processing_Applicants_for_the_Live-in_Caregiver_Program.pdf",
  "text": "OP 14 Processing Applicants for the Live-In Caregiver Program \n \n2014-02-10 \n \n1 \nUpdates to chapter ........................................................................................................................................ 2 \n1. \nWhat this chapter is about..................................................................................................................... 4 \n2. \nProgram objectives ............................................................................................................................... 4 \n3. \nThe Act and Regulations ....................................................................................................................... 4 \n3.1. \nForms Required............................................................................................................................. 4 \n4. \nInstruments and Delegations ................................................................................................................ 4 \n5. \nDepartmental policy .............................................................................................................................. 5 \n5.1. \nWhere the initial work permit application is processed ................................................................. 5 \n5.2. \nEligibility criteria [R112] ................................................................................................................. 5 \n5.3. \nEducation [R112(b)] ...................................................................................................................... 5 \n5.4. \nTraining or work experience requirement [R112(c)]...................................................................... 5 \n5.5. \nLanguage ability [R112(d)] ............................................................................................................ 7 \n5.6. \nMandatory employment contract [R112(e)] ................................................................................... 7 \n5.7. \nEmployment contract requirements .............................................................................................. 7 \n5.8. \nEmployment by diplomatic personnel ........................................................................................... 8 \n5.9. \nValidity period of initial LCP work permits ..................................................................................... 8 \n5.10. \nFamily members who wish to accompany a live-in caregiver on a LCP work permit ................... 9 \n5.11. \nFamily members of live-in caregivers who have applied for permanent residence ...................... 9 \n5.12. \nResponding to representations ................................................................................................... 10 \n6. \nDefinitions............................................................................................................................................ 10 \n7. \nProcedure: Offer of employment validation process – ESDC/Service Canada roles and \nresponsibilities ..................................................................................................................................... 10 \n7.1. \nWhen is a new labour market opinion required?......................................................................... 12 \n7.2. \nExpiry date of the labour market opinion .................................................................................... 12 \n7.3. \nLabour market opinion validity and work permit validity dates .................................................... 12 \n8. \nProcedure: Selecting live-in caregivers ............................................................................................... 12 \n8.1. \nHow the process begins .............................................................................................................. 12 \n8.2. \nDocuments required with an LCP work permit application ......................................................... 13 \n8.3. \nAssessing the LCP work permit application ................................................................................ 14 \n8.4. \nStatutory requirements for admissibility ...................................................................................... 17 \n8.5. \nFinalizing the application for a LCP work permit ......................................................................... 17 \n8.6. \nQuebec-bound applicants ........................................................................................................... 18 \n9. \nProcedure: Processing permanent residence applications for family members abroad .................... 18 \n9.1. \nRequirements for the visa office.................................................................................................. 18 \n9.2. \nQuebec cases ............................................................................................................................. 19 \n9.3. \nContacting family members ......................................................................................................... 19 \n9.4. \nFinalizing approved cases ........................................................................................................... 19 \n9.5. \nProcessing files for accompanying family members ................................................................... 20 \n9.6. \nProcessing files for non-accompanying family members ............................................................ 20 \n9.7. \nFinalizing refused cases .............................................................................................................. 20 \n9.8. \nIneligible family members ............................................................................................................ 21 \nAppendix A – Sample letters ....................................................................................................................... 22 \nAppendix B – Fact sheet on employment standards legislation ................................................................. 24 \nAppendix C – Provincial and territorial employment standards .................................................................. 26 \nAppendix D – Counselling fact sheet .......................................................................................................... 27\nOP 14 Processing Applicants for the Live-In Caregiver Program \n \n2014-02-10 \n \n2 \nUpdates to chapter \nListing by date: \n2014-02-10 \nSection 5.4 has been updated to clarify the training requirement at non-accredited \ninstitutions. \n2010-10-27 \nBoth minor and substantive changes have been made throughout this chapter to reflect \nregulatory amendments and administrative changes to the Live-in Caregiver Program \n(LCP) which came into effect on April 1, 2010. It is recommended that any former version \nof this chapter be discarded in favour of this updated version. Significant changes to the \nchapter include the following: \n \nSection 2 reflects regulatory amendments to R113(1)(d) with respect to the employment \nrequirement for permanent residence. \n \nSection 5.7 reflects administrative changes to the LCP employment contract \nrequirements, including implementation of mandatory employer paid benefits and \npublication of revised LCP contract templates (federal and province of Quebec).  \n \nSection 5.9 specifies that a LCP work permit may now be issued for a period of up to four \nyears plus three months where circumstances warrant (e.g., passport validity, LMO/CAQ \nvalidity). \n \nSection 8.4 reflects that the medical examination completed by applicants is assessed by \nmedical officers overseas for excessive demand in anticipation of the applicant \nsubsequently applying for permanent residence under the LCP from within Canada. \n \nAppendix A was updated to correct references to subsection 11(1) of the Act within the \nsample letters. \n \nAppendices B, C and D were updated to ensure accuracy of website references and to \nreflect regulatory amendments to R113(1)(d) with respect to the employment \nrequirement for permanent residence. \n \nAppendix E was deleted. \n2009-12-04 \nThe following changes have been made to link to updated information on the validity of \nLabour Market Opinions. \n \nSection 7.3, now directs to section 6 of chapter FW 1. \n \nSection 8.5, link to FW 1 has been updated. \n \nAppendix B, a link to ESDC’s table on regional wages and working conditions for the Live-\nin Caregiver Program, has been added. \n2009-08-26 \nBoth minor and substantial changes have been made throughout this chapter. It is \nrecommended that any former version of this chapter be discarded in favour of this \nversion. Substantial changes include the following: \n \nSection 4.1 now refers to IL 3. \n \nSections 4.2 and 4.3 were deleted.\nOP 14 Processing Applicants for the Live-In Caregiver Program \n \n2014-02-10 \n \n3 \n \nSection 5.3 includes information concerning Canadian secondary school equivalency and \nthe validity of the documents provided. The following bullet was also removed, as it does \nnot directly pertain to the LCP: be able to compete in the Canadian labour market if they \nleave the care giving field after they become permanent residents. \n \nSections 5.4 and 5.5 add clarification to the training and work experience requirements. \n \nSection 5.6 includes changes that reflect Operational Bulletin 71 – Live-in Caregiver \nProgram Applicants and Official Languages. \n \nSection 5.7 removed reference to the ESDC pilot project in BC. BC is now using the CIC \napplication form that is filled out by the employer. \n \nSection 5.8 now includes clarification of full-time work in Canada. \n \nSection 5.10 includes a new section to reflect Operational Bulletin 25 – Instructions to \nCIC officers concerning the validity period of Live-in Caregiver work permits as well as \nfamily members of Live-in Caregivers. It also contains clarification for situations where a \nlive-in caregiver who applies for a work permit wishes to bring an accompanying family \nmember with them to Canada. \n \nSection 5.11 adjusts the definition of family members to be consistent with OP 2. \n \nSection 6.0 has been removed and the definitions have been relocated to various sections \nof the document. \n \nSection 7 specifies that the ESDC LMO may be issued for a period of up to three years \nplus three months. \n \nSection 7.2 replaces the role of the officer with LMO validity and work permit validity \ndates. It also reflects ESDC’s revised policy on the validity of LMOs. \n \nSection 7.3 clarifies the difference between the LMO expiry date, the LMO duration date \nand the work permit expiry date. \n \nSection 8.3 (2b) provides detail for determining an applicant’s work experience. \n \nSection 8.6 outlines the process for Quebec-bound live-in caregiver applicants. \n \nSection 9.5 includes clarification for the situation where a live-in caregiver applies for \npermanent residence and a non-accompanying family member wishes to become an \naccompanying family member during the processing period. \n2003-10-01 \nThe note at the end of Section 5.8 was changed and now reads: \nNote: If there is anything in the documentation provided by the applicant or the \nemployer, or anything said by the applicant at the interview, that leads the officer to \nbelieve there could be insufficient income, the officer may request the employer to \nprovide evidence of sufficient income from reliable or easily verifiable third party \nCanadian sources. Affidavits would not acceptable as such evidence.\nOP 14 Processing Applicants for the Live-In Caregiver Program \n \n2014-02-10 \n \n4 \nOP 14 Processing Applicants for the Live-In \nCaregiver Program \n1. \nWhat this chapter is about \nThis chapter describes the overseas processing of work permit applications under the \nLive-in Caregiver Program (LCP), and the overseas processing of applications for \npermanent residence from live-in caregivers’ family members living outside Canada. \nProcedures related to in-Canada processing of work permit applications under the LCP \nand the in-Canada processing of applications for permanent residence from live-in \ncaregivers are described in IP 4 – Processing Live-in Caregivers in Canada. \n2. \nProgram objectives \nCitizenship and Immigration Canada (CIC) established this program to meet a labour market \nshortage of live-in caregivers in Canada, while providing an avenue for individuals to work and \neventually apply for permanent residence from within Canada. \nThe LCP brings qualified temporary workers to Canada to provide in-home child care, senior \nhome support care or care of the disabled. The LCP allows applicants to apply for permanent \nresidence from within Canada after being employed full-time as a live-in caregiver for at least 24 \nmonths or a total of 3,900 hours in a minimum of 22 months within the four years immediately \nfollowing their entry into Canada under the LCP. \n3. \nThe Act and Regulations \nFor legislation regarding the LCP, please refer to: \nDefinition of live-in caregiver \nR2 \nLive-in caregiver class \nR110  \nProcessing \nR111  \nWork permits: requirements \nR111, R112 \nPermanent residence \nR113  \nFamily members: requirements \nR114  \nConformity: applicable times \nR115  \n3.1. \nForms Required \nThe forms required are shown in the following table: \nForm Title \nForm Number \nApplication for a Work Permit Made Outside of Canada \nIMM 1295E \nApplication for a Temporary Resident Visa Made Outside of Canada \nIMM 5257E \nAdditional Family Information \nIMM 5406E \nApplication for Permanent Residence in Canada \nIMM 0008EGEN  \n  \n4. \nInstruments and Delegations \nSection 6 of the Immigration and Refugee Protection Act (IRPA) authorizes the Minister to \ndesignate officers to carry out specific powers and to delegate authorities. It also states\nOP 14 Processing Applicants for the Live-In Caregiver Program \n \n2014-02-10 \n \n5 \nthose ministerial authorities that may not be delegated, specifically those relating to \nsecurity certificates or national interest. \nThe Minister of Citizenship, Immigration and Multiculturalism has delegated powers and \ndesignated those officials authorized to carry out any purpose of any provisions \nlegislative or regulatory in instrument IL 3 – Designation of Officers and Delegation of \nAuthority. \n5. \nDepartmental policy \n5.1. \nWhere the initial work permit application is processed \nTo participate in the LCP, a foreign national must make an application for an initial live-in \ncaregiver work permit at a Canadian visa office abroad. \nApplications under the LCP will be reviewed by Canadian visa offices abroad for \ncompleteness pursuant to R10. \n5.2. \nEligibility criteria [R112] \nApplicants who seek to enter Canada as a live-in caregiver and who apply for a work \npermit under the LCP must meet the requirements in R112 whether they intend to \neventually seek permanent residence in Canada or not. \nR200(3)(d) requires such an individual to meet the eligibility requirements in R112. \nOfficers may not issue a work permit under the LCP to persons who will be working in \nnanny-like jobs under the International Exchange Canada programs. Applicants should be \nassessed according to the criteria of the specific program for which they are applying. \nApplicants under the International Exchange Canada programs are not eligible to apply \nfor permanent residence in Canada and their work permit cannot be extended beyond the \nprescribed period. These individuals are not live-in caregivers under the LCP. For further \ninformation, see FW 1 – Temporary Foreign Worker Guidelines. \n5.3. \nEducation [R112(b)] \nAn educational institution, as generally understood, requires the existence of a building or \nbuildings devoted primarily to formal education, training and development. \nApplicants under the LCP must have successfully completed a course of study that is \nequivalent to the successful completion of Canadian secondary school. \nGiven the variation in school systems across countries, this requirement cannot be \nregarded as simply a matter of counting the years of schooling until reaching the number \ntwelve. Equivalency of achievement is what is important. For example, in the Philippines, \n72 credits of post-secondary education is equivalent to the successful completion of \nCanadian secondary school. Fewer than 72 credits is not equivalent. \nOfficers must be satisfied as to the validity of the diplomas/certificates being submitted \nand may refuse a work permit if sufficient proof is not provided. Officers must be \nconfident that the testing that was completed was for the equivalency of the successful \ncompletion of Canadian secondary school. \n5.4. \nTraining or work experience requirement [R112(c)] \nApplicants under the LCP must have completed at least: \n \nsix months of full-time training in a classroom setting in a field or occupation related to \nthe employment for which the work permit is sought; or\nOP 14 Processing Applicants for the Live-In Caregiver Program \n \n2014-02-10 \n \n6 \n \none year of full-time paid employment, including at least six months of continuous \nemployment with one employer, in such a field or occupation within the three years \nimmediately before the day on which they submit an application for a work permit. \nProspective live-in caregivers must meet either the training or work experience \nrequirement in order to be eligible for a work permit under the LCP. \nTraining requirement \nWhile the training must be offered as part of a formal education program at an \neducational institution accredited by the appropriate local education authorities, \naccreditation is not necessarily an endorsement of quality. \nOfficers should assess the quality of the program and whether it is adequate in equipping \nthe applicant to perform the duties required by the proposed job. Where there are \ncaregiver training programs established primarily to provide training to meet Canadian \nrequirements, particularly at non-accredited institutions, it will be necessary to determine \ntheir legitimacy as well as the adequacy of the training. \nFull-time training must be taken for a continuous period of at least six months. \nTraining must be in a field or occupation related to the employment sought. For example, \nprospective live-in caregivers may have training or experience in early childhood \neducation, geriatric care, paediatric or geriatric nursing. \nLive-in caregiver training should be similar to the training offered by Canadian \ncommunity colleges in child care or other related fields. The course load at Canadian \ncommunity colleges averages 25 to 30 hours per week. This does not include activity \nassignments or a practicum. Thus, a student in an educational institution offering live-in \ncaregiver training should be attending classes at least 25 to 30 hours per week. \nIt is acceptable to have some on-the-job training throughout the course as long as the \nclassroom schedule demonstrates that there is a requirement for, and completion of, a \nfull 6 months of full-time training in a classroom setting throughout that course. \nThere is no specific list of courses required by CIC, as CIC is not an education-regulating \nbody. However, visa offices can assess the legitimacy, quality, adequacy and relevance of \nthe training programs offered in their regions, including whether the hours of classroom \ntraining are sufficient. Officers may undertake research concerning the legitimacy of a \ngiven training program and/or educational institution, including if the institution is located \nin another country. In such cases, officers should request assistance from the visa office \nin the country where the educational institution is situated to verify the legitimacy of the \ninstitution and the substance of the training. \nCorrespondence courses and part-time studies, such as training taken on weekends, do \nnot meet the full-time training requirement. \nThe six months of full-time training must be successfully completed prior to the date that \nthe applicant applies for a work permit under the LCP. \nWork experience requirement \nWork experience must be in a field or occupation related to the employment sought. For \nexample, prospective live-in caregivers may have experience in early childhood \neducation, geriatric care, paediatric or geriatric nursing. Caregiving experience in an \ninstitutional setting (day care, crèche, hospital, senior citizens’ home, etc.) should be \nconsidered in assessing whether the applicant meets the experience requirement. \nExperience as a midwife or hospital technician is not acceptable as they do not have \ncaregiving experience related to children, the elderly or people with disabilities.\nOP 14 Processing Applicants for the Live-In Caregiver Program \n \n2014-02-10 \n \n7 \nCaregiving experience in the applicant’s own home would not normally qualify someone \nfor the LCP, as the applicant would not have been in a paid employment situation. \nHowever, there may be legitimate situations where the applicant was employed as a live-\nin caregiver by a relative. Applicants are responsible for satisfying the officer that they \nwere actually paid for the work performed and that their experience was an employment \nrelated one. \nTo claim work experience, prospective live-in caregivers must demonstrate that they \nhave completed at least one year of full-time paid employment related to the job duties \nof a caregiver. This work experience must have occurred within the three years \nimmediately preceding the date that the application for a work permit under the LCP is \nsubmitted. This work experience must include at least six months of continuous \nemployment with the same employer. \nNote: The onus is on the applicant to satisfy the officer that their training or experience \nmeets the requirement of the [R112(c)]. \n \nThis content has been moved as part of our efforts to modernize operational guidance to \nstaff. It can now be found in the Language requirements section. \n5.5. \nLanguage ability [R112(d)] \n5.6. \nMandatory employment contract [R112(e)] \nA prospective employer in Canada interested in hiring a foreign live-in caregiver must \nfirst have their job offer approved by Employment and Social Development Canada \n/Service Canada (ESDC/Service Canada) and obtain from them a positive or neutral \nLabour Market Opinion (LMO). The prospective employer is responsible for ensuring that \nthere is a signed, written employment contract with the prospective live-in caregiver. By \nlaw, the terms and conditions of the employment contract must be consistent with \nprovincial/territorial employment standards and labour laws. The signed employment \ncontract and the employer’s positive/neutral LMO from ESDC/Service Canada are part of \nthe documentation that must be sent by the prospective live-in caregiver to the visa \noffice with their work permit application under the LCP. \nNote: In addition to a legislated requirement, the employment contract is a tool that \nofficers use in their assessment of the application. It also provides officers with \ninformation that may be used in an interview.  \n5.7. \nEmployment contract requirements \nThe employment contract requirements are as follows: \n \nthe contract must include a description of mandatory employer-paid benefits, including:  \no \ntransportation to Canada from the employee’s country of permanent residence or \nthe country of habitual residence to the location of work in Canada; \no \nmedical insurance coverage provided from the date of the employee’s anticipated \ndate of arrival until such time as they are eligible for provincial/territorial health \ninsurance; \no \nworkplace safety insurance coverage for the duration of the employment; \no \nall recruitment fees, including any amount payable to a third-party recruiter or \nagents hired by the employer that would otherwise have been charged to the \nemployer. \n \nthe contract must include a description of:  \no \njob duties which clearly demonstrate that the employee’s primary duty will be \nlive-in caregiving; \no \nhours of work; \no \nwages;\nOP 14 Processing Applicants for the Live-In Caregiver Program \n \n2014-02-10 \n \n8 \no \naccommodation arrangements (including where applicable, room and board); \no \nholiday and sick leave entitlements; \no \ntermination and resignation terms \n \nall terms and conditions outlined in the contract must abide by provincial/territorial \nemployment standards and labour laws; \n \nthe live-in caregiver position being offered must be full-time (minimum of 30 hours per \nweek); \n \nthe employer must have sufficient income to pay the wages and benefits of a live-in \ncaregiver. ESDC/Service Canada will advise employers of the current acceptable wages to \nbe paid, based on the equivalent wages for Canadian live-in caregivers; \n \nthe employer must be residing in Canada; and \n \nthe employer must supply suitable accommodation for the live-in caregiver in a private \nresidence in Canada, such as a private unit or a room with a lock, where they are to \nprovide child care, senior home support care or care for a disabled person. \nNote: An LCP employment contract template is available on the CIC website (PDF, \n212 KB). Employers and live-in caregivers are encouraged to use this contract template \nbut are not obliged to do so. However, effective April 1, 2010, all employment contracts \nsubmitted as part of employer LMO applications under the LCP, and all work permit \napplications received by CIC that are based on these LMOs, must contain all the \ninformation and clauses within the LCP employment contract template. Any additional \nprovisions must not conflict with provincial/territorial labour laws and employment \nstandards. The use of an alternate contract format may delay the processing of the LMO \napplication as ESDC/Service Canada officers will have to do a thorough comparative \nassessment to determine if the contract is compliant with the LCP requirements. \n \nNote: For live-in caregivers destined to Quebec, the Ministère de l’Immigration et des \nCommunautés culturelles (MICC) has its own contract template reflecting Quebec \nprovincial requirements under the LCP. The Quebec contract template is available on the \nMICC website. \n \nNote: Housework, cleaning or other similar domestic duties such as food preparation, \nmay be allowable as a small part of the overall job duties outlined in the employment \ncontract when clearly related to the duties of caring for the individual(s), however such \ndomestic duties cannot be the primary duty of a prospective live-in caregiver. \n5.8. \nEmployment by diplomatic personnel \nDiplomatic personnel may have their live-in caregiver enter and remain in Canada under \nthe LCP, provided the individual is eligible under R112 to become a live-in caregiver and \nthey obtain a work permit under the LCP. The caregiver will be able to apply for \npermanent residence once they have met the requirements of R113. Such an individual \nwill not be considered a member of the diplomat’s personal suite.  \nNote: Domestic staff who enter Canada as accredited members of a diplomat’s suite are \nnot live-in caregivers under the LCP and, as such, are not eligible for permanent \nresidence. \nFor more information see section 5.3 of the FW 1 – Temporary Foreign Worker \nGuidelines. \n5.9. \nValidity period of initial LCP work permits \nThe general policy is for visa officers to issue initial LCP work permits with a validity of up \nto four years plus three months provided the LMO is approved for the same duration by\nOP 14 Processing Applicants for the Live-In Caregiver Program \n \n2014-02-10 \n \n9 \nESDC/Service Canada. This general policy serves to help minimize subsequent in-Canada \napplications for work permit extensions. \nThe four-year period corresponds to the amount of time allotted to a live-in caregiver to \ncomplete the employment requirement of the LCP in order to be eligible to apply for \npermanent residence. The additional three months allow for a transition period to apply \nfor permanent residence under the LCP. \nQuebec regulations allow the issuance of Certificats d’acceptation du Québec (CAQ) for \nthose applicants destined for Quebec in a National Occupational Classification skill level of \nless than B, including live-in caregivers. A CAQ can be issued to live-in caregivers with a \nmaximum validity period of 48 months. As such, live-in caregivers destined for Quebec \nmay be issued a LCP work permit of up to four years provided the CAQ is approved for \nthe same duration by the MICC. \nThe decision on the validity period of the initial LCP work permit remains that of the \nreviewing officer and they are free to depart from the general policy where circumstances \nwarrant (e.g. passport validity, LMO/CAQ validity, etc.). \n5.10. \nFamily members who wish to accompany a live-in caregiver on a LCP work permit \nFamily members do not normally accompany live-in caregivers who are coming to Canada \non a LCP work permit. Even when an employer agrees that a family member may reside \nwith the caregiver in the residence of the persons for whom they are providing care, \nthere are no guarantees that any subsequent employer would agree to the same terms. \nFurthermore, the income of the caregiver may not be sufficient to care for and support \ntheir family member(s) in Canada. \nLive-in caregivers who wish to bring their family member(s) with them while they are on \na work permit under the LCP will not be permitted to do so unless they satisfy an officer \nthat they have sufficient funds to care for and support the family member(s) in Canada, \nthe family member(s) are not otherwise inadmissible and they have permission to live in \nthe home of the person(s) for whom they are to provide care. \n5.11. \nFamily members of live-in caregivers who have applied for permanent residence \nLive-in caregivers who enter Canada under the LCP are eligible to apply for permanent \nresidence after they have worked full-time as a live-in caregiver for at least 24 months or \na total of 3,900 hours in a minimum of 22 months within the four years immediately \nfollowing their entry into Canada under the LCP. To be eligible to apply for permanent \nresidence under the LCP, they must meet the requirements of R113. \nAll family members of live-in caregivers who have applied for permanent residence must \nbe declared and included in the live-in caregiver’s application for permanent residence. All \nfamily members, whether accompanying the principal applicant or not, are required to be \nexamined. All eligible family members must undergo and pass medical, criminal and \nsecurity checks. Live-in caregivers cannot become permanent residents if any of their \neligible family members are inadmissible. \nNormally, an inadmissible family member, whether accompanying or not, would render \nthe live-in caregiver principal applicant and all family members inadmissible. There are, \nhowever, two exceptions to this rule described in R23. The first is a separated \nspouse/common-law partner and the second is a child who is in the legal custody of \nsomeone other than the applicant, or someone other than the applicant is empowered to \nact on behalf of that child by virtue of a court order, written agreement or by operation of \nlaw. \nIf an applicant’s separated spouse/common-law partner or their children in the custody of \nsomeone else are inadmissible, their inadmissibility would not render the applicant \ninadmissible.\nOP 14 Processing Applicants for the Live-In Caregiver Program \n \n2014-02-10 \n \n10 \nAs separated spouses/common-law partners can reconcile and custody arrangements for \nchildren may change, examination is required in order to safeguard the future right to \nsponsor them in the family class. If these family members are not examined, they cannot \nbe sponsored in the family class in the future under R117(9)(d). \nSatisfactory documentary proof of a separation and of custody being with someone other \nthan the applicant is required. A separation agreement or custody papers are examples of \nacceptable proof. \nOfficers will not issue a permanent resident visa to separated spouses or children in the \ncustody of someone else, even if they are examined, as they are non-accompanying. \nIf these family members are genuinely unavailable or unwilling to be examined, the \nconsequences of not having them examined should be clearly explained to the applicant \nand reflected in the CAIPS or GCMS notes. Applicants should be counseled to sign and \nreturn a statutory declaration acknowledging the consequences or inform the Case \nProcessing Centre and visa office that they want the child examined in order to preserve \nfuture sponsorship privileges. \nLive-in caregivers who apply for permanent residence may request concurrent processing \nfor some or all of their family members residing in or outside Canada. Those who are \nprocessed concurrently at a visa office may be issued permanent resident visas once the \nlive-in caregiver becomes a permanent resident. \nFor more details, see section 5.12 of the OP 2 – Processing Members of the Family Class \nchapter and the IP 4 – Processing Live-in Caregivers in Canada chapter. \nNote: Family members who are not processed concurrently may be sponsored as \nmembers of the family class once the live-in caregiver is a permanent resident. \n5.12. \nResponding to representations \nInformation concerning clients should be released only to the applicant or the applicant’s \nauthorized paid or unpaid representative (see section 5.4 of the IP 9 – Use of \nRepresentatives Paid or Unpaid chapter). Prior to responding to a representation, officers \nshould ensure that clients or their representative verify their identity. This applies \nwhether the representation is made in person or by mail. \n6. \nDefinitions \nNil. \n7. \nProcedure: Offer of employment validation process – ESDC/Service \nCanada roles and responsibilities \nESDC/Service Canada is mandated pursuant to R203 to assess the impact that the hiring \nof the temporary foreign worker is likely to have on the Canadian labour market. \nProspective employers in Canada interested in hiring live-in caregivers must first contact \ntheir local ESDC/Service Canada Centre and apply for a LMO. A LMO assesses what \nimpact hiring a foreign worker would have on Canada’s labour market. The foreign \ncaregiver’s work permit application must include proof that the prospective employer \nreceived a positive or neutral LMO from ESDC/Service Canada. \nProspective employers must complete a Foreign Live-in Caregiver Application (EMP 5093 \n(PDF, 665 KB)) available on ESDC’s website. \nThey can apply online or submit a paper application to:\nOP 14 Processing Applicants for the Live-In Caregiver Program \n \n2014-02-10 \n \n11 \nService Canada  \nTemporary Foreign Worker Program \nP.O. Box 6500  \nToronto LCD \nDownsview A \nToronto, ON M3M 3K4 \nFax: 416-954-3107  \nToll free: 1-866-720-6094 \nA full description of the conditions that a prospective employer must meet to hire a \nforeign live-in caregiver, instructions on how to complete the LMO application and a \ndescription of ESDC/Service Canada’s assessment criteria and process can be found on \nthe ESDC website. \nAn ESDC/Service Canada Centre officer reviews the completed LMO application, which \nincludes a copy of the employment contract. In assessing the offer of employment, the \nofficer considers such factors as: \n \nthe need for live-in care; \n \nthe job offer is genuine; \n \nthe employer is offering wages and working conditions that meet provincial/territorial \nemployment standards and labour laws; \n \nthe job duties are that of a full-time live-in caregiver (minimum of 30 hours per week); \nand \n \na reasonable search has been carried out to identify qualified and available Canadian \ncitizens and/or permanent residents and unemployed foreign caregivers already in \nCanada. \nIf satisfied that the offer of employment meets the assessment criteria, the ESDC/Service \nCanada officer issues a letter confirming the positive/neutral LMO to the prospective \nemployer and instructs them to send a copy to the prospective live-in caregiver \nemployee. \nDetails of the positive/neutral LMO are recorded in the ESDC Foreign Worker System \n(FWS) and are available to CIC officers through the FWS/CAIPS or FWS/GCMS link. \nNote: An employer is issued only one positive/neutral LMO by ESDC/Service Canada \nregarding an offer of employment at a time and it must be submitted to CIC to support a \nwork permit application within a maximum of 6 months from its issuance (see section 7.2 \nbelow). \n \nNote: If the LMO application is rejected, the ESDC/Service Canada Centre officer issues a \nrefusal letter to the prospective employer. \nAnyone who employs a live-in caregiver under the LCP is required to: \n \nregister as an employer with the Canada Revenue Agency (CRA); \n \nobtain a taxation number in order to make the proper deductions for income tax, \nemployment insurance and the Canada Pension Plan; \n \nremit these deduction amounts to the proper federal authority; and \n \nprovide their employee with a record of employment when the employee’s job is finished.  \nNote: The CRA provides employers with an information kit that contains the necessary \nforms and explains how to comply with the law. Employers can obtain the record of \nemployment only if they are properly registered as an employer.\nOP 14 Processing Applicants for the Live-In Caregiver Program \n \n2014-02-10 \n \n12 \n7.1. \nWhen is a new labour market opinion required? \nA positive/neutral LMO for an offer of employment is specific to the approved employer \nand job duties.  \nA change of employer will require a new positive/neutral LMO, a new employment \ncontract and a new work permit application. Officers should treat the new LMO request as \na new application in the queue (cost recovery fees apply). \nThis measure is meant to deter abuse by those employment agencies that might try to \nuse a list of fictitious employers in order to bring a “pool” of live-in caregivers to Canada. \nOnce in Canada, these caregivers would be in a position of having entered into a \ncontractual agreement with an employer who does not exist or for whom they will not \nwork. These caregivers are thus in Canada illegally and are vulnerable to exploitation by \nthe employment agency that brought them to Canada. \nA new positive/neutral LMO is also required if it was not used within 6 months of its \nissuance (see section 7.2 below). \n7.2. \nExpiry date of the labour market opinion \nAll LMOs issued by ESDC/Service Canada to employers will be valid for the purpose of \nwork permit applications for a maximum of 6 months from the date of issuance. An LMO \nthat is not submitted to CIC to support a work permit application within this 6-month \nperiod will be deemed to have expired. The employer will be required to apply for a new \nLMO if they still wish to hire a live-in caregiver under the LCP. \nThe LMO expiry date identifies the 6-month period during which: \n \nthe employer must notify the caregiver that the LMO was approved; \n \nthe employer must send the LMO confirmation letter to the prospective live-in caregiver; \nand \n \nthe prospective live-in caregiver must apply for a work permit to CIC (regardless of the \nstart date of the job offer). \nIf these actions do not occur within the period of time identified, the LMO is no longer \nvalid and if the employer still wishes to hire a live-in caregiver, they will be required to \nsubmit a new LMO application to ESDC/Service Canada. \nNote: This strengthens the integrity of LMOs by ensuring CIC has a reasonably accurate \nassessment of labour market conditions when evaluating an application for a work permit \nunder the LCP. \nLive-in caregivers destined for Quebec: Due to ESDC/Service Canada and MICC \nadministrative requirements, a LMO for a live-in caregiver in the province of Quebec is \nvalid for 3 months after the CAQ is issued. This directive applies regardless of the expiry \ndate that may appear on the LMO. \n7.3. \nLabour market opinion validity and work permit validity dates \nRefer to section 6 of the FW 1 (PDF, 1.9 MB) – Temporary Foreign Worker Guidelines \nchapter regarding LMO validity and duration of employment as per the LMO. \n  \n8. \nProcedure: Selecting live-in caregivers  \n8.1. \nHow the process begins \nThe selection process is designed to ensure that the prospective employer and employee \ntake responsibility for obtaining all the necessary information and application forms so\nOP 14 Processing Applicants for the Live-In Caregiver Program \n \n2014-02-10 \n \n13 \nthat the visa offices can focus on rendering a timely final decision on LCP work permit \napplications. \nAfter the prospective employer in Canada obtains confirmation of a positive/neutral LMO \nfrom ESDC/Service Canada, the employer is notified by a letter from ESDC/Service \nCanada stating that the offer of employment has been validated and provides the system \nfile number. The confirmation letter from ESDC/Service Canada: \n \nasks the employer to forward a copy of the ESDC/Service Canada LMO confirmation letter \nand the signed employment contract to the prospective live-in caregiver;  \n \ntells the employer to have the live-in caregiver applicant check the applicable visa office’s \nwebsite for information about the work permit application process. The visa office website \nwill instruct the applicant to download the application forms or, in a few cases, contact \nthe visa office to obtain the application forms; and  \n \nsuggests that employers download the application forms from the applicable visa office’s \nwebsite and send them to the live-in caregiver applicant if they are concerned about the \napplicant’s access to the Internet. \nThe confirmation letter from ESDC/Service Canada also advises the employer to instruct \nthe live-in caregiver applicant to send the work permit application and all required \nsupporting documentation, including the signed mandatory employment contract and a \ncopy of the LMO confirmation letter, to the appropriate visa office. \nNote: The selection process begins when the visa office receives the completed \napplication form and all other required documents from the applicant. \nThe officer checks the FWS (through the FWS/CAIPS or FWS/GCMS link) using the \nsystem file number provided in the LMO confirmation letter to verify that ESDC/Service \nCanada has validated the offer of employment under the LCP. \n8.2. \nDocuments required with an LCP work permit application \nIn addition to the regular documentation required for a work permit application (see the \nFW 1 (PDF, 1.9 MB) – Temporary Foreign Worker Guidelines chapter), the applicant \nshould provide: \n \nproof of having completed the equivalent of Canadian secondary school; \n \nproof of six months of full-time training in a classroom setting or one year of full-time \npaid employment related to the job in question within the last three years, including at \nleast six months of continuous employment with one employer; \n \na valid passport; \n \na police certificate from all areas where the applicant has resided (not mandatory until \nthe time of application for permanent residence, but easier to provide from the home \ncountry than from Canada. If this is not provided, it is not a reason to refuse a work \npermit unless the officer believes the applicant would be inadmissible on criminal \ngrounds); \n \nan original birth certificate, original marriage certificate where applicable and, if \nseparated or divorced, original certificates or, if certificates are not available, written \nevidence of marital status (this is particularly important in countries where legal \nseparation or divorce is not possible); \n \ninformation on close family members (may not be required by all visa offices); \n \nletters of reference from previous employers. Applicants must also provide proof of full-\ntime employment, including proof that the mandatory deductions of that country have \nbeen paid. For example, in the Philippines, employers are required by law to pay monthly \ncontributions to Philhealth and Social Security System for all employees without \nexception. Proof of contributions made is adequate proof that the employee was paid for \nthis employment; OR\nOP 14 Processing Applicants for the Live-In Caregiver Program \n \n2014-02-10 \n \n14 \n \nin the case of overseas employment, applicants must also provide the employment \ncontract listing duties, dates of employment, position, copy of passport pages containing \nthe initial entry visa and subsequent work permits the applicant held to work in that \ncountry; \n \na copy of the employer’s valid LMO confirmation letter from ESDC/Service Canada which \nprovides the system file number of the job validation in the FWS; \n \na copy of the mandatory signed employment contract which sets out the terms and \nconditions of employment signed by the employer and applicant; and \n \nthe processing fee (for details, see the IRP Regulatory Amendments – Cost Recovery Fact \nSheet., in Appendix A of IR 5). \nNote: Other documents may be necessary because of the legal requirements of the \ncountry in which the applicant resides or as a result of country conditions as determined \nby the visa office. \n8.3. \nAssessing the LCP work permit application \nOnce the application for a work permit under the LCP, including all required supporting \ndocumentation, has been received by the applicable visa office, officers will need to \ndetermine if the applicant meets the eligibility criteria in R112, as described in the \nfollowing table. \nLive-in Caregiver Program: Eligibility criteria for applicants \nCriteria  \nBackground information  \nHow to evaluate  \n1. Successful \ncompletion of the \nequivalent of Canadian \nsecondary school \neducation. \n  \n \nStudies must be completed in a \nvocational, technical or \nacademic stream, or any \ncombination of these.  \n \nStudies at a community college \nor university may also qualify. \nUsing knowledge of the host \ncountry’s education and training \nsystem, the officer must be \nsatisfied that: \n1. the institution is a legitimate \nestablishment; \n2. the purpose of the institution is \nformal education; \n3. the program has a formal \ncurriculum; \n4. examination results are \nsuccessful; \n5. the diploma and supporting \ndocuments are valid; and \n6. if diplomas are not available, \nreport cards and letters from \nthe institution attesting to the \napplicant’s educational \nachievement are genuine.  \nNote: Applicants who provide \nfalse transcripts will be refused\nOP 14 Processing Applicants for the Live-In Caregiver Program \n \n2014-02-10 \n \n15 \nunder A16(1), A40(1) and A36.  \n2. (a) Successful \ncompletion of six \nmonths full-time \nclassroom training in a \nfield or occupation \nrelated to the job in \nquestion; OR \n \nAllows applicants who \nare well qualified \nthrough their \neducation, but may \nnot have experience. \n \nIf a host government \nhas sanctioned a \ntraining program for \ngovernesses, \ncaregivers of the \nelderly or jobs of a \nsimilar nature, then \nthe program may \nsatisfy the LCP \ncriteria. Officers \nshould screen training \nprograms for \nlegitimacy and \nadequacy. \nOfficers must be satisfied that: \n1. the transcripts of individual \ncourses within the degree/ \ndiploma program include six \nmonths related to caregiving; \n2. training has been completed in \na classroom setting and does \nnot include activity \nassignments. The intent is that \nhours spent working cannot be \ncredited as hours spent \ntraining; \n3. the courses taken relate directly \nto the Canadian job offer. \n2. (b) Completion of \none year of full-time \npaid employment, \nincluding at least six \nmonths of continuous \nemployment with one \nemployer in that field or \noccupation within three \nyears immediately prior \nto the day on which the \nperson submits an \napplication for a work \npermit to a visa office.  \n  \nNote: Applicants must \nmeet either 2(a) or \n2(b). \n \nThis allows \nexperienced \napplicants who have \nno formal training to \napply. \n \nThe applicant must have at \nleast six months of continuous \nfull-time paid employment with \nthe same employer. This \ncriterion disqualifies persons \nwho change employers \nfrequently. \n \nWork experience must be within \nthree years immediately prior to \nthe application. \n \nWork experience in an \ninstitutional setting where the \napplicant’s duties include \ncaregiving (day care, crèche, \nhospital, senior citizens home) \nmay also be considered. \n \nExperience as a mid-wife or \nhospital technician is not \nacceptable as they do not have \ncaregiving experience related to \nchildren, the elderly or persons \nwith disabilities. \n \nThe caregiving work experience \nmust be related to the Canadian \njob offer. \nNote: Applicants who submit forged \nemployment references will be refused \nunder A16(1)and A40(1).  \n3. Ability to speak, read \nand understand either \nEnglish or French at a \nlevel sufficient to \n  \n \nIf an officer has reason to doubt \nan applicant’s language ability, \nthen the officer should interview \nthe applicant.\nOP 14 Processing Applicants for the Live-In Caregiver Program \n \n2014-02-10 \n \n16 \ncommunicate effectively \nin an unsupervised \nsituation.  \n \nThe officer should carefully \ndocument how language ability \nwas assessed in refusal cases \ncases and consult with \nInternational Region, National \nHeadquarters if a refusal under \nR112(d) is being considered in \ncases where an applicant is \nfluent in the official language \nwhich is not the official \nlanguage spoken in the \nemployer’s community. \n4. Have an employment \ncontract with their \nfuture employer. \n \nThe employer will \nsend the contract to \nthe applicant. \n \nThe applicant will sign \nthe contract indicating \nthe agreement and \nreturn it to the \nemployer. The signed \nemployment contract \nis sent to the visa \noffice by the applicant \nwith the work permit \napplication form and \nother required \ndocuments. \nNote: If necessary, the \napplicant may renegotiate \nsome aspect of the \nemployment contract, \nresulting in a revised \ncontract. If the contract is \nrevised after being approved \nby ESDC/Service Canada as \npart of the employer’s LMO \napplication, any changes to \nthe contract must be clearly \nidentified and explained. The \nsignatures of both the \nemployer and applicant must \nbe on any revised \nemployment contract. If the \nrevised contract has hand-\nwritten changes, the original \nwording must remain legible, \nstruck out and the signatures \nof both parties must appear \nnext to the change, indicating \nagreement. \n \nA sample contract \ntemplate is available \n \nThe officer should electronically \nreceive validated offers of \nemployment from ESDC/Service \nCanada. \n \nThe employment contract \nshould include information on:  \n1. the duties of the caregiver and \na detailed job description; \n2. the hours of work and schedule; \n3. wages and overtime rates; \n4. days off, vacation and sick \nleave; \n5. health insurance and other \nbenefits; \n6. the cost of room and board; \n7. accommodation; and \n8. terms of separation. \n \nThe officer should be able to \nclearly substantiate from the \ninformation provided that the \npotential employee will \nprimarily be providing care. \n \nThe contract should outline \nwhat care requirements are \nneeded (child-care, elderly \nand/or care of persons with \ndisabilities) and should clearly \noutline employee duties that \nmeet the employer’s \nrequirements. \n \nBy law, the terms and \nconditions of the contract must \nbe consistent with \nprovincial/territorial labour laws \nand employment standards. \n \nAt the interview, the caregiver’s \nunderstanding of the job duties, \nworking conditions, wages, etc., \nshould be consistent with the \ninformation in the contract.\nOP 14 Processing Applicants for the Live-In Caregiver Program \n \n2014-02-10 \n \n17 \non the CIC website \n(PDF, 212 KB). \n \nFor applicants \ndestined to Quebec, \nMICC has its own \ncontract template \nreflecting Quebec \nprovincial \nrequirements under \nthe LCP. The Quebec \nsample contract is \navailable on the MICC \nwebsite. \n \nThe officer may request that the \nemployer provide evidence of \nsufficient income from a reliable \nor easily verifiable third-party \nCanadian source. Affidavits \nwould not be acceptable as \nsuch evidence. \n8.4. \nStatutory requirements for admissibility \nIn addition to meeting the LCP eligibility criteria in R112, the applicant must undergo the \nfollowing admissibility checks: \n \nmedical examination; \n \nsecurity check for certain applicants; and \n \ncompliance with normal visitor requirements (see Temporary Residents). \nNote: The medical examination completed by applicants is assessed by medical officers \noverseas for excessive demand in anticipation of the applicant subsequently applying for \npermanent residence under the LCP. \nNote: Live-in caregivers are permitted by regulation to apply for permanent residence \nafter working full-time as a live-in caregiver for at least 24 months or a total of 3,900 \nhours in a minimum of 22 months within the four years immediately following their entry \ninto Canada under the LCP. It is therefore difficult to apply the normal requirement that \ntemporary residents leave Canada by the end of the period authorized for their stay in \nthe case of live-in caregivers. Insofar as is possible, given the difficulty of establishing \nfuture intentions, officers should satisfy themselves that an applicant under the LCP has \nthe intention of leaving Canada should any subsequent application for permanent \nresidence be refused. The question is not so much whether the applicant will seek \npermanent residence but whether the officer is satisfied that the person would not stay in \nCanada illegally. \n8.5. \nFinalizing the application for a LCP work permit \nWhen all the requirements are met, the work permit is approved by the visa office and \nissued at the POE for a period of up to four years plus three months for a specific job \nand a specific employer. The validity period of the initial LCP work permit is determined \nbased on the duration of employment indicated on the LMO and other considerations \n(e.g. passport validity, LMO/CAQ validity). See section 6 of the FW 1 (PDF, 1.9 MB) – \nTemporary Foreign Worker Guidelines chapter for details. \nNational Occupational Classification (NOC) code 6474-200 is to use for LCP work permits \nand permanent resident status documents. \nThe code \"LCP\" should also be entered in the special program box of the work permit. \nTo complete the process, officers should: \n \nenter the details concerning the applicant’s marital status into CAIPS or GCMS notes, \nincluding details of the applicant’s separated or divorced spouse/partner (e.g. spouse’s \nname, date of birth, date of divorce);\nOP 14 Processing Applicants for the Live-In Caregiver Program \n \n2014-02-10 \n \n18 \n \nenter details of the police certificate, if available. The Case Processing Centre in \nVegreville (CPC-Vegreville) will access these details should the applicant apply for \npermanent residence from within Canada under the LCP; \n \nmake decisions based on the requirements of the Act and Regulations and document \nthem; \n \nindicate in the case notes how the assessment was conducted and what documents were \nconsidered. If the application was refused, indicate which criteria the applicant failed to \nmeet;  \n \nif the decision is negative, send the appropriate letter to the applicant informing them of \nthe outcome of their application (see the sample refusal letter titled “Applicant does not \nmeet program requirements” in Appendix A); and \n \nif the employer withdraws the offer of employment, the application must be refused (see \nthe sample refusal letter titled “Withdrawal of offer of employment” in Appendix A). \nLive-in caregivers should be given LCP publications produced by CIC and/or referred to \nthe CIC website for more information about the program, a fact sheet on employment \nstandards legislation (Appendix B), a listing of employment standards contacts \n(Appendix C), and the counselling fact sheet (Appendix D). \n8.6. \nQuebec-bound applicants \nParagraph 22(b) of the Canada-Quebec Accord states that Quebec’s consent is required \nin order to admit into the province any temporary foreign worker whose admission is \nsubject to Canada’s requirements relating to the availability of Canadian workers. A \nQuebec-bound applicant under the LCP must obtain a CAQ prior to submitting a LCP work \npermit application to CIC. The MICC issues a CAQ following a review of the file based on \ntheir selection criteria. \nAll applicants under the LCP must satisfy a Canadian visa officer that they meet the \neligibility criteria in R112. The federal visa officer must ensure that all R112 criteria are \nmet. The applicant must meet all LCP requirements outlined in R112, and other IRPR \ncriteria, regardless of the issuance of a CAQ by the MICC. \nStaff at visa offices must process live-in caregivers destined to Quebec in the same way \nas any other cases and in the order in which they are received in the queue. \nWhen an applicant has obtained a CAQ but does not meet federal requirements, the \nfederal Regulations take precedence. These applicants should be refused. Issuance of a \nCAQ does not automatically guarantee a work permit under the LCP. \n9. \nProcedure: Processing permanent residence applications for family \nmembers abroad \nThis process usually takes place after the live-in caregiver has completed the LCP and \napplied for permanent residence. \n9.1. \nRequirements for the visa office \nUpon notification that a live-in caregiver applicant (principal applicant) has dependent \nfamily members residing abroad, the visa office will: \n \nforward an Application for Permanent Residence in Canada (IMM 0008 (PDF, 464 KB)) to \nfamily members and indicate the time limit for responding; \n \nopen an LC2 file in all cases, whether the family members are undergoing concurrent \nprocessing or not; \n \nconfirm the identity and determine the relationship of family members; \n \nshow the case as \"passed\" at the paper screening and selection stage, whether family \nmembers are being processed concurrently or not;\nOP 14 Processing Applicants for the Live-In Caregiver Program \n \n2014-02-10 \n \n19 \n \nshow whether or not the processing and right of permanent residence fees have been \npaid; \nNote: The codes \"FPC\" and \"LFC\" should be entered if the principal applicant has paid the \nprocessing and right of permanent residence fees in Canada. \n \ninsert the exemption code \"999\" for family members who are not processed concurrently \nand \"LFN\" to show that they are exempt from paying the right of permanent residence \nfee. An explanation should also be included in the remarks box (e.g. LC2 not applying for \npermanent residence); and \n \ninitiate medical and background examinations. \n9.2. \nQuebec cases \nA certificat de sélection du Québec (CSQ) is required for the live-in caregiver and all \naccompanying family members who are to reside in the province of Quebec. \nThe officer requests a CSQ to be issued for accompanying family members by contacting \nthe responsible MICC office and providing a list of the accompanying family members \nabroad. The list should contain the name and date of birth of the accompanying family \nmembers and of the principal applicant, including their CPC client ID number. \nNote: The officer should inform the NHQ/Immigration Branch if there are any problems \nwith the issuance of the CSQ.  \n \nNote: The officer should not request that non-accompanying family members complete a \nDemande de certificat de sélection (DCS).  \n9.3. \nContacting family members \nThe officer will try to contact family members residing abroad directly or by enlisting the \nlive-in caregiver applicant’s assistance. The inland officer’s assistance in contacting \noverseas family members should be limited only to exceptional situations. A valid, \ncomplete and up-to-date mailing address for all family members is required. A telephone \nnumber is also very useful. \nThe CPC will inform the visa office whenever it receives a change of address for live-in \ncaregivers whose family members are being processed abroad. \nIf family members do not return a completed Application for Permanent Residence in \nCanada (IMM 0008 (PDF, 464 KB)), or do not provide documentation as requested within \nthe stated time limit, the officer has specific instructions to follow up with the family \nmembers (see section 9.13 of the IP 4 – Processing Live-in Caregivers in Canada \nchapter). A copy of the form should also be sent to the principal applicant in Canada (and \na copy to CPC-Vegreville if the visa office is not using CAIPS or GCMS). The officer may \ntry to contact the principal applicant at anytime during this process. \nThe letter will state that, if documentation is not provided within a certain period of time \n(as appropriate), the file will be closed and the applicant in Canada could be refused. \n9.4. \nFinalizing approved cases  \nAfter identity, relationship and statutory requirements have all been met, the officer \nprovides the CPC with the results of statutory checks, their period of validity and the visa \noffice file number for both accompanying and non-accompanying family members. \nNote: The results can be communicated by email to CPC-Vegreville-Enquiries@cic.gc.ca. \nAll e-mail messages are to be addressed to the attention of “Client Services”.\nOP 14 Processing Applicants for the Live-In Caregiver Program \n \n2014-02-10 \n \n20 \n9.5. \nProcessing files for accompanying family members \nThe visa office file for accompanying family members will be left open until the inland CIC \noffice confirms that the live-in caregiver applicant has been granted permanent resident \nstatus. \nFor the purpose of R114, all family members (both accompanying and non-\naccompanying) must be included in the original application for permanent residence. A \nnon-accompanying family member can, during the processing of the application, become \nan accompanying family member by making a request to do so and paying the \nappropriate fees at the time of the request. The request must be made before permanent \nresidence is granted to the live-in caregiver in Canada. \nA newly created family member (e.g. newborn, new spouse) does not need to be included \nin the original application for permanent residence. These family members can be added \nto the application during the processing of the application of the live-in caregiver. \nUpon notification that the principal applicant has been granted permanent resident status \nin Canada, the visa office verifies that the family members underwent parallel processing \nas accompanying family members. The case is then shown as “approved” and the visa \noffice issues permanent resident visas to accompanying family members, provided \nmedical and background checks are still valid. \n9.6. \nProcessing files for non-accompanying family members \nIf the family members are non-accompanying, the officer shows the case file disposition \nas “withdrawn”, inserts a note in CAIPS or GCMS, e.g. “LC2 family member did not seek \npermanent residence”, and informs the CPC of examination results. \nNote: Permanent resident visas are not to be issued to non-accompanying family \nmembers. These family members can be sponsored as members of the family class at a \nlater date, provided they were examined at the time the caregiver applied for permanent \nresidence. Family members who are sponsored at a later date must meet all \nrequirements applicable at that time. \n \nNote: Family members, whether living in Canada or abroad, and whether accompanying \nthe applicant or not, must complete a medical examination. \n9.7. \nFinalizing refused cases  \nThe visa office: \n \ninforms the CPC of negative results for accompanying and non-accompanying family \nmembers; \n \ninforms the CPC if family members have not undergone examination within the allocated \nperiod of time or could not be located (see section 9.3 above); and \n \nshows the final disposition of its LC 2 file as \"refused\" for accompanying family members \nand as \"withdrawn\" for non-accompanying family members. \nNote: The visa office does not inform family members of the final disposition of the case. \nThe CPC: \n \ninforms the applicant regarding the status of their case. Additional time may be allowed \nfor response; and \n \nrefuses the case. The refusal letter to the live-in caregiver applicant will state that both \nthe applicant and all family members, in Canada or abroad, are refused.\nOP 14 Processing Applicants for the Live-In Caregiver Program \n \n2014-02-10 \n \n21 \nNote: If a family member is inadmissible, the principal applicant and family members \ncannot be granted permanent resident status. \nApplicants who still have valid status will be informed in writing, that their status and \nwork permit may not be extended and that they should leave Canada. \nIn cases where the basis for refusal is that the applicant’s spouse or common-law partner \nor dependent children did not undergo medical and background checks, the CPC must \nverify the application to ensure that: \n \nthe applicant’s spouse, common-law partner or dependent child were indeed subject to \nexamination, i.e. were not a separated spouse or child in the custody of the other parent; \nand \n \nthe visa office did inform the applicant that the family member’s lack of cooperation in \nundergoing medical and background checks could result in the refusal of the live-in \ncaregiver’s application for permanent residence in Canada (see section 9.3 above). The \nCPC can verify that reminder letters were sent by reviewing the case notes in CAIPS or \nGCMS. \nNote: Procedural fairness requires that the applicant be aware of factors which may \ncontribute to a negative decision and be afforded the opportunity to respond. \n9.8. \nIneligible family members  \nWhen the visa office determines that listed relatives do not meet the definition of “family \nmembers” according to the Regulations or that they are family members but not subject \nto examination (e.g. separated spouses or former common-law partners), the officer will \ntake the following steps: \n \ninform the CPC of their findings; \n \ninstruct these ineligible or separated family members to ignore any previous requests \nfrom the visa office to undergo examination or provide documentation; and \n \nclose the LC2 file by showing it as “withdrawn” and entering in the CAIPS or GCMS case \nnotes the reason why the family member was found ineligible or not subject to \nexamination. \nThe CPC will: \n \ninform the live-in caregiver applicant that the ineligible or separated family member \ncannot be part of the application; and \n \nfinalize processing of the application minus the ineligible persons. \nNote: When a visa office has informed the CPC that a family member is ineligible, the \nCPC should contact the applicant, explain the situation and allow the applicant an \nopportunity to either provide additional information within a stated pre-determined time, \nor apply for a refund of the right of permanent residence fee if the fee was paid for the \nineligible family member.  \nIt is not necessary for applicants to delete ineligible family members from their \napplication, only that they be given an opportunity to provide additional evidence that the \nineligible family members are indeed eligible. \nNote: A separated spouse, former common-law partner or child in the custody of another \nperson who was not examined cannot later be sponsored as a member of the family class \nsince they are excluded from the family class as per R117(9)(d).\nOP 14 Processing Applicants for the Live-In Caregiver Program \n \n2014-02-10 \n \n22 \nAppendix A – Sample letters \nRefusal letter – LCP work permit – Applicant does not meet program \nrequirement \nInsert letterhead \nOur Ref.: \nInsert address \nDear: \nI have completed my assessment of your application for a work permit in Canada as a \nlive-in caregiver. I have determined that you do not meet the requirements of the Live-in \nCaregiver Program. \nThe requirements for issuance of a work permit as a live-in caregiver are set out in \nsection 112 of the Immigration and Refugee Protection Regulations: \n112. A work permit shall not be issued to a foreign national who seeks to enter Canada \nas a live-in caregiver unless they; \n1. applied for a work permit as a live-in caregiver before entering Canada; \n2. have successfully completed a course of study that is equivalent to the successful \ncompletion of secondary school in Canada; \n3. have the following training or experience, in a field or occupation related to the \nemployment for which the work permit is sought, namely,  \n1. successful completion of six months of full-time training in a classroom setting, or \n2. completion of one year of full-time paid employment, including at least six months \nof continuous employment with one employer, in such a field or occupation within \nthe three years immediately before the day on which they submit an application \nfor a work permit; \n4. have the ability to speak, read and listen to English or French at a level sufficient to \ncommunicate effectively in a unsupervised setting; and \n5. have an employment contract with their future employer. \nI have determined that you do not meet these requirement(s) because (set out reasons). \nSubsection 11(1) of the Immigration and Refugee Protection Act states that: \n11. (1) A foreign national must, before entering Canada, apply to an officer for a visa or \nfor any other document required by the regulations. The visa or document may be issued \nif, following an examination, the officer is satisfied that the foreign national is not \ninadmissible and meets the requirements of this Act. \nSubsection 2(2) of the Act specifies that: \n2. (2) Unless otherwise indicated, references in the Act to “this Act” include regulations \nmade under it. \nFollowing an examination of your application, I am not satisfied that you meet the \nrequirements of the Act and Regulations for the reasons explained above. I am therefore \nrefusing your application. \nPlease inform your employer in Canada of this decision. You should disregard any \nprevious instructions that may have been sent to you from this office. Thank you for your \ninterest in Canada. \nYours sincerely, \nOfficer\nOP 14 Processing Applicants for the Live-In Caregiver Program \n \n2014-02-10 \n \n23 \ncc: ESDC/Service Canada Centre: (include name of employer) \n \nRefusal letter – LCP work permit – Withdrawal of offer of employment \nInsert letterhead \nOur Ref.: \nInsert address \nDear: \nI refer to your application for a work permit as a live-in caregiver. I have been informed \nthat your prospective employer in Canada has withdrawn the offer of employment made \non your behalf. \nOne of the requirements for the issuance of a work permit as a live-in caregiver set out in \nsection 112(e) of the Immigration and Refugee Protection Regulations is that an applicant \nmust have an employment contract with their future employer. Since your future \nemployer has withdrawn their offer of employment, your application does not meet this \nrequirement. \nSubsection 11(1) of the Immigration and Refugee Protection Act states that: \n11. (1) A foreign national must, before entering Canada, apply to an officer for a visa or \nfor any other document required by the regulations. The visa or document may be issued \nif, following an examination, the officer is satisfied that the foreign national is not \ninadmissible and meets the requirements of this Act. \nSubsection 2(2) of the Immigration and Refugee Protection Act specifies that: \n2. (2) Unless otherwise indicated, references in the Act to “this Act” include regulations \nmade under it. \nFollowing an examination of your application, I am not satisfied that you meet the \nrequirements of the Act and Regulations for the reasons explained above. I am therefore \nrefusing your application. \nIf you have been requested to forward additional information, to undergo a medical \nexamination, or to appear for an interview at this office, you should now disregard these \nrequests and consider them cancelled. We can consider a new application only if you \nobtain another offer of employment that has been validated by Employment and Social \nDevelopment Canada/Service Canada. \nThank you for your interest in Canada. \nYours sincerely, \nOfficer\nOP 14 Processing Applicants for the Live-In Caregiver Program \n \n2014-02-10 \n \n24 \nAppendix B – Fact sheet on employment standards legislation \nApplicable to live-in caregivers or domestic workers \nThis fact sheet briefly outlines employment standards legislation applicable to live-in \ncaregivers in each province and territory. \nAlthough the Live-in Caregiver Program is run by the federal government, employment \nstandards legislation pertaining to caregivers and domestics falls within provincial and \nterritorial jurisdiction. Federal legislation (namely the Canada Labour Code and \nRegulations) applies only to certain specific sectors such as banking, interprovincial and \ninternational transportation, telecommunications, broadcasting, grain handling and \nuranium mines. \nIt should be noted that the provisions in provincial and territorial employment standards \nlegislation and their scope may vary from one jurisdiction to another. This means that \nminimum working conditions prescribed by law are not identical across Canada for live-in \ncaregivers or domestic workers. \nUnder the Immigration and Refugee Protection Act and Regulations, employers and live-\nin caregivers must sign an employment contract that clearly defines the rights and \nresponsibilities of both parties. The terms and conditions of the employment contract \nmust by law be consistent with provincial/territorial employment standards and labour \nlaws. In some provinces and territories, employment standards legislation does not, in \nwhole or in part, apply to live-in caregivers. Where there is no minimum wage applicable \nin a particular province or territory, Employment and Social Development Canada (ESDC) \ndetermines the wage rate to be paid by employers. In some parts of the country, ESDC \nrequires employers to pay wages higher than the minimum wage rate, based on the \nprevailing wage paid for this type of work. \nFor more information on employment standards and labour laws in provinces and \nterritories, please consult the following websites. Please note that this information is \nsubject to change. \nAlso note that ESDC’s website provides information on Regional Wages, Working \nConditions and Advertisement Requirements for the Live-In Caregiver Program. \nALBERTA \nWebsite: www.employment.alberta.ca/SFW/1224.html \nBRITISH COLUMBIA \nWebsite: www.labour.gov.bc.ca/esb/ \nMANITOBA \nWebsite www.gov.mb.ca/labour/standards/ \nNEW BRUNSWICK \nNew Brunswick’s Employment Standards Act and Regulations do not apply to persons \nworking in private homes. Therefore, live-in caregivers have no protection under \nprovincial employment standards legislation, which makes it all the more important to \nclearly spell out the working conditions in the employment contract. \nWebsite: www.gnb.ca/0308/index-e.asp \nNEWFOUNDLAND AND LABRADOR \nWebsite: www.gov.nl.ca/lra/faq/labourstandards.html \nNORTHWEST TERRITORIES AND NUNAVUT\nOP 14 Processing Applicants for the Live-In Caregiver Program \n \n2014-02-10 \n \n25 \nWebsite: www.ece.gov.nt.ca \nNOVA SCOTIA \nWebsite: www.gov.ns.ca/lwd/employmentworkplaces/ \nONTARIO \nWebsite: www.labour.gov.on.ca/english/es/ \nPRINCE EDWARD ISLAND \nWebsite: www.gov.pe.ca/index.php3?lang=E \nQUEBEC \nThe Live-in Caregiver Program operates differently in Quebec compared to the other \nprovinces and territories. Under the Canada-Quebec Accord, Quebec plays a role in the \nselection of foreign workers. In order to work in Quebec, caregivers have to obtain a \nCertificat d’acceptation du Québec (CAQ), which is contingent, in part, on the signing of \nan employment contract between the employee and the employer. The Act respecting \nlabour standards does not apply to an employee whose exclusive duty is to provide care, \nin a dwelling, to a child or to a sick, disabled or aged person (s.3(2) of the Act). However, \nlive-in caregivers may be covered by the provisions of the Actif they also do housework \nthat is a small part of their overall duties and is indirectly related to the immediate needs \nof the care recipient. In such cases, they are deemed to be domestics. \nWebsite: www.cnt.gouv.qc.ca/en/home/index.html \nSASKATCHEWAN \nSaskatchewan’s Labour Standards Act and Regulations do not apply in the same way to \n“care providers” as they do to domestic workers (these two categories have their own \ndefinitions). The minimum employment standards also vary depending on whether or not \nthe employee lives with the employer. \nWeb site: http://ae.gov.sk.ca \nYUKON TERRITORY \nMost provisions of the Employment Standards Act apply to domestics, including domestic \nhomemakers. However, the Act does not cover sitters working in a private residence \nsolely to attend to a child, or to a disabled, infirm or other person (General Exemption \nRegulations) \nWeb site: http://ae.gov.sk.ca\nOP 14 Processing Applicants for the Live-In Caregiver Program \n \n2014-02-10 \n \n26 \nAppendix C – Provincial and territorial employment standards \nContact list \nIf you have questions, difficulties or complaints regarding your employment as a live-in \ncaregiver, you can call or visit the labour or employment standards branch for your \nprovince or territory. The counsellors at these offices will be able to answer questions you \nmay have about your rights, and help you if you are having any work-related difficulty \nwith your employer. Sometimes you will hear a pre-recorded message when you call \nthese numbers. Just stay on the line and follow the directions that you receive. If the \nrecorded message does not answer your question, a counsellor will eventually come on \nthe line. These numbers are used frequently, and it may take more than one try to get \nthrough. Be patient. \nIf you prefer, you can write to the office responsible for labour laws or employment \nstandards in your province or territory. Just write a letter clearly indicating your question \nor concern and mail it to the address shown. Be sure to include your name and \noccupation (what you do) and how you can be reached (phone number and address). If it \nis important that you get assistance quickly, remember that calling is faster than writing. \nDo not hesitate to contact these people. They are here to help you. \nPlease visit the CIC website for further details: \nwww.cic.gc.ca/english/work/caregiver/arriving.asp#standards\nOP 14 Processing Applicants for the Live-In Caregiver Program \n \n2014-02-10 \n \n27 \nAppendix D – Counselling fact sheet \nImportant Information for live-in caregivers \nThe CIC website provides information on the rights of temporary foreign workers and the \nlaw: www.cic.gc.ca/english/work/tfw-rights.asp. \nYou should confirm that your employer still wishes to hire you before you finalize plans to \ndepart for Canada. If your employer no longer needs you, you will not be issued a work \npermit as it was approved only for that specific job and employer. You may not be \nallowed to enter Canada. \nOfficials at the port of entry may ask your employer to meet you at the port of entry \nbefore they issue you a work permit. \nYou must have a written employment contract signed by both you and your future \nemployer. The contract defines your job duties, hours of work, salary and benefits, such \nas overtime. The contract also reinforces your employer’s legal responsibilities to you. \nThis requirement helps provide a fair working arrangement between you and your \nemployer and provides both of you with a clear understanding of what is expected of you. \nYou should ask for a “pay slip” with each pay cheque, which shows your deductions and \nnet pay (pay after deductions). \nIf you are not happy with your job, you should tell your employer. A little flexibility on \nboth sides is often enough to cause changes so that you are both happy. Some \nemployers have waited a long time and may have paid agency fees to bring you to \nCanada. They will appreciate your honesty. \nIf you decide to change employers, you cannot begin work until you get a new work \npermit that names your new employer. Your new employer needs to get approval from \nEmployment and Social Development Canada/Service Canada before you can get your \nnew work permit and begin working for them. \nEven if you do not change employers, you may need to renew your work permit. It is \nillegal to work in Canada once your work permit has expired. You should apply for an \nextension of your work permit in Canada at least three months in advance of the expiry \ndate. This is your responsibility, not your employer’s. \nIt is your responsibility to keep your legal documents (such as your work permit and \npassport) safe. You should not give them to anyone, even your employer. Although you \nmay be asked to show these documents for verification (e.g. your employer may request \nto see your work permit), you should always keep them in your possession. \nUnder no circumstances can an employer have you deported from Canada. Your employer \nhas no authority to hold your passport. \nYou are authorized to work in Canada as a live-in caregiver only. If you work in any other \njob, even part-time work, you could be disqualified from the program and from being \neligible for permanent residence. \nIf you or someone else lied about your education, training or experience when you first \napplied in the Live-in Caregiver Program outside Canada, you could be disqualified from \nthe program in Canada. \nIf you want to apply for permanent residence in Canada, you must: \n \nwork full-time as a live-in caregiver for at least 24 months or a total of 3,900 hours in a \nminimum of 22 months within the four years immediately following your entry into \nCanada under the Live-in Caregiver Program;\nOP 14 Processing Applicants for the Live-In Caregiver Program \n \n2014-02-10 \n \n28 \n \nyou, your spouse and your dependent children must pass medical, criminal and security \nchecks and must not be going to an immigration inquiry (hearing) or be under an order \nto leave Canada. For example, if you marry a refugee claimant in Canada the status of \nyour spouse could prevent you from getting permanent resident status; and \n \nyou must live in the home of the person(s) for whom you have been hired to provide care \nor you cannot continue to work in the Live-in Caregiver Program, and you cannot apply \nfor permanent residence. \nOnce you have worked for the required 24 months or 3,900 hours in a minimum of 22 \nmonths, you may apply for permanent residence. It is important that you maintain your \ntemporary resident status and have a valid work permit until you have become a \npermanent resident. \nIf you plan to apply for permanent residence, you may wish to get original documents \nthat show, in as much detail as possible, all of your education, training and experience \nbefore you leave your country. These documents could help you when you apply for work \nin Canada, or help you get into a program of study after you become a permanent \nresident. It is often easier to get these documents while you are still in your home \ncountry. \nIf you had to get a temporary resident visa to come to Canada, you may have to get a \nnew one if you leave Canada temporarily, on holidays, for example, unless you are \nvisiting the United States."
}