{
  "type": "pdf",
  "source": "Processing_Live-in_Caregivers_in_Canada.pdf",
  "text": "IP 4 \nProcessing live-in caregivers in \nCanada\nIP 4 Processing Live-in Caregivers in Canada \nMost recent date of changes: 2019-10-09 \nUpdates to chapter \n \n1 What this chapter is about \n2 Program objectives \n3 The Act and Regulations \n3.1 Forms  \n4 Instruments and delegations \n5 Departmental policy \n5.1 Responsibility for processing by the visa office  \n5.2 Responsibility for processing in Canada \n5.3 Issuance or renewal of work permits in Canada \n5.4 Mandatory employment contract \n5.5 Validation of a job offer \n5.6 Eligibility for permanent residence \n5.7 Quebec applicants \n5.8 Parallel processing of family members \n5.9 Responding to representations \n6 Definitions \n6.1 Family member \n6.2 Live-in caregiver \n7 Processing an employment contract \n8 Procedures for issuance and renewal of work and study permits \n8.1 Applications for work permits \n8.2 Requirements for issuance of work permits \n8.3 If all requirements are met \n8.4 If requirements are not met \n8.5 Bridge extension: Live-in caregiver is between jobs \n8.6 Issuance of “urgent” or “emergency” work permits \n8.7 Refusal of an application for a work permit \n8.8 Issuance of study permits \n9 Processing applications for permanent residence \n9.1 General guidelines \n9.2 Applications for permanent residence \n9.3 Fees \n9.4 Assessing eligibility to become a member of the live-in caregiver class \n9.5 Acceptable evidence of full-time employment as a live-in caregiver \n9.6 Checking for pending criminal charges\n9.7 Granting “approval-in-principle” (eligible applicants) \n9.8 Refusing applicants determined not to be members of live-in caregiver class (ineligible applicants) \n9.9 Applications from eligible live-in caregivers in Quebec  \n9.10 Assessing admissibility requirements \n9.11 Criminal and security checks \n9.12 Medical examinations \n9.13 Processing of family members \n9.14 Inadmissibility and non-accompanying family members \n9.15 Ineligible family members \n9.16 Finalizing approved cases \n9.17 Finalizing refused cases \n9.18 Documentation standards in FOSS \n10 Tracking the application \nAppendix A – Sample letter – Live-in caregiver “approved-in-principle” \nAppendix B – Sample letter – Procedural fairness \nAppendix C – Sample letter – Refusals  \nAppendix D – Fact sheet on employment standards legislation \nAppendix E – Provincial and territorial employment standards – Contact information \nAppendix F – Counselling fact sheet\nUpdates to chapter \nListing by date \n2019-10-09 \nChanges have been made to section 8, Procedures for issuance and renewal of work and study permits. \nSpecifically, the following updates have been made: \n \nSection 8.1, Applications for work permits – A note has been added to indicate that the Live-in Caregiver \nProgram (LCP) is closed to new applicants. Caregivers can be hired through the LCP only if employers \nhave both \no \nfound a caregiver who already has a work permit under the LCP and who is looking for a new \nemployer \no \nbeen approved for a Labour Market Impact Assessment (LMIA) that shows the caregiver has \nagreed to live in the employer’s home \n \nSection 8.5, Bridge extension: Live-in caregiver is between jobs – The code for the Application to Change \nConditions, Extend My Stay or Remain in Canada as a Worker form [IMM 5710] has been corrected from \nIMM 1249 to IMM 5710. \n \nSection 8.6, Issuance of “urgent” or “emergency” work permits – Guidance has been added regarding live-\nin caregivers who are experiencing abuse or at risk of experiencing abuse in the context of their \nemployment in Canada. \n2015-11-04 \nThe information that was contained in the following sections can now be found in the program delivery \ninstructions (PDIs) on permanent residence: \n \nSection 5.2 – Humanitarian and compassionate (H&C) applications  \n \nSection 5.6 – Eligibility for permanent residence \n \nSection 5.7 – Quebec applicants \n \nSection 9 – Processing applications for permanent residence \n \nAppendix A – Sample letter – Live-in caregiver “approved-in-principle” \n \nAppendix B – Sample letter – Procedural fairness \n \nAppendix C – Sample letter – Refusals \n2011-01-19 \nChanges have been made throughout the chapter to reflect regulatory amendments to the Live-in Caregiver \nProgram which came into force on April 1, 2010, and to reflect a series of administrative changes which were \nimplemented in the period of April – August 2010. \nSpecifically, the following updates have been made: \n \nSection 1 – Updated this section to clarify purpose of this chapter and include a cross reference to the \nrelated overseas processing manual. \n \nSection 2 – Updated this section to reflect regulatory amendments. \n \nSection 3 – Updated regulatory and form references in this section. \n \nSection 4 – Updated this section to reduce level of detail in favour of a cross reference to the authoritative \nmanual chapter on designations and delegation of authority. \n \nSection 5 – Updated this section to reflect regulatory amendments, new employment contract \nrequirements, and to generally enhance the level of detail with respect to key elements of departmental \npolicy. \n \nSection 6 – Updated this section to ensure definitions accurately reflect wording of current Regulations. \n \nSection 7 – Updated this section to reflect new contract requirements and outline roles and responsibilities \nin processing employment contracts.\n \nSection 8 – Updated this section to clarify general procedures for the issuance or renewal of work permits \nand to incorporate new instructions regarding the issuance of “emergency” work permits to live-in \ncaregivers in abusive workplace situations. \n \nSection 9 – Updated this section to reflect regulatory amendments, generally enhance the level of detail \nthroughout, and to incorporate new instructions regarding medical examinations in accordance with \nadministrative changes. \n \nSection 10 – Updated this section to reflect CPC-V responsibilities towards the applicant for the permanent \nresidence  \n \nAppendix A – Update to “approved-in-principle” sample letter. \n \nAppendix B – Update to sample procedural fairness letters reflecting regulatory changes. \n \nAppendix C – Update to sample refusal letters reflecting regulatory changes. \n \nAppendix D – Update to fact sheet on employment standards legislation with updated links to \nprovincial/territorial websites. \n \nAppendix E – Update to provincial and territorial employment standards contact information. \n \nAppendix F – Update to counselling fact sheet reflecting regulatory amendments. \n2009-06-25  \nChanges have been made to reflect instructions previously published in OB 025 of January 3, 2007, concerning \nnon-accompanying family members who wish to become accompanying. They affect in particular the following \nsections of the chapter:  \n \nSection 9.2 – Applications \n \nSection 9.13 – Processing of family members \n2008-04-24  \nSection 6.3 was amended to provide an accurate link to the definition of a “family member.” \n2007-11-30 \nSection 9.5 was updated to clarify that acceptable evidence of two year’s employment MUST include ALL \ndocuments listed. As well, a new document requirement was added: a letter from the current employer showing \nthe start date and confirming the applicant’s status as currently being employed. \nThe “Updates to chapter” section was created.\n1 What this chapter is about \nThis chapter describes the processing in Canada of applications for renewal of work permits (same employer), \napplications for new work permits (new employer/employer move to a new province/territory), applications for \nstudy permits and applications for permanent residence, under the Live-in Caregiver Program (LCP). \nProcedures related to overseas processing of initial work permit applications under the LCP, and the overseas \nprocessing of applications for permanent residence from live-in caregivers’ family members living outside Canada, \nare described in the OP 14 – Processing Applicants for the Live-in Caregiver Program chapter. \n2 Program objectives \nCitizenship and Immigration Canada (CIC) established this program to meet a labour market shortage of live-in \ncaregivers in Canada, while providing an avenue for certain individuals to work and eventually apply for permanent \nresidence from within Canada. \nThe LCP brings qualified temporary workers to Canada to provide in-home child care, senior home support care or \ncare of the disabled. The LCP allows applicants to apply for permanent residence from within Canada after being \nemployed full-time as a live-in caregiver for at least 24 months or a total of 3,900 hours in a minimum of \n22 months within the four years immediately following their entry into Canada under the LCP. \n3 The Act and Regulations  \nReferences in the Immigration and Refugee Protection Regulations (IRPR) to the Live-in Caregiver Program. \nFor more information about \nRefer to \nAuthorization for application for permanent residence in Canada \nR72 \nDefinition of live-in caregiver \nR2 \nMedical examination requirements for live-in caregivers in Canada \nR30(2.1) \nLive-in caregiver class \nR113 \nRequirements for work permit  \nR111, R112 \nApplication for permanent residence in Canada  \nR113 \nRequirements for family members \nR114 \nConformity – applicable times \nR115 \nStudy without a work permit: short-term courses  \nR188 \nApplication in Canada for work permit \nR207 \nApplication in Canada for study permit \nR215 \nNote: With respect to R115, it is important to note that not all requirements set out in sections 112 to 114.1 of the \nRegulations will apply to each situation or point in time. \n3.1 Forms\nForm Title \nForm Number  \nIn-Canada Application for Permanent Resident Status  \nIMM 5002E  \nDocument Checklist – Live-in Caregiver \nIMM 5282E  \nLive-in Caregiver – Employer Declaration of Hours Worked \nIMM 5634E \nApplication to Change Conditions, Extend My Stay, or Remain in Canada \nIMM 1249E  \n4 Instruments and delegations \nSection 6 of the Immigration and Refugee Protection Act (IRPA) authorizes the Minister to designate officers to \ncarry out specific powers and to delegate authorities. It also states those ministerial authorities that may not be \ndelegated, specifically those relating to security certificates or national interest. \nUnder IRPA, the Minister of Citizenship and Immigration has delegated powers and designated those officials \nauthorized to carry out any purpose of any provisions legislative or regulatory in instrument IL 3 – Designation of \nOfficers and Delegation of Authority. \n5 Departmental policy \n5.1 Responsibility for processing outside Canada \nTo participate in the LCP, a foreign national must make an application for an initial live-in caregiver work permit at \na Canadian visa office abroad. \nVisa offices are responsible for the initial selection process and issuance of initial work permits to live-in caregivers \nunder the LCP. Visa offices are also responsible for processing permanent residence applications overseas for family \nmembers of live-in caregivers who have applied for permanent residence from within Canada. \nVisa officers overseas generally issue the initial work permit under the LCP for a duration of four years plus \nthree months when consistent with other considerations, such as employer need and passport validity. This general \npractice serves to minimize subsequent in Canada work permit applications. \n5.2 Responsibility for processing in Canada \nThe Case Processing Centre in Vegreville (CPC-V), Alberta is responsible for processing applications in Canada \nunder the LCP for: \n \nnew work permits (new employer/employer move to a new province/territory); \n \nwork permit renewals (same employer); \n \nstudy permits; and \n \npermanent residence. \nRole of CIC inland offices \nLocal CIC offices play a role in processing complex or exceptional LCP cases. CPC-V will refer cases to a CIC inland \noffice if an interview is warranted or if there is suspected misrepresentation, serious criminality or security \nconcerns, as described in A34, A35, A36(1), A37 or A40. \nCPC-V issues all correspondence to applicants with respect to LCP applications which they process. Cases referred \nto CIC inland offices by CPC-V for processing are concluded, and the appropriate correspondence is issued to \napplicants, by the responsible inland office.\nGiven that the vast majority of LCP applications made from within Canada are processed by the CPC-V, this chapter \nfocuses on standard processing procedures as they generally apply to CPC-V and does not detail processing \nprocedures which may apply to, and deviate between, CIC inland offices. \nHumanitarian and Compassionate (H&C) applications  \n \n5.3 Issuance or renewal of work permits in Canada \nWork permits are generally issued to match the duration of the job offer and Labour Market Opinion (LMO) issued \nby Employment and Social Development Canada (ESDC)/Service Canada, and the Certificat d’acceptation du \nQuebec (CAQ) issued by the Ministère de l’Immigration et des Communautés culturelles (MICC) for live-in \ncaregivers in Quebec, unless there are other factors which would restrict the duration for which a work permit may \nbe issued (e.g., passport validity). The officer assessing the application retains discretionary power with respect to \nthe validity period of LCP work permits and may set aside the general issuance policy where, in their opinion, \ncircumstances warrant. \nThe total duration of all LCP work permits (added together) should not exceed four years and three months. The \nfour-year period gives live-in caregivers sufficient time to meet the employment requirements of the LCP while \nallowing flexibility to compensate for periods of unemployment, illness, vacation or maternity leave. The additional \nthree months affords caregivers a transition period during which they may apply for permanent residence.  \nLive-in caregivers must apply to CPC-V for a renewal of their work permit as required before it expires in order to \nensure that their temporary status as a worker continues under the same conditions until their application is \nprocessed and they have been notified of the decision (implied status).  \nLive-in caregivers may change employers but must obtain a new work permit, with a validated job offer in the form \nof a positive/neutral LMO from ESDC/Service Canada, a CAQ if applicable, and a new employment contract, before \nworking for the new employer. For live-in caregivers in Quebec, ESDC/Service Canada and the MICC jointly assess \nand render a decision on LMO applications.  \nIf the live-in caregiver continues to work for the same employer, there is no need for a new LMO but a CAQ is \nrequired for live-in caregivers in Quebec. A letter from the employer stating that the live-in caregiver will continue \nto be employed on a full-time basis is sufficient. The employer and caregiver must also sign a new or extended \nemployment contract.  \nIf the live-in caregiver’s employer moves to a new province/territory, they must obtain a new work permit, with a \nvalidated job offer in the form of a positive/neutral LMO from ESDC/Service Canada, a CAQ if applicable, and a new \nemployment contract, before working for their employer in the new location. \nIf the live-in caregiver’s employers divorce and both employer’s names are on the work permit, a new work permit \nis not required. The caregiver should simply send a letter to CPC-V to advise of the change. However, should the \nemployer divorce, or one of the employers is deceased and only one name is listed on the work permit, the \ncaregiver must obtain a new work permit and a new LMO/CAQ would be required for the employer not listed before \nthe caregiver could work for that person. \nLive-in caregivers must continue to meet the requirements of the LCP in order to be eligible for a new work permit \nor a work permit extension under the LCP. \nLive-in caregivers may not accept any other type of employment without a valid work permit. Any time that a live-\nin caregiver works outside the home of an employer under the LCP on a non-LCP work permit will not count \ntowards the period of employment required to be eligible for permanent residence as a live-in caregiver. Officers \nwill assess applications for non-LCP work permits (for example, to work part-time in a restaurant) from live-in \ncaregivers who hold a valid LCP work permit on a case by case basis in the context of whether the officer is \nThis content has been moved as part of the Department’s efforts to modernize operational guidance \nto staff. It can now be found in the program delivery instructions on permanent residence applications \nfrom live-in caregivers.\nsatisfied that the live-out employment will not compromise the caregiver’s ability to continue to meet their full-time \nresponsibilities as specified in their LCP employment contract.  \nLive-in caregivers can only work under the LCP for the employer(s) named on their work permit. They may not \nwork in a caregiving capacity for anyone other than the person(s) identified on their LCP work permit at any one \ntime. In doing so, a live-in caregiver risks losing their status in Canada and being disqualified from the program.  \nNote: For live-in caregivers in Quebec, the total duration of all work permits (added together) should not exceed \nfour years as this is the maximum period for which the MICC will issue a CAQ for live-in caregivers.  \n5.4 Mandatory employment contract \nAn employment contract between employer and live-in caregiver, outlining the terms and conditions of \nemployment, is a legal requirement of the LCP and must be provided to CPC-V as part of an application for a new \nwork permit or a work permit renewal under the program. The employment contract must be signed by both the \nemployer and the live-in caregiver.  \nThe live-in caregiver position being offered must be full-time and all terms and conditions outlined in the \nemployment contract must, by law, abide by provincial/territorial employment standards and labour laws. \nHousework, cleaning or other similar domestic duties, such as food preparation, may be allowable as a small \nproportion of the overall duties, and when clearly related to the duties of caring for the individual(s), however \ncannot be the primary duty. \nFor all LCP LMO applications received by ESDC/Service Canada on or after April 1, 2010, and for all work permit \napplications received by CIC that are based on these LMOs, the signed written employment contract between live-\nin caregivers and their employers must demonstrate that LCP requirements are met by including a description of: \n \nMandatory employer-paid benefits, including:  \no \nTransportation to the location of work in Canada, \no \nMedical insurance coverage provided from the date of the live-in caregiver’s arrival until he or \nshe is eligible for provincial health insurance, \no \nWorkplace safety insurance coverage for the duration of employment, \no \nAll recruitment fees, including any amounts payable to a third-party recruiter or agents hired by \nthe employer that would otherwise, have been charged to the live-in caregiver; \n \nJob duties which clearly demonstrate that the employee’s primary duty will be live-in caregiving; \n \nHours of work; \n \nWages; \n \nAccommodation arrangements (including, where applicable, room and board); \n \nHoliday and sick leave entitlements; \n \nTermination and resignation terms. \nA LCP employment contract template is available on the Service Canada website. Employers and live-in caregivers \nare encouraged to use this contract template but are not obliged to do so. However, all employment contracts must \ncontain the information and clauses specified in the LCP employment contract template. Any additional provisions \nmust not conflict with provincial/territorial labour laws and employment standards. The use of an alternate contract \nformat may delay processing of the LMO application as ESDC/Service Canada officers will have to do a thorough \ncomparative assessment to determine if the contract is compliant with LCP requirements. \nNote: For live-in caregivers in Quebec, the MICC has its own employment contract template reflecting Quebec \nprovincial requirements under the LCP. The Quebec employment contract template is available on the MICC \nwebsite.  \n5.5 Validation of a job offer \nBefore a new work permit (change of employer/employer move to a new province/territory) may be issued to a \nlive-in caregiver, the prospective new employer must apply to ESDC/Service Canada to have his or her proposed \njob offer reviewed and validated.\nESDC/Service Canada will assess the genuineness of the prospective employer’s job offer and will review the \nemployment contract to ensure that it includes all mandatory information and clauses. ESDC/Service Canada will \nassess whether the job offer and employment contract meets the requirements for wages and working conditions, \nthe applicable provincial/territorial labour laws and employment standards and that there are not enough \nCanadians or permanent residents available to work as live-in caregivers in Canada. If ESDC/Service Canada finds \nthe job offer acceptable, they will issue a positive or neutral LMO to the prospective new employer. \nThe live-in caregiver must include a copy of the positive/neutral LMO with their application to change employers \nand obtain a new work permit. \nFor more information about job offer validation and LMOs with respect to the LCP, please refer to the ESDC/Service \nCanada website.  \n5.6 Eligibility for permanent residence \n \n5.7 Quebec applicants \n \n5.8 Parallel processing of family members \nLive-in caregivers applying for permanent residence may request parallel processing for some or all of their family \nmembers living in or outside Canada. Family members living abroad may be processed concurrently at a visa \noffice. If all admissibility requirements are met, the responsible visa office will issue permanent resident visas to \neligible family members of live-in caregivers granted permanent residence from within Canada. \nOnce a live-in caregiver is a permanent resident, family members who are not processed concurrently may be \nsponsored as members of the family class, provided they were examined at the time of the live-in caregiver’s \napplication for permanent residence from within Canada.  \n5.9 Responding to representations \nThe Privacy Act requires that information concerning clients must be released only to the client or a designated \nrepresentative who is a Canadian citizen or permanent resident. Before responding to a representation made in \nperson or in writing, the identity of clients or their representative must be confirmed. \n6 Definitions \n6.1 Family member \nPer R1(3), the definition of “family member” in respect of a person means: \n \nthe spouse or common-law partner of the person; \n \na dependent child of the person or of the person’s spouse or common-law partner; and \nThis content has been moved as part of the Department’s efforts to modernize operational guidance \nto staff. It can now be found in the program delivery instructions on permanent residence applications \nfrom live-in caregivers. \nThis content has been moved as part of the Department’s efforts to modernize operational guidance \nto staff. It can now be found in the program delivery instructions on permanent residence applications \nfrom live-in caregivers.\n \na dependent child of a dependent child referred to above.  \n6.2 Live-in caregiver \nPer R2, a live-in caregiver is a person who resides in and provides child care, senior home support care or care of \nthe disabled without supervision in the private household in Canada where the person being cared for resides. \n7 Processing an employment contract \nESDC/Service Canada informs employers of the legal requirement to have an employment contract with their live-\nin caregiver. \nEmployers are required to:  \n \nprovide a signed employment contract to their prospective live-in caregiver; \n \nhave the live-in caregiver sign the employment contract and return it to the employer; and \n \nprovide a copy of the signed employment contract to ESDC/Service Canada along with their LMO \napplication. \nESDC/Service Canada provides employers with information including, but not necessarily limited to, the following: \n \nacceptable wage standards; \n \ntaxation; \n \nhealth insurance; and \n \nworkers’ compensation and other employment issues. \nOnce a complete LMO application and signed employment contract are submitted to ESDC/Service Canada by the \nprospective employer, an ESDC/Service Canada officer reviews the application and employment contract. In \nassessing the offer of employment, the officer confirms: \n \nthe need for live-in care; \n \nthat the job offer is genuine; \n \nthe employer is offering wages and working conditions that meet provincial/territorial employment \nstandards and labour laws; \n \nthe job duties are those of a full-time live-in caregiver; and \n \na reasonable search has been carried out by the prospective employer to identify qualified and available \nCanadian citizens or permanent residents and unemployed foreign caregivers already in Canada. \nIf satisfied that the offer of employment meets the assessment criteria, the ESDC/Service Canada officer issues a \nletter confirming a positive/neutral LMO to the prospective employer. If the LMO application is rejected, the \nESDC/Service Canada officer issues a refusal letter to the prospective employer. \nEmployers are informed by ESDC/Service Canada that their prospective live-in caregiver must submit a copy of the \nsigned employment contract to the CPC-V as part of the documentation required for the work permit application. \nESDC/Service Canada also instructs the employer to send a copy of the LMO confirmation letter to the live-in \ncaregiver.  \nDetails of the LMO are recorded in the ESDC Foreign Worker System (FWS) and job validation information is \navailable to CPC-V through the FOSS-FWS link. \nNote: For prospective employers in Quebec, ESDC/Service Canada and the MICC jointly assess the LMO application \nagainst federal and Quebec LCP requirements. If satisfied that the offer of employment meets the assessment \ncriteria, ESDC/Service Canada will issue a letter to the prospective employer, jointly signed by the MICC, \nconfirming a positive or neutral LMO. If ESDC/Service Canada and the MICC jointly render a negative decision on \nthe LMO application, ESDC/Service Canada will issue a refusal letter to the prospective employer.\n8 Procedures for issuance and renewal of work and study permits \n8.1 Applications for work permits \nNote: The Live-in Caregiver Program (LCP) is closed to new applicants. Caregivers can be hired through the \nprogram only if employers have both of the following: \n \nfound a caregiver who already has a work permit under the LCP and who is looking for a new employer  \n \nbeen approved for a labour market impact assessment (LMIA) that shows the caregiver has agreed to live \nin the employer’s home \nApplicants must submit a complete Application to Change Conditions, Extend My Stay or Remain in Canada as a \nWorker form [IMM 5710] to the Case Processing Center in Edmonton (CPC-E). \nNote: Proof of fee payment at a financial institution and a copy of the new or extended employment contract \n(signed by both the employer and live-in caregiver) must be submitted with the application.  \n8.2 Requirements for issuance of work permits  \nScenario \nDocuments applicant must provide \nActions CPC-E must take \nLive-in, full-time caregiver \nif the employer is the same \n1. Letter from the current employer \nstating that the live-in caregiver will \ncontinue to be employed on a full-time \nbasis  \n2. Copy of a new or extended \nemployment contract signed by the \nemployer and live-in caregiver \n \nNo need for a new LMIA \n \nQuebec Acceptance Certificate (CAQ) \nis required for applicants in Quebec \n1. Assess whether the applicant \ncontinues to meet the definition of a \nlive-in caregiver (that is, full-time, live-\nin employment as a caregiver) \n2. Verify that the employment contract \ncontains required information (see \nsection 5.4 for details) \n3. Verify that the applicant has \nsubmitted a CAQ with their application, \nif applicable \nLive-in, full-time caregiver  \nif there is a change of \nemployer, or if the current \nemployer is moving to a \ndifferent province or territory \n1. Copy of a new LMIA and, for \napplicants in Quebec, a CAQ \n2. Copy of a new employment contract \nsigned by the employer and live-in \ncaregiver \n1. Check the Global Case Management \nSystem (GCMS) for a record of a \npositive or neutral LMIA \n2. Verify that the employment contract \ncontains required information (see \nsection 5.4 for details) \n3. Verify that the applicant has \nsubmitted a CAQ with their application, \nif applicable \n8.3 If all requirements are met \nThe CPC-E issues a new or extended work permit and enters the “LCP” code in the special program box. \n8.4 If all requirements are not met \nThe CPC-E will refuses the application.  \nNote: If a more in-depth assessment is required to render a decision on a given application, the case should be \nreferred to an IRCC inland office.\n8.5 Bridge extension: Live-in caregiver between jobs \nIf a live-in caregiver’s work permit is about to expire, and they are between jobs and have not yet found a new \nemployer under the LCP, the CPC-E may issue an interim work permit to bridge the gap. This interim work permit \nallows a caregiver to remain in Canada legally but does not authorize them to work for a new employer. Live-in \ncaregivers may submit an application for a bridge extension using the Application to Change Conditions, Extend My \nStay or Remain in Canada as a Worker form [IMM 5710]. Cost recovery fees apply. \nThe bridge extension should \n \nhave a maximum duration of 2 months \n \nshow the most recent employer \n \ninclude “bridge extension” in the remarks \nIf the bridge extension expires before the applicant finds a new job or employer, and the applicant is eligible to \napply for a new work permit under the LCP, the CPC-E should assess the reasons for the continued unemployment \non a case by case basis and may decide to refer the case to an IRCC local office for a more in-depth examination.  \nNote: Bridge extensions are LMIA and CAQ exempt. \n8.6 Issuance of urgent or emergency work permits \nUrgent work permits \nLive-in caregivers who are changing employers and are urgently required to provide care to an elderly or disabled \nperson may be eligible for urgent processing of their LCP work permit application provided all required documents \nare submitted with the application, including proof of the urgency in the form of a doctor’s note or a letter from the \nprospective employer explaining why urgent care is required. \nSee Urgent referrals process for work permits for further information regarding the processing of work permits on \nan urgent basis.  \nEmergency work permits \nLive-in caregivers who are victims of abuse by their employer or someone in the employer’s home may be eligible \nfor emergency processing of their LCP work permit application. In such cases, concurrent processing of the \nprospective new employer’s LMIA application by Employment and Social Development Canada (ESDC) or Service \nCanada, CAQ application by the Ministère de l’Immigration, de la Diversité et de l’Inclusion (MIDI), where \napplicable, and of the LCP work permit application by IRCC on an emergency basis facilitates the quickest possible \ntransition to a new employer. \nAbusive situations, for the purposes of emergency work permit processing under the LCP, include any intentional \nphysical contact that causes harm, physical violence such as assault or sexual assault, and psychological abuse \nsuch as threats or intimidation. \nSee OB 208 – Emergency processing of in-Canada work permit applications under the LCP for details regarding \napplicant eligibility and processing of LCP work permits on an emergency basis for live-in caregivers who must \nchange employers urgently due to an abusive situation at their current or most recent workplace. \nIn addition, live-in caregivers who are experiencing abuse or who are at risk of experiencing abuse in the context \nof their employment in Canada may be eligible to obtain an open work permit for vulnerable workers. \n8.7 Refusal of an application for a work permit\nReasons for refusing a work permit application under the LCP must be well documented and provided to the \napplicant. Refusal of a work permit application from a live-in caregiver means that the person may be disqualified \nfrom applying for permanent residence in Canada under the LCP. \nShould the refused applicant request an extension of their temporary resident status, the officer should assess \ncarefully their bona fides as a temporary resident. \nIf it appears that the person may not leave Canada, has no means of support or in some other way no longer \nqualifies for temporary resident status (for example, worked without authorization), the request for an extension \nshould be refused. For more information, see the instructions on processing temporary residence extensions. \n8.8 Issuance of study permits  \nPer section 188 of the Immigration and Refugee Protection Regulations (IRPR), live-in caregivers may study \nwithout a study permit if the course or program of studies is 6 months or less. \nLive-in caregivers who wish to take a course or program of study that is longer than 6 months in duration require a \nstudy permit. \nPer section R215, the CPC E may issue study permits to live-in caregivers because they hold work permits. Officers \nshould enter the “LCP” code in the special program box of any study permits issued to live-in caregivers. \n9 Processing applications for permanent residence \n \n10 Tracking the application \nFOSS tracks the processing of applications for permanent residence through the Case Processing Support (CPS) \nmodule.  \nCPC-V staff: \n \nenter applications in the CPS module when they arrive at the CPC; \n \nenter the names of family members residing abroad in the Remarks section and complete the Y (yes) or N \n(no) box when the visa office provides results of overseas examination; \n \nindicate if the principal applicant is provisionally approved in the “approved-in-principle” field when the \neligibility decision is made; \n \nenter the results and date when eligibility requirements are met. \nWhen all requirements are met, CPC-V officers: \n \nenter the granting of permanent resident status; \n \nenter the closest CIC inland office to the client’s residence as the office of issue for permanent residence \ndocuments. \nAccording to local procedures, the CIC inland office will: \n \nprint permanent residence documents as required;  \n \nsend a call-in notice or letter to the applicant. \nThis content has been moved as part of the Department’s efforts to modernize operational guidance \nto staff. It can now be found in the program delivery instructions on permanent residence applications \nfrom live-in caregivers.\nAppendix A Sample letter – Live-in caregiver “approved-in-principle” \n \n \n \nThis content has been moved as part of the Department’s efforts to modernize operational guidance \nto staff. It can now be found in the program delivery instructions on permanent residence applications \nfrom live-in caregivers.\nAppendix B Sample letter – Procedural fairness \n \n \n \nThis content has been moved as part of the Department’s efforts to modernize operational guidance \nto staff. It can now be found in the program delivery instructions on permanent residence applications \nfrom live-in caregivers.\nAppendix C Sample letter – Refusals  \n \n \n \nThis content has been moved as part of the Department’s efforts to modernize operational guidance \nto staff. It can now be found in the program delivery instructions on permanent residence applications \nfrom live-in caregivers.\nAppendix D Fact sheet on employment standards legislation \nApplicable to live-in caregivers or domestic workers \nThis fact sheet briefly outlines employment standards provisions applicable to live-in caregivers in each province \nand territory. \nAlthough the Live-in Caregiver Program is run by the federal government, employment standards legislation \npertaining to caregivers and domestics falls within provincial and territorial jurisdiction. Federal legislation (namely \nthe Canada Labour Code and Regulations) applies only to certain specific sectors such as banking, interprovincial \nand international transportation, telecommunications, broadcasting, grain handling and uranium mines. \nIt should be noted that the provisions in provincial and territorial employment standards legislation and their scope \nmay vary from one jurisdiction to another. This means that minimum working conditions prescribed by law are not \nidentical across Canada for live-in caregivers or domestic workers (In several provinces, the law makes no \ndistinction between live-in caregivers and the more general category of “domestic workers.”) \nUnder the Immigration and Refugee Protection Act and Regulations, employers and live-in caregivers must sign an \nemployment contract that clearly defines the rights and responsibilities of both parties. The terms and conditions of \nthe employment contract must by law be consistent with provincial/territorial employment standards and labour \nlaws. In some provinces and territories, employment standards legislation does not, in whole or in part, apply to \nlive-in caregivers. Where there is no minimum wage applicable in a particular province or territory, Employment \nand Social Development Canada (ESDC) determines the wage rate to be paid by employers. In some parts of the \ncountry, ESDC requires employers to pay wages higher than the minimum wage rate, based on the prevailing wage \npaid for this type of work. \nFor more information on employment standards and labour laws in provinces and territories, please consult the \nfollowing websites. Please note that the following information is subject to change. \nAlso note that the ESDC website provides a table of regional wages, working conditions and advertisement \nrequirements for the Live-in Caregiver Program: www.esdc.gc.ca/eng/jobs/foreign_workers/caregiver/index.shtml. \nAlberta \n \nWebsite: www.employment.alberta.ca/SFW/1224.html (available in English only) \nBritish Columbia \n \nWebsite: www.labour.gov.bc.ca/esb/ (available in English only) \nManitoba \n \nWebsite: www.gov.mb.ca/labour/standards/ \nNew Brunswick \nNew Brunswick’s Employment Standards Act and Regulations do not apply to persons working in private homes. \nTherefore, live-in caregivers have no protection under provincial employment standards legislation, which makes it \nall the more important to clearly spell out the working conditions in the employment contract. \n \nWebsite: www2.gnb.ca/content/gnb/en/departments/post-\nsecondary_education_training_and_labour/labour.html \nNewfoundland and Labrador\n \nWebsite: www.gov.nl.ca/lra/faq/labourstandards.html \nNorthwest Territories and Nunavut \n \nWebsite: http://www.ece.gov.nt.ca/sections/employment \nNova Scotia \n \nWebsite: novascotia.ca/lae/employmentworkplaces/ \nOntario \n \nWebsite: www.labour.gov.on.ca/english/es/ \nPrince Edward Island \n \nWebsite: www.gov.pe.ca/index.php3?lang=E \nQuebec \n \nWebsite: www.cnt.gouv.qc.ca/en/home/index.html \nSaskatchewan \nSaskatchewan’s Labour Standards Act and Regulations do not apply in the same way to “care providers” as they do \nto domestic workers (these two categories have their own definitions). The minimum employment standards also \nvary depending on whether or not the employee lives with the employer. \n \nWebsite: ae.gov.sk.ca/ (available in English only) \nYukon Territory \nMost provisions of the Employment Standards Act apply to domestics, including domestic homemakers. However, \nthe Act does not cover sitters working in a private residence solely to attend to a child, or to a disabled, infirm or \nother person (General Exemption Regulations).  \n \nWebsite: www.community.gov.yk.ca/es.html\nAppendix E Provincial and territorial employment standards – Contact \ninformation \nIf you have questions, difficulties or complaints regarding your employment as a live-in caregiver, you can call or \nvisit the labour or employment standards branch for your province or territory. The counsellors at these offices will \nbe able to answer questions you may have about your rights and help you if you are having any work-related \ndifficulty with your employer. Sometimes you will hear a pre-recorded message when you call these numbers. Just \nstay on the line and follow the directions that you receive. If the recorded message does not answer your question, \na counsellor will eventually come on the line. These numbers are used frequently, and it may take more than one \ntry to get through. Be patient. \nIf you prefer, you can write to the office responsible for labour or employment standards in your province or \nterritory. Just write a letter clearly indicating your question or concern and mail it to the address shown. Be sure to \ninclude your name and occupation (what you do) and how you can be reached (phone number and address). If it is \nimportant that you get assistance quickly, remember that calling is faster than writing. Do not hesitate to contact \nthese people. They are here to help you. \nPlease visit the CIC website for further details: http://www.cic.gc.ca/english/work/caregiver/arriving.asp.\nAppendix F Counselling fact sheet \nImportant Information for Live-in Caregivers \nThe CIC website provides information on the rights of temporary foreign workers and the law: \nhttp://www.cic.gc.ca/english/work/tfw-rights.asp. \nYou must have a written employment contract signed by both you and your employer. The contract defines your \njob duties, hours of work, salary and benefits, such as overtime. The contract also reinforces your employer’s legal \nresponsibilities to you. This requirement helps provide a fair working arrangement between you and your employer, \nand provides both of you with a clear understanding of what is expected of you. \nYou should ask for a “pay slip” with each pay cheque that shows your deductions and net pay (pay after \ndeductions). \nIf you are not happy with your job, you should tell your employer. A little flexibility on both sides is often enough to \ncause changes so that you are both happy. Some employers have waited a long time and may have paid agency \nfees to bring you to Canada. They will appreciate your honesty. \nIf you decide to change employers, you cannot begin work until you get a new work permit that names your new \nemployer. Your new employer needs to get approval from Employment and Social Development Canada/Service \nCanada before you can get your new work permit and begin working for them. \nThe work permit you receive when you enter Canada may allow you to work in Canada as a live-in caregiver for up \nto four years plus three months. The date when your work permit expires is on the work permit. Even if you do not \nchange employers, you need to renew your work permit as required before it expires. You should apply for an \nextension of your work permit in Canada at least three months in advance of the expiry date. This is your \nresponsibility, not your employer’s. \nIt is your responsibility to keep your legal documents (such as your work permit and passport) safe. You should not \ngive them to anyone, even your employer. Although you may be asked to show these documents for verification \n(for example, your employer may ask to see your work permit), you should always keep them in your possession. \nUnder no circumstances can an employer have you deported from Canada. Your employer has no authority to hold \nyour passport. \nIf you or someone else lied about your education, training or experience when you first applied in the Live-in \nCaregiver Program outside Canada, you could be disqualified from the program in Canada. \nIf you want to apply for permanent residence in Canada: \n \nyou must work full-time as a live-in caregiver for at least 24 months or a total of 3,900 hours in a \nminimum of 22 months within the four years immediately following your entry into Canada under the Live-\nin Caregiver Program; \n \nyou, your spouse and your dependent children must meet admissibility requirements and must not be \ngoing to an immigration inquiry (hearing) or be under an order to leave Canada. For example, if you \nmarry a refugee claimant in Canada, the status of your spouse could prevent you from obtaining \npermanent resident status; \n \nyou must live in the home of the person(s) for whom you have been hired to provide care or you cannot \ncontinue to work in the Live-in Caregiver Program, and you cannot apply for permanent residence; and \n \nyou must maintain your temporary resident status and have a valid work permit as a live-in caregiver at \nthe time you apply for permanent residence. \nWhen calculating your work experience as a live-in caregiver, you cannot include: \n \nany periods of unemployment; \n \nany extended time outside Canada (for example, if you leave Canada for longer than the period of \nvacation time allotted in your employment contract, that period does not count); or\n \nany period you work for your employer outside Canada (for example, time spent on a family vacation will \nnot count). \nIf you plan to apply for permanent residence, you may wish to get original documents that show, in as much detail \nas possible, all of your education, training and experience before you leave your country. These documents could \nhelp you when you apply for work in Canada, or help you get into a program of study, after you become a \npermanent resident. It is often easier to get these documents while you are still in your home country. \nIf you had to get a temporary resident visa to come to Canada, you may have to get a new one if you leave \nCanada temporarily, on holidays, for example, unless you are visiting the United States."
}