{
  "type": "pdf",
  "source": "Refusal_of_National_Security_Cases_-_Processing_of_National_Interest_Requests.pdf",
  "text": "IP 10 Refusal of National Security Cases/Processing of National Interest \nRequests \n2012-04-30 \n \n1 \n \nUpdates to chapter .......................................................................................................................... 2 \n1.What this chapter is about ............................................................................................................ 3 \n2.Program objectives ....................................................................................................................... 3 \n3.The Act and Regulations .............................................................................................................. 3 \n4.Instruments and delegations ........................................................................................................ 3 \n5.Departmental policy ...................................................................................................................... 3 \n6.Definitions ..................................................................................................................................... 3 \n7.Procedure - Procedural fairness ................................................................................................... 4 \n7.1.General requirements ............................................................................................................ 4 \n7.2.Specific requirements ............................................................................................................ 4 \n8.Procedure - Adverse information .................................................................................................. 4 \n8.1.File transfer from CPC ........................................................................................................... 4 \n8.2.Role of inland CIC .................................................................................................................. 5 \n8.3.Guidance to officers ............................................................................................................... 5 \n8.4.Interview required .................................................................................................................. 5 \n8.5.Preparation for interview ........................................................................................................ 6 \n8.6.Conduct of interview .............................................................................................................. 6 \n8.7.Exceptions to interview .......................................................................................................... 6 \n8.8.Rendering a decision ............................................................................................................. 7 \n8.9.Suspending the application for investigative purposes .......................................................... 7 \n9.Procedure - Requests for relief..................................................................................................... 8 \n9.1.Principles ................................................................................................................................ 8 \n9.2.Processing the request .......................................................................................................... 8 \n9.3.Disclosure to client ................................................................................................................. 8 \n9.4.After disclosure ...................................................................................................................... 8 \n9.5.After issuance of Minister’s decision ...................................................................................... 8 \n10.Procedure - Cases under enforcement action ............................................................................ 8 \nAppendixA Interview convocation letter .......................................................................................... 9 \nAppendixB National interest information sheet ............................................................................. 10 \nAppendixC Disclosure letter in lieu of interview ............................................................................ 11 \nAppendixD Preparing the request for relief report ......................................................................... 12 \nAppendixE Final disclosure letter .................................................................................................. 13 \nAppendixF Refusal letter (Application for permanent residence refused based on A34, A35 or \nA37; request for ministerial relief denied) ...................................................................................... 14 \nAppendixG Contacts at the National Security Division, CBSA ...................................................... 15\nIP 10 Refusal of National Security Cases/Processing of National Interest \nRequests \n2012-04-30 \n \n2 \n \n \nUpdates to chapter \nListing by date \nDate: 2012-04-30 \nAmong the changes to this chapter, the highlights include: \n \nDelete the portion in section 1 about Ministerial relief.  \n \nDelete the portion in section 4 about Ministerial relief. \n \nDelete the portion of section 5 that addresses Ministerial relief.  \n \nDelete all of the text in section 6, except\n \nDelete the portion in 7.2 about Ministerial relief. \n for the portion titled National security. Specifi-\ncally, the portions titled Ministerial relief and National interest would be deleted. \n \nDelete the portion of 8.6 about Ministerial relief \n \nDelete the portion of 8.8 about Ministerial relief.   \n \nDelete all of the text in section 9 \n \nDelete most of section 10. Specifically, delete the last sentence of the first paragraph and \nthe last sentence of the second paragraph.  Plus, delete the third, fourth and fifth para-\ngraphs.   \n \nDelete the text in appendices B, D, and E \n \nDate: 2005-10-24 \nAmong the many changes to this chapter, the highlights include: \n• \nSection 8.3 “Procedures at inland CIC” was renamed “Guidance to officers” to \nprovide more accurate information on information sources where officers may consult \nwhen processing these types of cases. \n• \nSection 8.4 was updated to reflect updated information for officers regarding the \npurpose of security interviews  \n• \nSection 8.7 “Exceptions to interview” was added. \n• \nSection 8.8 was clarified to include additional information for officers relying on a \nprevious finding of inadmissibility or exclusion by an independent tribunal as a \nconclusive finding of fact.  \n• \nSection 8.9 “Suspending the application for investigative purposes” was added to \nclarify procedures for CIC officers who are not in a position to render a decision on a \ncase due to lack of open source information or require further investigation. In such \ninstances, the file may have to be transferred to the CBSA for further research and \ninvestigation. \n• \nSections 9.2 and 9.4 were amended to include the new address for the CIC officer’s \nreport to the CBSA. \n \n1. \nWhat this chapter is about \nIn addition to the general procedures for processing applications for permanent residence \nin Canada this chapter outlines procedures to be applied in cases involving possible \ninadmissibility on grounds of national security. These guidelines are issued to ensure \nconsistency in the application of procedural fairness requirements.\nIP 10 Refusal of National Security Cases/Processing of National Interest \nRequests \n2012-04-30 \n \n3 \n2. \nProgram objectives \nThe program objectives addressed by these procedures are: \n• \nto protect the safety and security of Canadians; \n• \nto deny access to Canada to persons who are security risks or involved in organized \ncrime; \n• \n to ensure that Canada does not become a safe haven for persons who have been \ninvolved in war crimes or crimes against humanity. \n3. \nThe Act and Regulations \nFor information about: \nRefer to: \nInadmissibility on security grounds \nA34 \nInadmissibility on grounds of human or international rights \nviolations \nA35 \nInadmissibility on grounds of organized criminality \nA37 \nReport on inadmissibility \nA44(1) \n4. \nInstruments and delegations \nCIC officers with the delegated authority to process an application for permanent \nresidence have the authority to make a finding of inadmissibility and refuse an application \nif an applicant is described in A34(1), A35(1) and A37(1). See IL 3, Module 1, items 20, \n32 and 34. \n5. \nDepartmental policy \nAn officer must be satisfied that a foreign national is not inadmissible before granting an \napplication for permanent residence. One of the objectives of IRPA is to deny access to \nCanadian territory to persons who are criminals and security risks. In keeping with this \nobjective, officers must refuse an application for permanent residence if the applicant is \ninadmissible on grounds of security [A34], human or international rights violations [A35], \nand organized criminality [A37]. This chapter applies to all applications for permanent \nresidence in Canada.  \n6. \nDefinitions \nNational security \nRefers to grounds of inadmissibility which pertain to the above program objectives. These \nare contained in sections A34, A35, and A37. \n7. \nProcedure - Procedural fairness \n7.1. \nGeneral requirements \nProcedural fairness is a broad concept which applies in various ways to all facets of \nprocessing. A general overview of procedural fairness may be found in OP 1, section 8. \nApplications for permanent residence are normally decided on the basis of the \ninformation provided by the applicant, not on extrinsic or third party information. \nHowever, if the finding of inadmissibility is based on extrinsic information, the applicant is \nentitled to be made aware of this information and to present evidence and submissions in \nresponse to this information.\nIP 10 Refusal of National Security Cases/Processing of National Interest \nRequests \n2012-04-30 \n \n4 \nClassified information must never be disclosed to the applicant. In cases involving \nclassified information, officers are required to contact the National Security Division, \nIntelligence Directorate, CBSA for guidance. Refer to Appendix G for contact information. \n7.2. \nSpecific requirements \nThe procedural fairness requirements when assessing inadmissibility are as follows: \n• \nThe decision-maker must make the decision on complete information. All documents \nprovided by the applicant must be considered by the decision-maker. It is not \nacceptable that the contents of such documentation be summarized for the decision \nmaker without attaching the primary documentation. \n• \nThe applicant is entitled to be provided with all the relevant information that will be \nconsidered by the decision-maker to challenge the information and to present \nevidence and submissions. This entitlement is limited where disclosure of the \ninformation would be injurious to national security or to the safety of any person. \n• \nThe applicant is entitled to be made aware of concerns raised by the officer and to \nrespond to those concerns. \n8. \nProcedure - Adverse information \n8.1. \nFile transfer from CPC \nProtected persons and other prescribed classes of foreign nationals can apply to become \npermanent residents from within Canada. They must meet the requirements of the Act \nand Regulations and not be inadmissible.  \nForeign nationals may also apply to become permanent residents from within Canada \nbased on humanitarian and compassionate considerations pursuant to A25. These \nguidelines must be read in conjunction with IP 5 when making a decision on the \napplicant’s admissibility. \nApplications for permanent residence will normally be processed by the CPC unless \nthere are known or suspected grounds of inadmissibility such as serious criminality or \nnational security reasons. In these cases, the file is transferred to the local CIC for \ncontinued processing. \n8.2. \nRole of inland CIC \nThe officer at the inland CIC office must review the available information, obtain any \nfurther information that may be required and make a determination on admissibility. If the \nofficer determines that the person is not inadmissible, the officer will conclude the case to \nthe granting of permanent residence. If the officer determines that the person is \ninadmissible, the application for permanent residence will be refused and the file \ntransferred to the appropriate CBSA enforcement unit. The A44(1) report will be prepared \nafter the file transfer in cases of national security.  \n \n8.3. \nGuidance to officers \nThese cases are usually complex and often require the input of an Intelligence Analyst, in \nparticular, where adverse information is received from another agency. For functional \ndirection and guidance in applying the inadmissibility provisions of the Immigration and \nRefugee Protection Act (IRPA), consult ENF 1 Inadmissibility. It is a requirement that the \nCIC officer contact the National Security Division Intelligence Directorate, CBSA. An \nanalyst will be assigned as a resource person to assist the officer. \nThe CBSA analyst will provide the following assistance: \n• \nsuggestions and guidance for processing of the case;\nIP 10 Refusal of National Security Cases/Processing of National Interest \nRequests \n2012-04-30 \n \n5 \n• \ndevelopment of a strategy for interview and assistance in developing interview \nquestions;   \n• \nclarification of the adverse information and whether it could result in a finding of \ninadmissibility on national security grounds;  \n• \nrequest for additional information from sources that may not be available to the \nofficer;  \n• \nguidance on disclosure where the information could be injurious to national security \nor to the safety of any person. \nWhen appropriate, CIC officers may also seek guidance from Regional Intelligence and \nEnforcement Units, CBSA. \nFor additional information on processing individuals alleged to have committed war \ncrimes and/or crimes against humanity, consult ENF 18 War crimes and crimes against \nhumanity.  \n8.4. \nInterview required \nWhere it appears that information may render the applicant inadmissible on national \nsecurity grounds, the applicant should be invited by letter to attend an interview with CIC. \nThe content of the letter may be discussed with the CBSA NHQ analyst, but should \nalways include section A34, A35, or A37 in their entirety. (Refer to Appendix A for a \nsample invitation letter). The purpose of the interview is: \n• \nto apprise the applicant of the extrinsic information that will be taken into account in \nrendering a decision on admissibility; \n \n• \nto apprise the applicant of concerns about their admissibility to Canada; \n \n• \nto allow the applicant to address concerns regarding fraud or misrepresentation, if \napplicable; \n \n• \nto provide the applicant with an opportunity to address the extrinsic information as \nwell as the officer’s concerns and to provide any additional information or \nsubmissions relating to their admissibility; \n \n• \nto enable the officer to obtain sufficient information from the applicant for the purpose \nof assessing potential inadmissibility. \nNote: It is important that officers inform applicants prior to the commencement of the \ninterview that it is not an admissibility hearing, where immediate enforcement action may \nfollow, but rather, it is for fact-finding purposes to enable the officer to assess the client’s \napplication for permanent residence.  \n8.5. \nPreparation for interview \nPreparation is critical for a successful interview. It is essential that all extrinsic information \nand concerns are presented to the applicant in a structured manner without revealing \nclassified information or third party sources. Interview strategy and interview questions \nshould be developed in consultation with the CBSA NHQ analyst assigned to the case. \nThe issue of what information can be disclosed and how it may be presented should be \ndeveloped in consultation with the NHQ analyst. If the applicant provided misleading \ninformation or omitted relevant information on the application, the issue of \nmisrepresentation should be addressed. It is recommended that such interviews be \nconducted by experienced officers or officers specialized in national security cases.\nIP 10 Refusal of National Security Cases/Processing of National Interest \nRequests \n2012-04-30 \n \n6 \n8.6. \nConduct of interview \nThe applicant must be advised that the purpose of the interview is to discuss the \nconcerns relating to admissibility and to provide the applicant with an opportunity to \naddress these concerns. \nThe officer must advise the applicant of any additional information of which they may not \nbe aware that will be considered in rendering a decision on admissibility. The exact \ncontent of what can be disclosed and how it should be presented will have been \npredetermined through consultation with the CBSA NHQ. If the officer has additional \nconcerns that will be used in rendering a decision, they must also be disclosed to the \nclient. The client must be permitted to respond to all of the information and concerns.  \n \nIt is important that detailed notes be placed on file documenting what was disclosed at \nthe interview and the applicant’s responses. These notes will constitute the record of \nwhat transpired at the interview and will assist the officer in rendering a final decision. If \nthe decision is to refuse the application, the notes will be of assistance when preparing \nthe letter of refusal. The notes will also be of assistance in any future litigation to \ndemonstrate that procedural fairness was provided to the applicant. Upon completion of \nthe interview, the applicant should be informed that a letter will be issued advising of the \ndecision. \nWhere the applicant requests additional time to prepare a written submission, they should \nbe provided with a reasonable time (e.g., 15 days) to do so. It should be made clear \nthat,if written submissions are not received by that time, a final decision will then be \nrendered. \n8.7. \nExceptions to interview \nAn interview is always considered preferable to an exchange of documents. It allows the \nofficer to observe the non-verbal behaviour of the applicant, which may provide insights \ninto credibility, and provides an opportunity for continuous exchange and clarification. It \nalso allows an opportunity for the applicant to ask additional questions and seek \nclarification.  \nThere will be situations where an interview is not practical due to distance, security, or \nother considerations. In such situations, the disclosure may be done in writing. This will \nrequire that the additional extrinsic information that would otherwise be given at an \ninterview be provided to the applicant in writing, subject to the limits on disclosure \nmentioned above. The letter should be prepared in consultation with the CBSA NHQ \nanalyst, as required,and be delivered by courier. The person should sign the \nacknowledgment of receipt. See Appendix C for a sample disclosure letter. \n8.8. \nRendering a decision \nThe results of the interview may be discussed with the CBSA NHQ analyst. However, the \nanalyst must exercise caution in providing information and advice to the officer to ensure \nthat their decision is not fettered. Notwithstanding any advice that may be provided, \nofficers are expected to exercise their independent judgement in deciding whether a \nperson is inadmissible.  \nIt should be noted that officers processing an application for permanent residence may \nrely on a previous finding of inadmissibility or exclusion by an independent tribunal such \nas the IRB or the Federal Court as a conclusive finding of fact. However, an A44(1) \nreport, which was not the subject of an admissibility hearing, does not constitute, in itself, \na conclusive finding of fact concerning the person’s inadmissibility. \nProcedural fairness requires that the officer must render a decision in a timely manner. \nWhere the officer determines that the person is not inadmissible on grounds of national \nsecurity, the person should be advised accordingly and informed that the processing of \nthe application will continue. Where the officer determines that the person is inadmissible,\nIP 10 Refusal of National Security Cases/Processing of National Interest \nRequests \n2012-04-30 \n \n7 \na letter refusing the application for permanent residence should be sent to the applicant. \nWhile it is not necessary to provide detailed reasons to the client, the officer must record \nthe reasons for their decision in notes on the file. The content of the letter may be \ndiscussed with the CBSA NHQ analyst. See Appendix F for a sample refusal letter. \nAfter the application for permanent residence has been refused, the file should be \ntransferred to the appropriate CBSA enforcement unit. The enforcement unit will \ndetermine the appropriate action to take, including whether to prepare an A44(1) report \nand refer it to the Immigration Division for an admissibility hearing. \n8.9. \nSuspending the application for investigative purposes \nFollowing the interview, there may be some instances where the CIC officer is not in a \nposition to make a determination on the applicant’s admissibility due to the lack of open \nsource information and/or the requirement for further investigation. The CIC officer, with \nconcurrence of their supervisor, may hold processing of the application for permanent \nresidence in abeyance and transfer the file to the CBSA.  \nThe CBSA will complete the investigation as required and determine whether it is \nappropriate to prepare a section 44 report and proceed with an admissibility hearing. The \nCIC officer will resume processing of the application for permanent residence if the CBSA \ndetermines that the case does not require referral to the Immigration Division or when a \ndecision has been made by the Immigration Division concerning the applicant's \nadmissibility. For further information in this regard, refer to section 10 entitled “Cases \nunder enforcement action” . \nAs the application for permanent residence cannot remain in abeyance indefinitely, CIC \nand the CBSA should remain in regular contact throughout this process until the case has \nbeen finalized. \nThe circumstances of the case will dictate the appropriate course of action. It is expected \nthat the CIC officer will refuse the application for permanent residence where there is \nevidence supporting the inadmissibility. Examples include senior officials (described in \nR16) in a designated regime, persons previously determined to be inadmissible by the \nImmigration Division or excluded pursuant to Article 1 F of the 1951 Convention Relating \nto the Status of Refugees (http://www.ufsia.ac.be/~dvanheul/migration/genconv.html) by \nthe Refugee Protection Division, persons who come forward and admit membership in \nterrorist organizations, etc. In such instances, referral to the CBSA for further \ninvestigation or an admissibility hearing will only prolong processing needlessly and may \ntrigger litigation and court costs.      \n9. \nProcedure - Requests for relief \n\"The content of this section is currently under review. In the interim, please send any \ninquiries to the CBSA Ministerial Relief Unit at the following email address: \nMinisterial_Relief.Exemptions_Ministerielles@cbsa-asfc.gc.ca” \n \n10. \nProcedure - Cases under enforcement action \nA person making an application for permanent residence may also be the subject of \nenforcement action. To ensure a coordinated approach, there should be regular \ncommunication between the inland CIC office processing the application for permanent \nresidence and the CBSA office pursuing enforcement action.  \n \nA44 reports include a reference to the relief provision in IRPA, where applicable. Where a \nperson who is the subject of an A44 report referred to the Immigration Division requests\nIP 10 Refusal of National Security Cases/Processing of National Interest \nRequests \n2012-04-30 \n \n8 \ninformation on how to apply for relief, the National Interest Information Sheet (see \nAppendix B) will be issued to that person.  \n \n\"The content of this section is currently under review. In the interim, please send any \ninquiries to the CBSA Ministerial Relief Unit at the following email address: \nMinisterial_Relief.Exemptions_Ministerielles@cbsa-asfc.gc.ca”\nIP 10 Refusal of National Security Cases/Processing of National Interest \nRequests \n2012-04-30 \n \n9 \nAppendix A Interview convocation letter  \n (Insert letterhead) \nOur Ref: \n(Insert address) \nDear: \nThis refers to your application for permanent residence in Canada. \nInformation available suggests that your application for permanent residence may have to \nbe refused as it appears you may be inadmissible to Canada, pursuant to section ____of \nthe Immigration and Refugee Protection Act. Therefore, we are requesting that you \nattend an interview at our office on (insert date) at (insert time). \nThe purpose of the interview will be to discuss our concerns and to provide you with an \nopportunity to respond. The information that we have obtained indicates that you \n_______ (exact content to be developed in consultation with NHQ). Please note that \nunder Canadian immigration legislation it is your responsibility to demonstrate that you \nare not a member of an inadmissible class. A copy of some inadmissible classes is \nattached. (The attachment will include sections A33-A37 in their entirety.) \nShould you not attend this interview, your application for permanent residence may be \nconsidered to have been abandoned. \n \nSincerely,\nIP 10 Refusal of National Security Cases/Processing of National Interest \nRequests \n2012-04-30 \n \n10 \n \nAppendix \nB National interest information sheet \n \n\"The content of this section is currently under review. In the interim, please send any \ninquiries to the CBSA Ministerial Relief Unit at the following email address: \nMinisterial_Relief.Exemptions_Ministerielles@cbsa-asfc.gc.ca”\nIP 10 Refusal of National Security Cases/Processing of National Interest \nRequests \n2012-04-30 \n \n11 \n \nAppendix \nC Disclosure letter in lieu of interview \n(To be used when an interview is not practical) \n(Insert letterhead) \nOur Ref: \n(Insert address) \nDear: \nThis is further to your application for permanent residence in Canada. \nInformation available suggests that your application for permanent residence may have to \nbe refused as it appears you may be inadmissible to Canada, pursuant to section ____of \nthe Immigration and Refugee Protection Act. Before rendering a final decision in this \nmatter, we wish to provide you with an opportunity to respond to this information and to \naddress our concerns. \nThe information that we have obtained indicates that you (exact content to be developed \nin consultation with NHQ). Please note that under Canadian immigration legislation it is \nyour responsibility to demonstrate that you are not a member of an inadmissible class. A \ncopy some inadmissible classes is attached. (The attachment will include sections A33 to \nA37 in their entirety.) \nShould you wish to address these matters, we must receive your submissions by (enter \ndate - 30 days suggested). If we receive nothing from you by then, your application for \npermanent residence may be considered abandoned. \nSincerely,\nIP 10 Refusal of National Security Cases/Processing of National Interest \nRequests \n2012-04-30 \n \n12 \n \nAppendix \nD Preparing the request for relief report \n\"The content of this section is currently under review. In the interim, please send any \ninquiries to the CBSA Ministerial Relief Unit at the following email address: \nMinisterial_Relief.Exemptions_Ministerielles@cbsa-asfc.gc.ca”\nIP 10 Refusal of National Security Cases/Processing of National Interest \nRequests \n2012-04-30 \n \n13 \nAppendix \nE Final disclosure letter \n\"The content of this section is currently under review. In the interim, please send any \ninquiries to the CBSA Ministerial Relief Unit at the following email address: \nMinisterial_Relief.Exemptions_Ministerielles@cbsa-asfc.gc.ca”\nIP 10 Refusal of National Security Cases/Processing of National Interest \nRequests \n2012-04-30 \n \n14 \n \n \nAppendix \nF Refusal letter (Application for permanent residence refused based on A34, A35 \nor A37; request for ministerial relief denied) \n(Insert letterhead) \nOur ref: \n(Insert address) \n \nDear: \nThis refers to your application for permanent residence. A letter dated (insert date) was \nsent to you inviting you to respond to concerns about your admissibility. The information \nyou provided (in your letter of ___ or at the interview on ____) has been carefully \nreviewed together with all other information in your application. \nIt appears that you are a person described in section (34, 35 or 37) of the Immigration \nand Refugee Protection Act. I have come to the conclusion that you are inadmissible to \nCanada based on (provide details concerning individual circumstances as they relate to \nthe finding of inadmissibility. Exact content may be developed in consultation with NHQ).  \nWhen client has requested ministerial relief and the Minister has not granted relief, \nofficers should insert the following paragraph: \nFurthermore, you have not satisfied the Minister of Public Safety and Emergency \nPreparedness that your presence in Canada would not be detrimental to the national \ninterest. As a result, your application for permanent residence is refused. \nSincerely,\nIP 10 Refusal of National Security Cases/Processing of National Interest \nRequests \n2012-04-30 \n \n15 \n \nAppendix \nG Contacts at the National Security Division, CBSA \nFor persons described in A34(1) contact: \nSecurity Review Division by e-mail at Nat-Security-Review@cic.gc.ca \n \nFor persons described in A35(1) contact: \nModern War Crimes Division by e-mail at Nat-WarCrimes@cic.gc.ca \n \nFor persons described in A37(1) contact: \nOrganized Crime Division by e-mail at Nat_Organized_Crime@cbsa-asfc.gc.ca"
}