{
  "type": "pdf",
  "source": "Study permit_ Prepare for arrival - Canada.ca.pdf",
  "text": "Canada.ca\n \nImmigration and citizenship\n \nStudy in Canada as an international student\nStudy permit\nIRCC sign in\n\n\n\nStudy permit\nWho can apply\nGet the right documents\nHow to apply\nAfter you apply\nPrepare for your arrival\nWhile you study\nPrepare for your arrival\nBefore you come to Canada\nBefore you arrive, read the pre-departure guide for tips and information\nabout student life in Canada.\nTo help ensure a smooth arrival in Canada, please check the Canadian\nBorder Service Agency’s information for international students, and\ndownload their PDF pamphlet (PDF, 592 KB).\nHow early can you arrive in Canada before you start\nstudying\nThere is no set time frame for you to arrive in Canada before you begin your\nstudies. You should just give yourself a reasonable amount of time to\nprepare before you start studying.\nYou are not allowed to work on or off campus until you begin your studies\nin Canada.\nChanging your designated learning institution if you’re\noutside Canada\nIf your application for a study permit has been approved and you change\nyour designated learning institution (DLI), you must submit a new study\npermit application with a new letter of acceptance. You must also pay all the\nfees for the new application.\nIf you want to defer your enrolment before arriving in Canada\nIf your application has been approved and you want to defer your\nenrolment (which means you want to start studying later than planned)\nat the DLI that has already issued your letter of acceptance (LOA), you\nneed to\nget your deferral approved by the DLI\nget an updated LOA\nhave a valid letter of introduction\nYou need to show these documents at the port of entry when you\narrive in Canada.\nWhen you arrive in Canada\nWhen you arrive in Canada, you’ll meet a border services officer who will\nmake sure you meet some basic requirements. To enter Canada, you must\nhave a valid travel document, such as a passport\nhave the port of entry letter of introduction the visa office sent you\nwhen they approved your study permit\nThis letter has your permit reference number, which we use to issue\nyour study permit.\nhave a copy of a valid letter of acceptance from your school\nhave letters of reference or any other documents the visa office told you\nto bring\nhave a valid electronic travel authorization (eTA), a valid visitor visa\n(temporary resident visa), a valid green card (or equivalent official proof\nof U.S. status) or another valid travel document\nIf you have a valid eTA, it’ll be linked to the passport you used to\napply for your study permit.\nhave enough money for your stay (the amount you will need can vary—\nit depends on things such as how long you will stay, and whether you\nwill stay in a hotel, or with friends or relatives)\nbe in good health\nhave no criminal or immigration-related convictions\nconvince an immigration officer that\nyou have ties—such as a job, home, financial assets or family—that\nwill take you back to your home country\nyou will leave Canada at the end of your visit\nhave valid immigration medical exam results (if you needed one)\nYour exam is valid for 12 months from the day you get it.\nIt must be valid the day you enter Canada.\nIf your exam will expire before you enter Canada, you need to get\nanother medical exam.\nThis applies even if your letter of introduction is still valid.\nprove that you’ll leave Canada at the end of your stay\nIf you need proof you entered Canada\nYour school or training facility may need you to prove you entered Canada.\nIf you need proof of entry, make sure a border services officer stamps your\npassport before you leave Canadian customs. You may also be able to use\na Primary Inspection Kiosk to stamp your passport.\nDate modified:\n2025-05-07\nWhile you study\nInadmissibility\nSome people are inadmissible—they’re not allowed to come to Canada.\nSeveral things can make you inadmissible, including involvement in criminal\nactivity, in human rights violations or in organized crime.\nYou can also be inadmissible for security, health or financial reasons. Find\nout more about inadmissibility.\n"
}