{
  "type": "pdf",
  "source": "Study permit_ While you study - Canada.ca.pdf",
  "text": "Canada.ca\n \nImmigration and citizenship\n \nStudy in Canada as an international student\nStudy permit\nIRCC sign in\n\n\n\nStudy permit\nWho can apply\nGet the right documents\nHow to apply\nAfter you apply\nPrepare for your arrival\nWhile you study\nWhile you study\nWhile you’re studying in Canada as an international student, you must meet\nthe conditions of your study permit and keep your profile information\nupdated in your online account. If your study program is ending soon, you\nalso need to know how long you can stay in Canada and what to do if you\nplan to stay longer.\nOn this page\nUpdating your profile information\nChanging the conditions of your study permit\nHow long your study permit is valid\nStaying in Canada after you graduate\nUpdating your profile information\nIf information in your profile changes, you must update it in your online\naccount.\nYou may need to update your profile if you\nneed to update documents or your contact information\nChanging schools\nNew process for post-secondary study permit holders\nStarting November 8, 2024, if you want to change your post-secondary\nschool, you need to get a new study permit by applying to extend your\ncurrent one. Find out more.\nBefore you change your school, you must meet all the conditions of your\nstudy permit. This means you must be\nenrolled at a designated learning institution (DLI) and\nactively studying at that DLI\nYou need to follow our instructions if you are changing schools at the post-\nsecondary level.\nIn addition, if you are in a co-op program and are changing to a co-op\nprogram at a different school, you must apply for a new co-op work permit.\nIf you were accepted to a new DLI for the Winter or Spring 2025\nsemester (starting from January 1, 2025 to May 1, 2025)\nYou can start studying at your new DLI if you\nhave been accepted to a DLI for the Winter or Spring 2025\nsemester (starting from January 1, 2025 to May 1, 2025), and\n\nhave applied for a study permit extension, and\nhave a study permit that remains valid and that doesn’t have the\nDLI name printed on it, and\nmeet all your existing study permit conditions\nIf you meet these criteria, you may start attending the new DLI you\nwanted to transfer to while your study permit extension is being\nprocessed.\nIf your DLI loses its designated status\nIf the DLI you’re studying at loses its designated status\nyou can keep studying until your current study permit expires\nyou won’t be able to extend your permit unless the institution has\nbeen re-designated by its province or territory\nyou will not be able to apply for a study permit extension to begin a\nnew program at a de-designated institution\nyou can apply for a study permit extension to change DLIs\nAs long as you are in one of the eligible situations, you are\nallowed to begin studying at your new DLI right after you\napply, rather than wait for your study permit extension to be\napproved.\nIf your DLI is placed on the suspension list\nIf the DLI you’re studying at is placed on the suspension list\nyou can keep studying until your current study permit expires\nyou will be able to extend your study permit to complete your\ncurrent program, if necessary\nyou will not be able to apply for a study permit extension to begin a\nnew program at a suspended DLI\nyou can apply for a study permit extension to change DLIs\nAs long as you are in one of the eligible situations, you are\nallowed to begin studying at your new DLI right after you\napply, rather than wait for your study permit extension to be\napproved.\nLearn more about changing schools.\nUpdating your contact information or documents\nContact information\nYou must keep the contact information on your study permit up to date. If\nyour contact information changes, use our web form to update it.\nMedical exams\nIf you plan to leave Canada while you’re studying, you’ll need a new\nimmigration medical exam (IME) to return if\nyou’re from a country that requires a valid IME to enter Canada and\nyour IME has expired or will expire while you’re outside of Canada\nFind out if you need an IME to return to Canada as an international student.\nChanging the conditions of your study\npermit\nIf you want to change a condition on your study permit, you must apply.\nFind more information about your study permit conditions.\nHow long your study permit is valid\nA study permit is usually valid for the length of your study program, plus an\nextra 90 days. The 90 days let you either\nprepare to leave Canada or\napply to extend your stay\nThe amount of time you can stay in Canada after you’ve completed your\nstudies depends on whether\nyou’re taking prerequisite courses\nyour study permit will expire before you finish your studies\nyou’ll finish your studies before your study permit expires\nIf you’re taking prerequisite courses\nIf your school asks you to take courses before they accept you into the main\nprogram (you have conditional acceptance), your study permit will be valid\nfor the length of those courses plus 1 year.\nWhen you get accepted into the main program, you must apply to extend\nyour stay as a student.\nIf your study permit will expire before you finish your\nstudies\nIf your study permit will expire before you finish your courses, you\nmust apply to extend your stay as a student.\nIf you don’t, you’ll need to stop studying and leave Canada.\nDate modified:\nIf you’ll finish your studies before your study permit\nexpires\nIf you finish your studies early, your study permit will stop being valid 90\ndays after you complete your studies, no matter what day is printed on\nthe study permit.\nYour studies are officially completed on the date your school first notifies\nyou by any of the following:\ncompletion letter\ntranscript\ndegree or diploma\nYou must provide proof of the date your school notifies you or the date you\nget your degree, diploma or certificate. If you don’t have proof, we’ll use the\nearliest issue date on the document. We may confirm this date with your\nschool.\nStaying in Canada after you graduate\nYou may be able to work temporarily or live permanently in Canada after\nyou graduate.\n2025-05-07"
}