{
  "type": "pdf",
  "source": "Study permit_ Who can apply - Canada.ca.pdf",
  "text": "Canada.ca\n \nImmigration and citizenship\n \nStudy in Canada as an international student\nStudy permit\nIRCC sign in\n\n\n\nStudy permit\nWho can apply\nWho can study without a permit\nGet the right documents\nHow to apply\nAfter you apply\nPrepare for your arrival\nWhile you study\nWho can apply\nOn this page\nEligibility requirements\nYour responsibilities as a student\nPost-graduation work permit\nEligibility requirements\nYou can come to Canada to study if you\nare enrolled at a DLI\nprove you have enough money to pay for\nyour tuition fees\nliving expenses for yourself and any family members who come\nwith you to Canada and\nreturn transportation for yourself and any family members who\ncome with you to Canada\nobey the law, have no criminal record and get a police certificate (if\nrequired)\nare in good health and get a medical exam (if required) and\nprove to an officer that you will leave Canada when your study permit\nexpires\nYour responsibilities as a student\nWhile studying in Canada you must\nmake progress towards completing your program\nrespect any conditions listed on your study permit\nstop studying if you no longer meet the requirements\nDepending on your case, there may be conditions on your study permit such\nas\nif you’re allowed to work in Canada\nthe specific date you must leave Canada\nwhere you can study (a specific DLI listed on your permit)\nYou need to follow our instructions if you want to change schools at\nthe post-secondary level.\nwhether you need an immigration medical examination\nPost-graduation work permit\nYou may be able to stay and work in Canada after you graduate by getting a\npost-graduation work permit (PGWP). PGWP eligibility depends on several\nrequirements, including when you submit your study permit application. If\nyou’re interested, check the requirements before you submit your study\npermit application.\nCheck if the DLI you choose offers PGWP-eligible programs.\nPGWP eligibility requirements\nPGWP has 3 sets of eligibility requirements:\ngeneral eligibility requirements,\nFor example, you must complete an eligible program of study\nat a PGWP-eligible DLI\neligibility requirements based on your study program\nThese may include language or field of study requirements.\neligibility requirements based on your physical location\nIf your level of study has a field of study requirement, you should make\nsure your program meets the eligibility requirement before you\nsubmit your study permit application.\nDate modified:\n2025-07-02\nWho doesn’t need a permit\nLearn more about PGWP eligibility requirements.\n"
}