{
  "type": "pdf",
  "source": "Study permit_ Who can study without a permit - Canada.ca.pdf",
  "text": "Canada.ca\n \nImmigration and citizenship\n \nStudy in Canada as an international student\nStudy permit\n \nStudy permit: Who can apply\n\n\n\n\nStudy permit\nWho can apply\nWho can study without a permit\nGet the right documents\nHow to apply\nAfter you apply\nPrepare for your arrival\nWhile you study\nWho can study without a permit\nMost foreign nationals need a study permit to study in Canada. The cases\nbelow are exceptions.\nShort-term students\nYou don’t need a study permit if you’re coming to Canada for a\nprogram that lasts 6 months or less.\nFamily or staff of foreign representatives\nYou may not need a study permit if you’re a family or staff member of a\nforeign representative to Canada that has been accredited by Global\nAffairs Canada (GAC). Your embassy can contact GAC to find out if you\nneed one.\nMembers of the foreign armed forces of a country\ndesignated under the Visiting Forces Act (VFA)\nYou don’t need a study permit if you’re a member of a foreign armed\nforce (as part of either the military or a designated civilian personnel)\nfrom a country that is designated under the VFA and you’re on official\nduties in Canada.\nYou should be in possession of a letter of acceptance from Canada’s\nDepartment of National Defence.\nIf your family members, including minor children, want to study in\nCanada, they may need a study permit.\nRegistered Indians in Canada\nYou don’t need a study permit if you have Registered Indian status in\nCanada, even if you’re a citizen of another country.\nMinor children in Canada\nMinor children don’t need a study permit if\nthey’re refugees or refugee claimants\ntheir parents are refugees or refugee claimants\ntheir parents are Canadian citizens or permanent residents of\nCanada\nthey’re in Canada attending preschool, primary school or\nsecondary school, and they are accompanied by a parent who is\nauthorized to study or work in Canada\nthey’re in Canada unaccompanied, and they’re attending\npreschool, primary school or secondary school\nWhy you may still want them to get a study permit\nHaving a valid study permit means the minor may be able to\nget a secondary school co-op work permit\nhave access to social services in some provinces or territories\nmove between education levels without needing to change or\napply for a new permit\nWhen minor children reach the age of majority (18 or 19\nyears old, depending on the province or territory), they must\napply for a study permit if they want to keep studying.\nLearn more about minors studying in Canada.\nTemporary residents and asylum seekers taking\nFrench language and culture courses\nYou don’t need a study permit to take French language and cultural\nintegration courses in Quebec (linked page is available in French only).\nTo be eligible for the courses, you need to be a temporary resident or\nasylum seeker in Canada.\nTemporary residents taking settlement and\nintegration courses\nIf you’re taking settlement and integration courses offered by a\nprovincial or territorial government to help you settle into Canada, you\ndon’t need a study permit.\nConstruction apprentices in eligible trades\nTo be eligible to study without a study permit as a construction\napprentice, you must meet all of the following criteria when you\nrequest your study permit exemption and once a decision has been\nmade:\nYou have a valid work permit.\nYou have a job in an eligible construction occupation \n.\nYou have an apprenticeship agreement registered with the relevant\nprovincial or territorial apprenticeship and certification authority.\nFind out more about this temporary measure \n.\n\n\nOther types of workers who can study without a\nstudy permit\nYou may be eligible to study without a study permit if you are in either\nof the following situations:\n1. You have a valid work permit that you applied for on or before\nJune 7, 2023.\n2. You have been issued a letter authorizing you to work while we\nprocess your work permit extension application that was submitted\non or before June 7, 2023.\nFind out if you’re eligible.\nWhy you may still want to get a study permit\nIf you have a study permit and you’re registered as a full-time student at a\nDLI, you may be able to work on-campus or off-campus. If you are able to\ndo so, your study permit will include a condition that says you’re allowed\nto work while studying.\nIf you don’t have a study permit, you can’t work while you’re studying in\nCanada. In this case, you need to apply for a work permit.\nGet the right documents\nLearn more about working while studying in Canada.\nDate modified:\n2025-03-07\n"
}