{
  "type": "pdf",
  "source": "Study permit_ How to apply - Canada.ca.pdf",
  "text": "Canada.ca\n \nImmigration and citizenship\n \nStudy in Canada as an international student\nStudy permit\nIRCC sign in\n\n\n\nStudy permit\nWho can apply\nGet the right documents\nHow to apply\nAfter you apply\nPrepare for your arrival\nWhile you study\nHow to apply\nGenerally, you must apply for a study permit before you come to Canada.\nSome people can apply for a study permit from within Canada. In some\ncases, you can apply when you arrive in Canada at the port of entry. Make\nsure you understand which option is available to you.\nGet your documents ready\nWhen you apply, you should submit\nthe letter of acceptance from the designated learning institution (DLI)\nyou’ll be attending\na provincial attestation letter (PAL) or territorial attestation letter (TAL)\nYou can upload your PAL/TAL into the Provincial attestation letter\n(required) field in your application. If this option is missing, you\nmust upload your PAL/TAL to the Client information field. If you\nmeet an exception, you must provide any evidence in the Client\ninformation field.\nas many of the documents needed for a complete application as\npossible\nWe won’t be able to finalize your study permit until you’ve\nsubmitted a complete application.\nIn Canada study permit applicants: New rules about\napplying at a port of entry\nMost foreign nationals already in Canada can no longer apply for a\nstudy permit at a port of entry. You must apply online for\nyour initial study permit\nyour study permit extension\nIf you’re outside of Canada, you may still be eligible to apply for a study\npermit when you arrive at a port of entry.\nWaiting to submit documents will cause delays in processing.\nApply online\nIf you’re applying for a study permit, you must apply online, whether\nyou’re outside of Canada or already in Canada.\nYou’re only eligible to apply on paper if you\nhave a disability that prevents you from applying online\nhold an identity or travel document for non-national residents, refugees\nor stateless persons\nGet specific instructions on how to apply\n\nIf you’re in Canada and leave as a student on maintained status, you’ll\nlose your ability to study when you return. This means you can’t study\nuntil your application is approved.\nAnswer a few questions to get the next steps for your situation.\n* Where are you applying from? (required)\n* How do you want to apply? (required)\nVenezuelan passport holders\nYou may need to complete extra steps when you fill out your\napplication.\nOutside Canada\nWithin Canada\nAt a port of entry\nOnline (required, unless exempt)\nApply online from outside Canada\nStep 1: Make sure you have what you need\nTo apply online, you’ll need:\na scanner or camera to create electronic copies of your documents\na valid credit or debit card.\nTo make sure you have everything you need to apply, get your local visa\noffice instructions by selecting the country or territory from which you’ll be\napplying.\n* Select a country/territory (required)\nMake your selection...\nContinue\nOn paper\nStep 2: Read the instruction guide\nEven if you apply online, you should read the instruction guide before you\ncomplete your application. The guide will explain how to complete each field\non the form.\nStep 3: Prepare your answers for the online tool\nBefore you can upload your forms, you must answer some questions. We\nuse your answers to create a personalized document checklist for you.\nStep 4: Know the fees you have to pay\nIn most cases, your fees will include:\nprocessing fees for you and anyone you include on your application and\nbiometrics\nWe’ll ask you to pay your fees at the end of your application.\nThird-party fees\nDepending on your situation, you may need to pay third parties for:\nmedical exams\npolice certificates\nlanguage testing, and\nservices at a visa application centre if you use one\nYou won’t pay these fees in your online account. You’ll pay them directly to\nthe third party.\nBiometrics fee\nIn most cases, you should pay a biometrics fee when you submit your\napplication. Otherwise you may experience delays. The biometrics fee\ncovers the cost of collecting fingerprints and a digital photo. Find out if you\nneed to give your biometrics.\nStep 5: Create your online account or sign in\nYou need an account to apply online. You can use your account to:\npay your fees\nIf you need an eTA or visa\nIf you need an electronic travel authorization (eTA) or visa, we’ll issue it\nautomatically at the same time as your study permit. You don’t need to\napply separately or pay another fee.\nAfter you apply\nsubmit your application\ncheck the status of your application\nContinue to IRCC secure account\nDate modified:\n2025-05-07\n"
}