{
  "type": "pdf",
  "source": "Study permit_ Get the right documents Provincial attestation letter or territorial attestation letter - Canada.ca.pdf",
  "text": "Canada.ca\n \nImmigration and citizenship\n \nStudy in Canada as an international student\nStudy permit\n \nGet the right documents\nIRCC sign in\n\n\n\n\nStudy permit: Get the right documents\nWho can apply\nGet the right documents\nProof of acceptance\nProvincial attestation letter or territorial attestation letter\nProof of identity\nProof of financial support\nOther documents\nProvincial attestation letter or\nterritorial attestation letter\nA provincial attestation letter (PAL) or a territorial attestation letter (TAL) is a\nletter provided by the province or territory where you plan to study. It\nconfirms that you’ ve been assigned one of the available spaces to study in\nthat province or territory. Most study permit applicants need to provide a\nPAL or TAL when they apply, unless they meet one of the exceptions.\nOn this page\nWho needs a PAL/TAL\nGetting your PAL/TAL\nHow long a PAL/TAL is valid\nWhen to get a new PAL/TAL\nHow to apply\nAfter you apply\nPrepare for your arrival\nWhile you study\nStudying in Quebec\nWho doesn’t need a PAL/TAL\nWho needs a PAL/TAL\nUnless you meet one of the exceptions, you must submit a PAL/TAL\nwith your application, not after\nwhen you apply for a prerequisite course or program\nThis includes language courses or programs .\nfor each study permit applicant, even if you’re applying as a family and\nsubmitting your applications together\nGetting your PAL/TAL\nContact your school to find out how to apply for a PAL/TAL. Once you have\none, you can apply for a study permit.\nIf you’re applying to a school in Quebec, follow the instructions below.\nHow long a PAL/TAL is valid\nUnless it has an expiry date on it, it’s valid\nuntil January 21, 2025, for the 2024 study permit cap year\nThis means that your PAL/TAL was issued between January 22, 2024,\nand January 21, 2025.\nuntil December 31, 2025, for the 2025 study permit cap year\nThis means that your PAL/TAL was issued between January 22, 2025,\nand December 31, 2025.\nYour PAL/TAL needs to be valid when you apply. You can’t use a PAL/TAL\nthat was issued during a previous study permit cap year.\nWhen to get a new PAL/TAL\nYou can reapply with the same PAL/TAL if\nyour PAL/TAL is still valid, and\nyour study permit application was accepted for processing and you\nvoluntarily withdrew your application before a final decision was made,\nor\nyour study permit application was not accepted for processing\nThis means that your fee was refunded and you were told that your\napplication was not processed.\nYou must get a new PAL/TAL before you reapply if\nyour PAL/TAL has expired or is no longer valid, or\nyour previous study permit application was approved or refused, or\nyou’re changing schools, or\nyou’re changing your level of study\nThis means you’re moving from\nthe post-secondary level to the graduate level, or\nthe graduate level to the post-secondary level\nIf you’re reapplying to study in Quebec, find out if you need to renew your\nauthorizations.\nStudying in Quebec\nQuebec Acceptance Certificate\nIf you want to study in Quebec, you need an attestation of issuance of\nyour Quebec Acceptance Certificate (Certificat d’acceptation du\nQuébec [CAQ]), which is issued by the Government of Quebec. Contact\nyour school to find out how to apply for the CAQ.\nWho needs a CAQ\nMost students who don’t need a PAL/TAL and want to study in\nQuebec must still get a CAQ. There are very few exceptions.\nMake sure your CAQ is valid when you apply\nA CAQ received before January 22, 2025, will be accepted for the 2025\nstudy permit cap year if it is valid when you apply.\nYour CAQ needs to include the following line :\n“This attestation letter confirms that the applicant has a place\nin Quebec’s share of the distribution of study permit\napplications or is exempt from it.”\nCAQs for applications received before 8:30 a.m. ET on January 22,\n2024, did not require the above line.\nRe-using a CAQ\nYou can apply for a study permit again with the same valid CAQ, no\nmatter what the decision was on your last application, unless you’re in\none of the following situations:\nyour studies extend beyond the expiry date of your CAQ\nyou’re changing your level of study\nWhen changing schools, you can apply again with the same valid CAQ\nonly if\nyour CAQ was issued before December 6, 2024, and you’re\nchanging schools at the same level of study\nyou’re a minor child at the primary or secondary level, unless your\nCAQ is linked to a specific school\nFind out which documents you need to study in Quebec.\nWho doesn’t need a PAL/TAL\nYou don’t need a PAL/TAL when applying for a study permit if any of the\nfollowing applies to you.\nYou’re applying to study at a\npreschool\nprimary school (including kindergarten)\nsecondary school (up to grade 12)\nschool participating in the Francophone Minority Communities\nStudent Pilot (FMCSP) and you have a letter of acceptance from this\nschool identifying you as an applicant under the FMCSP\nfederally designated military college or\nschool in Quebec in a vocational training program that leads to one\nof the following:\na diploma of vocational studies (DVS)\nan attestation of vocational specialization (AVS)\na skills training certificate (STC)\nYou’re an exchange student studying under an exchange arrangement\nbetween your home institution and a designated learning institution\n(DLI) in Canada, and you don’t pay tuition fees to the DLI.\nYou’ve received a scholarship from Global Affairs Canada.\nYou’re in Canada or entering Canada at a port of entry and are eligible\nfor an exemption from certain study permit requirements based on a\npublic policy as part of a migration response to a crisis or other\npressure.\nYou’re exempt from certain study permit requirements under the\ntemporary measures to reunite families of Indigenous people separated\nby Canada’s border.\nYou’ve entered Canada and one of the following situations applies to\nyou:\nYou’re applying for a study permit extension at the same DLI and\nlevel of study as your current study permit.\nYou’re under a removal order, but can’t be removed from Canada\nat this time.\nYou have a temporary resident permit valid for at least 6 months.\nProof of identity\nYou’re a protected person.\nYou’re eligible for permanent residence\nbased on humanitarian and compassionate grounds , or\nbased on a current public policy, or\nas a spouse or common-law partner (through the spouse or\ncommon-law partner in Canada class)\nYou need to provide proof that you meet one of the above exceptions if you\ndon’t provide a PAL/TAL with your study permit application.\nDate modified:\n2025-07-11\n"
}