{
  "type": "pdf",
  "source": "Study permit_ After you apply - Canada.ca.pdf",
  "text": "Canada.ca\n \nImmigration and citizenship\n \nStudy in Canada as an international student\nStudy permit\nIRCC sign in\n\n\n\nStudy permit\nWho can apply\nGet the right documents\nHow to apply\nAfter you apply\nPrepare for your arrival\nWhile you study\nAfter you apply\n1. Your fingerprints and photo\n(biometrics)\nBook your biometrics collection appointment as soon as you can to avoid\nprocessing delays. Find out how to give biometrics.\n2. We process your study permit\napplication\nWe’ll check your application to make sure you have all the necessary\ndocuments. If it’s incomplete, we may return your application without\nprocessing it or request the missing documents.\nWe may also ask you to\ngo to an interview with our officials in your country or\nsend us more information\nYou may also need to get a\nmedical exam (if required) or\npolice certificate (if required)\nIf you want to defer your enrolment while we process your application\nIf you want to defer your enrolment (which means you want to start\nstudying later than planned) at the designated learning institution (DLI)\nthat has already issued your letter of acceptance (LOA), you need to\nget your deferral approved by the DLI\nget an updated LOA\nYou must then submit your updated LOA to us through your online\naccount or our web form.\nMissing documents\nIf you weren’t able to submit all the required documents with your\napplication, you can submit the missing documents through your online\naccount or our web form.\nWe won’t process your study permit until you’ve submitted a complete\napplication. Waiting to submit documents will cause delays in processing.\nUpdating your application\nIf you move or change your address, telephone number or any other contact\ninformation after you apply, you must update your application.\nThere’s a new way to check your application status\nUse the application status tracker \n to get updates about your\napplication. To create an account you need your\nunique client identifier (UCI)\napplication number\n3. If we approve your application\nYou’ll get your study permit\nat the port of entry when you arrive in Canada or\nmailed to you, if you’re already in Canada\nIf you applied for your study permit from outside\nCanada\nWe’ll send you a port of entry letter of introduction that says you’re allowed\nto study in Canada. This letter is not your study permit.\n\n\nYou need to bring this letter with you and show it to a border services officer\nwhen you arrive in Canada. We’ll also send you an electronic travel\nauthorization (eTA) or a visitor visa (temporary resident visa) to enter\nCanada, if you need one.\nIf you’re from a country where you need an eTA, the letter of introduction\nwill include information about your eTA. Your eTA will be linked to your\npassport and is valid for 5 years or until your passport expires, whichever\ncomes first. It’s important that you travel with the passport you used when\nyou applied for your study permit.\nIf you’re from a country where you need a visitor visa, the visa will be in\nyour passport. It’ll show if you can enter Canada once or multiple times. You\nmust enter Canada before your visa expires.\nIf you’re a lawful permanent resident of the United States, travel with a valid\ngreen card (or equivalent official proof of status in the US) and a valid\npassport from your country of nationality (or an equivalent document).\nIf you applied for your study permit from within Canada\nIf you were eligible to apply from within Canada, you filled out a form called\n“Application to change conditions, extend my stay or remain in Canada as a\nstudent” (IMM 5709).\nIn this case, we’ll mail the study permit to the Canadian address you gave\nus.\nIf your mailing address changes before we send you our decision, you must\ngive us your new address.\nStudying while you wait for your study permit to arrive\nWe’ll send you a letter of approval in your online account to let you\nknow your study permit has been approved. You can start studying as\nsoon as you get this letter. You don’t have to wait until you get your\nstudy permit in the mail to start studying.\nIf we refuse your application\nWe’ll send you a letter explaining why.\nWe may refuse your application if you don’t\nhave a valid letter of acceptance\nshow proof that you have enough money to support yourself while\nstudying in Canada\npass your medical exam, if you needed to get one\nconvince the visa officer that your main purpose in Canada is to study or\nDate modified:\n2025-05-07\nPrepare for arrival\nconvince the visa officer that you’ll leave Canada at the end of your\nstudy period\nIf you have questions about why you were refused, contact the visa office\nthat sent you the refusal letter.\nHelp us improve our services\nWe’re looking for people to try out our products. Find out how you can\nparticipate.\n"
}