{
  "type": "pdf",
  "source": "Study permit_ Get the right documents - Proof of acceptance - Canada.ca.pdf",
  "text": "Canada.ca\n \nImmigration and citizenship\n \nStudy in Canada as an international student\nStudy permit\n \nGet the right documents\nIRCC sign in\n\n\n\n\nStudy permit: Get the right documents\nWho can apply\nGet the right documents\nProof of acceptance\nProvincial attestation letter or territorial attestation letter\nProof of identity\nProof of financial support\nOther documents\nProof of acceptance\nLetter of acceptance\nYour school must provide you with a letter of acceptance (LOA). Include the\noriginal or electronic copy of your letter with your study permit application.\nPost-secondary students\nYour school will be asked to make sure your letter of acceptance is valid.\nIf your school does not respond by the deadline, we’ll return your\napplication and refund your processing fee. Confirm with your school that\nthey will validate your letter of acceptance before resubmitting your\napplication.\nHow to apply\nAfter you apply\nPrepare for your arrival\nWhile you study\nMake sure you only attach your LOA in the LOA-specific space when\nuploading documents for your online application. If you attach other\ndocuments in this space, you’re giving your consent to disclose these\nadditional documents to your school. All other required documents\nshould be attached in the corresponding spaces in your online\napplication.\nConditional acceptance and prerequisite courses\nIf you’ve been conditionally accepted, you need to take prerequisite courses.\nFor example, these might be English as a second language or French as a\nsecond language courses. You must complete these before you can start\nyour main study program.\nIf this is the case, we’ll only issue your study permit for the length of those\ncourses plus 1 year. Once you’re accepted into your main program, you’ll\nneed to apply for a new student permit to extend your stay as a\nstudent.\n\nProvincial attestation letter\nExceptions\nIf you’re the family member of someone who has a study permit or work\npermit application that’s been approved in writing before you come to\nCanada, you don’t need a letter of acceptance.\nDate modified:\n2025-05-07\n"
}