{
  "type": "pdf",
  "source": "Study permit_ Get the right documents - Other documents you may need - Canada.ca.pdf",
  "text": "Canada.ca\n \nImmigration and citizenship\n \nStudy in Canada as an international student\nStudy permit\n \nGet the right documents\nIRCC sign in\n\n\n\n\nStudy permit: Get the right documents\nWho can apply\nGet the right documents\nProof of acceptance\nProvincial attestation letter or territorial attestation letter\nProof of identity\nProof of financial support\nOther documents\nOther documents you may need\nLetter of explanation\nThis letter helps the visa officer to understand you and your goals. It\nexplains\nwhy you want to study in Canada\nthat you understand your responsibilities as a student\nYou should include this letter if you decide to apply for a study permit, even\nif you don’t have to get a study permit for your program.\nMedical exam\nYou may need a medical exam if any of these situations apply to you:\nHow to apply\nAfter you apply\nPrepare for your arrival\nWhile you study\nYou plan to stay in Canada for more than 6 months.\nYou recently spent time in certain countries.\nYou plan to work in certain jobs where public health must be protected.\nFind out who needs a medical exam.\nCustodian declaration (minor children)\nIf the minor requires a custodian, you must include the Custodianship\nDeclaration form (IMM 5646) \n with your application. It has 2 pages that\nmust be notarized (certified by a notary) and then included with your study\npermit application.\nThe custodian in Canada must sign the first page, and the parents or legal\nguardians of the minor child in the child’s home country must sign the\nsecond page.\nOther supporting documents\nCheck the visa office instructions for your country or region for local\nrequirements.\nIf you aren't currently in your home country, you may have to prove your\nimmigration status in the country you apply from.\n\nHow to apply\nIf the government that issued your passport or travel document needs you\nto have a re-entry permit, you must get one before you apply for a Canadian\nvisa. You may also need other documents.\nFind out what to do if we asked you to provide a supporting document for\nyour application.\nDate modified:\n2025-05-07\n"
}