{
  "type": "pdf",
  "source": "The Parents and Grandparents Program_ Intake Report 2020 to 2022 - Canada.ca.pdf",
  "text": "Canada.ca\n \nImmigration and citizenship\n \nCorporate information\nPublications and Manuals\n\n\n\nThe Parents and Grandparents\nProgram: Intake Report 2020 to 2022\nPDF version: The Parents and Grandparents Program: Intake Report\n2020 to 2022 (PDF, 833 KB)\nKey Terms\nGlossary of Terms\nTerm\nDefinition\nAdmissions\ntarget\nThe planned annual target of admissions for a specific\nimmigration program.\nTerm\nDefinition\nApplication\ntarget\nThe number of applications the Department aims to\nreceive in a given intake year under the parents and\ngrandparents program.\nApplication\nwindow\nThe time prospective sponsors and applicants have to\nsubmit an application.\nIntake model\nThe type of selection system used to determine who\ncan submit an application and whose application will be\naccepted into processing.\nIntake year\nThe year that an intake opens to new applications.\nInterest to\nSponsor (ITS)\nA form that prospective sponsors submit to show their\ninterest in sponsoring their parent(s) and/or\ngrandparent(s).\nInventory\nApplications in processing, expressed in applications or\nin persons (applicants).\nInvitation to\nApply (ITA)\nAn invitation issued to a selected prospective sponsor\nto submit an application.\nITA window\nThe time the Department takes to issue Invitations to\nApply.\nTerm\nDefinition\nITS window\nThe time prospective sponsors have to submit an\nInterest to Sponsor form.\nLevels Plan\nThe planned immigration target and range for each\nimmigration program for a specific calendar year.\nProcessing time\nThe time from when a complete application is received\ninto processing to when a final decision is rendered.\nRegions of Residence\nRegion of Residence\nProvinces and Territories\nEastern Maritime\nProvinces\nNew Brunswick, Newfoundland and Labrador,\nNova Scotia, Prince Edward Island\nQuebec\n-\nRest of Canada\nAll provinces and territories excluding Quebec\nOntario\n-\nWestern and Prairie\nProvinces\nAlberta, British Columbia, Manitoba,\nSaskatchewan\nRegion of Residence\nProvinces and Territories\nTerritories\nNorthwest Territories, Nunavut, Yukon\nSection 1: Overview\nWhat is included in the Intake Report\nThe Intake Report presents an overview of the application intake process\nand statistics related to application intakes from 2020 to 2022. It also\npresents data from across the intake continuum, including inventory levels,\nprocessing times, admissions targets, and admissions. Proportions in the\nreport may not add up to 100% due to rounding to the nearest whole\nnumber and statistics from different sections may not be identical due to\ndifferent reporting times. Lastly, all data are preliminary estimates and are\nsubject to change, including in subsequent reports.\nBackground\nThe admissions targets under the Levels Plan informs the planned number\nof applications to be finalized for each program in a year. Prior to November\n2011, the parents and grandparents program used a first-in application\nintake model and had no limit on the submission of applications. Since the\nnumber of applicants and their family members was much greater than the\nadmissions targets, a long inventory developed. By the end of 2011, the\ninventory had grown to over 79,000 applications, which included over\n167,000 persons.\nTo reduce the inventory, a moratorium on new applications was established\nfrom November 5, 2011 to December 31, 2013. By the end of 2013, the\ninventory was reduced to less than 41,500 applications, equaling a little over\n86,000 persons. When the program opened to new applications in 2014, an\nannual limit on the number of applications to be accepted into processing\nwas introduced.\nIntake Process\nBeginning in 2014, Ministerial Instructions were published specifying the\nintake model and the number of applications to be accepted into processing\nfor the intake year (application target). Importantly, applications can consist\nof more than one person since the principal applicant lists their spouse or\ncommon-law partner and/or dependent children as part of the application.\nThe application target (input) is set at the discretion of the Minister in\nconsideration of the inventory size and the number of applications needed\nto meet admissions targets (output). The application target is the backbone\nof the application management system since calibrating the number of\napplications accepted into processing helps manage the inventory and\nprocessing times.\nImage 1. Intake and admissions process\nText version: Intake and admissions process\nInput: Intake of applications after completeness check\nInventory: Applications added to the end of the existing inventory\nOutput: Finalization of applications to meet admissions targets (in\npersons)\nProcessing time is the time from completeness check to\nfinalization of applications\nSection 2: Intake Periods\nFrom 2020 to 2022, three intakes were conducted using the pool of ITS\nsubmissions received during the ITS period in the fall of 2020. The\nDepartment used a randomized selection model to manage the intake of\napplications. For the purpose of this report, intakes will be grouped into\n‘intake periods’ based on the intake year:\n1. Intake Period 1: 2020\n2. Intake Period 2: 2021\n3. Intake Period 3: 2022\nDue to the impacts of COVID-19, the 2020 intake was delayed and these\napplications were received in early 2021. To see information regarding\nprevious intakes conducted, see The Parents and Grandparents Program:\nIntake Report, 2014 to 2019.\nIntake Periods (1-3): 2020 to 2022\nInterest to Sponsor Period\nIn the fall of 2020, prospective sponsors had a 3 week period (from October\n13 to November 3, 2020) to express their interest by submitting an online ITS\nform. Those who were unable to submit their interest online due to a\ndisability were able to request an ITS form in an alternative format (regular\npaper, large font paper, or braille) in advance or during the online ITS\nperiod. After the ITS window closed and duplicate ITS forms were removed,\na total of 203,213 unique ITS forms remained in the pool. These ITS forms\nwere randomized into a list, which was used to issue ITAs for all intakes\nconducted between 2020 and 2022.\nInvitation to Apply Period\nFor each intake, a predetermined number of ITAs were issued in the order of\nthe randomized list. Since not all prospective sponsors who are issued an\nITA submit an application, the Department issued a number of ITAs greater\nthan the application target based on the estimated ITA uptake rate. Those\nwho received an ITA were required to submit their application(s) within the\n60 day application window.\nTable 1. ITA window, by intake year\n \n1\n2\n3\ndate\nJan 5 to Jan 11,\n2021\nSept 23 to Oct 4,\n2021\nOct 12 to Oct 20,\n2022\ntotal business\ndays\n5 days\n7 days\n7 days\nNote: These timelines may be shorter than those announced since the original timelines\nwere based on the number of predicted business days to issue the ITAs, which included\nsupplementary days should the Department have experienced technological issues\nduring the issuance process.\nTable 2 below shows statistics related to the ITS and ITA stages for each\nintake. Due to using the remaining ITS forms from 2020 in subsequent\nintakes, the ITA uptake rate declined each year. It is important to note a low\nITA uptake rate does not limit the Department’s ability to meet the\napplication target nor does it impact an individual prospective sponsor’s\nprobability of being selected as a lower anticipated ITA uptake rate results in\nthe issuance of more ITAs.\nTable 2. ITS forms, ITAs issued, ITA uptake rate, and the\nprobability of selection, by intake year\n \n1\n2\n3\nITS forms\n203,213\n189,813\n155,313\nITAs issued\n13,400\n34,500\n23,100\nITA uptake rate\n77%\n72%\n68%\nProbability of selection\n6.6%\n18.2%\n14.9%\nData Source: Internal source\nEstimated demand\nUnder a random selection model, it is possible to estimate the demand to\nsponsor parents and grandparents. Sponsor demand can be estimated by\nmultiplying the ITA uptake rate by the number of unique ITS forms. The\ndemand for parent and grandparent sponsorship is estimated by\nmultiplying sponsor demand by the average number of persons per\napplication submitted in that year. Figure 1 shows the estimated demand\nfrom 2017 to 2021.\nNote: These data only consider demand to submit a complete application and do\nnot consider the final decision of those applications. Demand in 2021 is based on\nITS forms received in 2020 and the combined ITA uptake rate for applications\nreceived in 2021 (2020 and 2021 intakes).\nFigure 1. Estimated demand, by year\n*It is not possible to estimate exact demand for 2019 and 2020 since either a\nrandom selection model was not used (2019) or no applications were received\n(2020).\nText version: Estimated demand, by year\nSection 3: Complete Applications\nReceived from 2020 to 2022\nThe following section compares complete applications received by intake\nperiod in relation to the application target as well as the profile of the\nsponsors who submitted applications. Statistics are presented by each\nintake and the total across the three intake periods.\nHow many applications were accepted into processing?\nTable 3 shows the application target and number of complete applications\naccepted by intake period as of July 6, 2023. The Department accepted more\napplications into processing than the application target for the 2020 and\n2022 intakes, but fell short of the application target for the 2021 intake. In\naddition, 166 applications received as part of the 2022 intake have not been\ncompleteness checked and are therefore not included in the table below.\nTable 3. Number of complete applications received compared to\nthe application target, by intake\n \n1\n2\n3\nTotal\nApplication target\n10,000\n30,000\n15,000\n55,000\nComplete applications received\n10,293\n24,742\n15,790\n50,825\nRelative difference\n3%\n-18%\n5%\n-8%\nNote: Applications from the 2020 intake were received in the 2021 calendar year.\nMinisterial Instructions specify the maximum number of applications the Department is\nauthorized to accept into processing in a calendar year or 12 month period. The\nDepartment may authorize the acceptance of applications above the initial maximum\nthrough revised Ministerial Instructions.\nData source: COGNOS (MBR)\nPrincipal applicants must include their family members (spouse/common-\nlaw partner and/or dependent children) on their application. Table 4 shows\nthe number of persons (whether accompanying or not) associated with all\ncomplete applications received by intake period.\nTable 4. Number of persons per complete application received, by\nintake\nPersons / Intake Period\n1\n2\n3\nTotal\nNumber of persons\n17,588\n44,828\n30,224\n92,640\nAverage per application\n1.7\n1.8\n1.9\n1.8\nData source: COGNOS (MBR)\nWho submitted a complete application to sponsor their\nparents and grandparents?\nThis subsection details the profile of the sponsors who submitted complete\napplications across intake periods based on data extracted as of July 6, 2023.\nSex\nAs Table 5 shows, female sponsors represented a slight majority of sponsors\nwho submitted an application in every intake period.\nTable 5. Proportion of sponsors by sex, by intake period\nSex / Intake\n1\n2\n3\nTotal\nFemale\n53%\n53%\n52%\n53%\nMale\n47%\n47%\n48%\n47%\nSex / Intake\n1\n2\n3\nTotal\nOther\n0%\n0%\n0%\n0%\nData source: COGNOS (MBR)\nAge\nSponsors must be at least 18 years old. As Table 6 shows, the majority of\nsponsors were between 31 and 40 years old at the time they submitted their\napplication for all intake periods.\nTable 6. Proportion of sponsors by age, by intake period\nAge Grouping / Intake\n1\n2\n3\nTotal\n30 Years or Less\n16%\n13%\n9%\n13%\n31 to 40 Years Old\n55%\n56%\n56%\n56%\n41 to 50 Years Old\n25%\n27%\n29%\n27%\n51 Years or More\n4%\n5%\n6%\n5%\nData source: COGNOS (MBR)\nLag Time\nSponsors must be a Canadian permanent resident or citizen at the time they\nsubmit their application. As Table 7 shows, a majority of sponsors obtained\npermanent residence in Canada ten or more years prior to the submission\nof their application. In addition, because the same list of ITS forms was used\nfor all three intake years, the lag time increased year over year.\nTable 7. Proportion of sponsors by lag time, by intake period\nLag Time / Intake Period\n1\n2\n3\nTotal\n3 years or less\n24%\n18%\n9%\n17%\n4 to 6 years\n21%\n26%\n29%\n26%\n7 to 9 years\n1%\n2%\n10%\n4%\n10 years or more\n55%\n54%\n52%\n53%\nNote: Lag time refers to the time from when a new immigrant receives permanent\nresidence to when they submit an application to sponsor a member of the family class.\nData source: COGNOS (MBR)\nImmigration Class\nThe vast majority of sponsors (99%) immigrated to Canada as permanent\nresidents. As Table 8 shows, the majority of immigrant sponsors arrived\nunder the Economic Class with approximately a quarter arriving under the\nFamily Class. Only a small proportion arrived under other immigration\ncategories.\nTable 8. Proportion of sponsors by immigration class, by intake\nperiod\nImmigration Class / Intake\n1\n2\n3\nTotal\nEconomic Class\n72%\n73%\n72%\n73%\nFamily Class\n24%\n23%\n23%\n23%\nOther\n4%\n4%\n3%\n4%\nNot available\n1%\n1%\n1%\n1%\nData source: COGNOS (MBR)\nUse of a Co-signer\nA sponsor’s spouse or common-law partner can co-sign the undertaking to\ncount their income towards the income requirement. As Table 9 shows, a\nsizable majority (64-65%) of sponsors had a spouse or common-law partner\nco-sign their application across all intake periods.\nTable 9. Proportion of sponsors by co-signer use, by intake period\nCo-signer Use / Intake\n1\n2\n3\nTotal\nDid not Use Co-Signer\n35%\n35%\n36%\n36%\nUsed Co-Signer\n65%\n65%\n64%\n64%\nData source: COGNOS (MBR)\nPersons per Application\nThe principal applicant, who must be the parent or grandparent of the\nsponsor, must list their spouse or common-law partner and/or dependent\nchildren on the application whether they are accompanying them to Canada\nor not. As Table 10 shows, the majority of sponsors included two persons on\ntheir applications with a sizable portion including a single person. While only\na small portion of sponsors had more than two persons on an application, it\ngrew over each intake period.\nTable 10. Proportion of applications by number of persons, by\nintake period\nNumber of Persons / Intake\n1\n2\n3\nTotal\n1 person\n38%\n36%\n34%\n36%\n2 persons\n57%\n55%\n53%\n55%\nNumber of Persons / Intake\n1\n2\n3\nTotal\n3 or more persons\n6%\n10%\n13%\n10%\nData source: COGNOS (MBR)\nRegion of Residence\nTable 11 shows the proportion of sponsors by region of residence.\nApproximately 44% of sponsors resided in the province of Ontario, followed\nby 42% from the Western and Prairie provinces, 12-13% from Quebec, and\n1% from the Eastern Maritime provinces.\nTable 11. Proportion of sponsors by region of residence, by intake\nperiod\nRegion / Intake\n1\n2\n3\nTotal\nEastern Maritime Provinces\n1%\n1%\n1%\n1%\nQuebec\n13%\n13%\n12%\n13%\nOntario\n44%\n44%\n44%\n44%\nWestern and Prairie Provinces\n42%\n42%\n42%\n42%\nTerritories\n0%\n0%\n0%\n0%\nNote: For sponsors who use an immigration representative, the province or territory of\nthe representative's address may have been captured in these statistics, which may or\nmay not be the same as the sponsor’s.\nData source: COGNOS (MBR)\nSource Country\nTable 12 shows the country of birth of the sponsor based on the top five\ncountries over the three intake periods. The highest proportion of sponsors\nwere born in India, followed by the Philippines and the People’s Republic of\nChina. However, a sizable proportion, between 31% and 33%, were born in\ncountries not included in the top five.\nTable 12. Proportion by the sponsor’s country of birth, by intake\nperiod\nCountry / Intake\n1\n2\n3\nTotal\nIndia\n35%\n36%\n37%\n36%\nPhilippines\n12%\n12%\n12%\n12%\nPeople's Republic of China\n11%\n11%\n11%\n11%\nIran\n5%\n5%\n5%\n5%\nPakistan\n4%\n4%\n4%\n4%\nCountry / Intake\n1\n2\n3\nTotal\nOther\n33%\n32%\n31%\n32%\nData source: COGNOS (MBR)\nSection 4: Processing of Applications\nfrom 2020 to 2022\nThe following section details the number applications processed as of\nAugust 2, 2023 based on the intake period in which they were received.\nFinalized applications and decisions on applications\nreceived from 2020 to 2022\nThe vast majority of applications received from the 2020 intake and just over\nhalf from the 2021 intake had been finalized by August 2, 2023. Only 1% of\napplications received from the 2022 intake had been finalized by August 2,\n2023. The vast majority of finalized applications received from all intake\nperiods were approved.\nTable 13. Number and proportion of applications finalized as of\nAugust 2, 2023, by intake period\nFinalizations / Intake\n1\n2\n3\nTotal\nFinalized\n83%\n53%\n1%\n42%\nIn Processing\n17%\n47%\n99%\n58%\nData source: COGNOS (MBR)\nTable 14. Proportion of finalized applications by final decision as\nof August 2, 2023, by intake period\nDecisions / Intake\n1\n2\n3\nTotal\nApproved\n92%\n95%\n96%\n94%\nRefused\n6%\n3%\n0%\n4%\nWithdrawn\n2%\n2%\n4%\n2%\nData source: COGNOS (MBR)\nSection 5: Processing by Year\nThe following section details inventory levels, processing times, and number\nof applications that have been processed (finalized) by calendar year as of\nAugust 2, 2023.\nHow many parent and grandparent applications are in\nthe inventory?\nChanges in the inventory are reflective of the relative difference between the\ninput (total persons for complete applications received through the intake\nprocess) compared to the output (total persons from finalized applications\nto meet admissions targets). Therefore, the inventory grows when input is\ngreater than output. To respect Quebec Family Class admissions targets,\nIRCC sets separate application finalization goals for parents and\ngrandparents destined to Quebec and the Rest of Canada. As Figure 2 and\nFigure 3 show, the inventory for both Quebec and Rest of Canada fluctuated\nfrom 2018 to 2022.\nFigure 2. Number of applications in the inventory, by\nyear and region\nNote: The majority of applications received from the 2022 intake were not added to\nthe inventory until 2023.\nData source: COGNOS (MBR)\nText version: Number of applications in the inventory, by year and\nregion\nFigure 3. Number of persons in the inventory, by year\nand region\nData source: COGNOS (MBR)\nText version: Number of persons in the inventory, by year and\nregion\nHow long does it take to process parent and\ngrandparent applications?\nThe primary variable affecting processing times is the size of the inventory.\nWith the exception of disruptions caused by the COVID-19 pandemic,\nincreases in processing times are largely a function of a growing inventory\ndue to an input-output imbalance. Processing times in a given year are\ncalculated based on 80% of applications finalized in the last 12 months and\nare not necessarily applications received in that year. Furthermore, the start\nof the processing time is determined when the application has been\ndeemed complete as opposed to when the applications is received. New\napplications received are placed into the processing queue and are typically\nprocessed in the order they are received.\nAs Figure 4 shows, processing times had been decreasing before increasing\nin 2019 for Quebec destined applicants and in 2020 for applicants destined\nto the Rest of Canada. Processing times for Quebec based applications are\nslightly higher since IRCC receives more complete applications destined to\nQuebec compared to the Rest of Canada in proportion to their respective\nfinalization needs to meet admission targets.\nFigure 4. Processing times by year (6 month intervals)\nand region\nNote: Processing times above refer to the time in which 80% of applications were\nfinalized and are calculated based on a 6-month rolling period.\nData source: COGNOS (MBR)\nText version: Processing times by year (6 month intervals) and\nregion\nHow many parent and grandparent applications were\nfinalized?\nAs Table 15 shows, finalizations increased each year due to the lessening\nimpact of COVID-19 on processing, which had largely recovered by 2022, and\nincreases in the admission targets.\nTable 15. Number of applications and persons finalized by final\ndecision (proportion), by year\nDecisions / Year\n2020\n2021\n2022\nTotal\nApplications - Total\n5,708\n12,293\n18,799\n36,800\nApproved\n93%\n95%\n91%\n93%\nRefused\n6%\n4%\n6%\n5%\nWithdrawn\n2%\n2%\n2%\n2%\nPersons - Total\n9,502\n20,603\n31,175\n61,280\nApproved\n93%\n95%\n91%\n93%\nRefused\n6%\n4%\n7%\n6%\nWithdrawn\n1%\n2%\n2%\n2%\nData source: COGNOS (MBR)\nAs Table 16 and Table 17 show, finalizations for Quebec and the Rest of\nCanada increased each year from 2020 to 2022.\nTable 16. Number of applications finalized by final decision\n(proportion), by year and region\nDecisions / Year\n2020\n2021\n2022\nTotal\nQuebec - Total\n726\n1,585\n1,856\n4,167\nApproved\n88%\n93%\n90%\n91%\nRefused\n9%\n5%\n6%\n6%\nWithdrawn\n3%\n2%\n4%\n3%\nRest of Canada - Total\n4,982\n10,708\n16,943\n32,633\nApproved\n93%\n93%\n91%\n93%\nRefused\n5%\n5%\n6%\n5%\nWithdrawn\n2%\n2%\n2%\n2%\nData source: COGNOS (MBR)\nTable 17. Number of persons from finalized applications by final\ndecision (proportion), by year and region\nDecisions / Year\n2020\n2021\n2022\nTotal\nQuebec - Total\n1,214\n2,598\n2,948\n6,760\nApproved\n89%\n94%\n90%\n91%\nRefused\n9%\n5%\n6%\n6%\nWithdrawn\n2%\n1%\n4%\n3%\nRest of Canada - Total\n8,288\n18,005\n28,227\n54,520\nApproved\n93%\n95%\n91%\n93%\nRefused\n5%\n4%\n7%\n5%\nWithdrawn\n1%\n2%\n2%\n2%\nData source: COGNOS (MBR)\nSection 6: Admissions\nThis section details the admission targets for the parents and grandparents\nprogram compared to the actual admissions taking into account Quebec’s\nauthority to set their own admission targets.\nHow many parents and grandparents were admitted as\npermanent residents?\nThe targeted number of admissions for the parents and grandparents\nprogram is based on the Levels Plan, which sets out the planned\nimmigration levels. Admissions include the principal applicant and\naccompanying family members. It is important to note that due to\nprocessing times and the time lag between approval of an application\nand admission to Canada, admissions in a given year are typically from\napplications received from previous years.\nAs a result of air travel disruptions and closures of IRCC processing centres\nin response to the COVID-19 pandemic, the Department fell short of the low\nadmission range in 2020 and 2021. The admission range and target for 2022\nwas increased in response to these shortfalls. In 2022, the Department\nadmitted a number of parents and grandparents within the admission\nrange.\nTable 18. Parent and grandparent admissions targets and\nnumber of admissions, by year\nAdmissions Targets\nActual Admissions\nWithin Range\nYear\nLow\nTarget\nHigh\n2020\n19,000\n21,000\n24,000\n10,461\n2021\n15,000\n23,500\n24,000\n11,744\n2022\n19,000\n25,000\n31,000\n27,270\n─\nTotal\n53,000\n69,500\n79,000\n49,475\nNote: ‘─’ = within range; ‘\n’ = above range; ‘\n’ = below range\nData Source: Immigration Levels Plans and Netezza_DM2 - RDM, Permanent Residents,\nApril 30, 2023\nHow many parents and grandparents were admitted as\npermanent residents by region?\nWhile the Government of Canada is responsible for establishing the total\nadmission targets for the country as a whole on an annual basis, under the\nCanada-Quebec Accord, the government must take into consideration the\n\n\n\n\n\nnumber of admissions that Quebec wishes to receive in all classes, including\nthe Family Class.\nTable 19. Quebec Family Class (includes parents and\ngrandparents) admissions targets, by year\nAdmissions Targets\nYear\nLow\nHigh\n2020\n9,900\n10,200\n2021\n9,700\n10,200\n2022\n10,200\n10,600 (+1,000)\nTotal\n29,800\n31,000\nNote: 2022 high range includes 1,000 carry-over admission space from unused 2021\nspace. Therefore, the total number of admissions space does not include this carried-\nover admission space.\nData Source: Quebec Immigration Plan\nTable 20. Parent and grandparent admissions by region, by year\nRegion / Year\n2020\n2021\n2022\nTotal\nQuebec\n871\n1,757\n2,553\n5,181\nRegion / Year\n2020\n2021\n2022\nTotal\nRest of Canada\n9,590\n9,987\n24,717\n44,294\nData Source: Netezza_DM2 - RDM, Permanent Residents, April 30, 2023\nTable 21. Proportion of parent and grandparent admissions by\nregion, by year\nRegion / Year\n2020\n2021\n2022\nTotal\nQuebec\n8%\n15%\n9%\n10%\nRest of Canada\n92%\n85%\n91%\n90%\nData Source: Netezza_DM2 - RDM, Permanent Residents, April 30, 2023\nSection 7: Conclusion\nThe 2020 intake represented a return to the randomized selection process\nused in 2017 and 2018; however, rather than launching a new ITS period\neach year, the Department selected potential sponsors from the remaining\nlist of ITS submissions received in 2020 for subsequent intakes (2021 and\n2022).\nDemand for the program continues to grow and outpace the growth in the\nnumber of available admission space in the Levels Plan, which makes the\nrandomized selection process an appropriate intake model for this program\nas it provides equal opportunity for all interested sponsors to be selected\nand invited to apply to sponsor their parents and grandparents.\nWhile the Department was still able to conduct intakes from 2020 to 2022,\nCOVID-19 had a significant impact on the number of applications finalized\nand therefore, the number of admissions in 2020 and 2021. This contributed\nto the growing inventory and longer processing times for parent and\ngrandparent applications for both Quebec and the Rest of Canada. Despite\nincreases in the inventory and processing times from 2019 to 2022, overall\nthe inventory remained lower than it had been prior to 2016.\nDate modified:\n2023-10-10"
}