{
  "type": "pdf",
  "source": "Work permit_ How to apply - Canada.ca.pdf",
  "text": "Canada.ca\n \nImmigration and citizenship\n \nWork in Canada\n \nWork permit\nIRCC sign in\n\n\n\nHow to apply\nWork permit\nWho can apply\nHow to apply\nAfter you apply\nPrepare for arrival\nWhen you start working\nWhere are you applying from?\nIn Canada work permit applicants: new rules about\napplying at a port of entry\nMost foreign nationals already in Canada can no longer apply for a\nwork permit at a port of entry. You must apply online for\nyour initial work permit\nyour work permit extension\nIf you’re outside of Canada, you may still be eligible to apply for a work\npermit when you arrive at a port of entry.\nIf you’re in Canada and leave as a worker on maintained status, you’ll\nlose your ability to work when you return. This means you can’t work\nuntil your application is approved.\nHow to apply\nYou need to apply online for a work permit. Answer a few questions to find\nout how to apply.\n\nOutside Canada\nInside Canada\nAt a port of entry\n* Do any of these situations describe you? (required)\nYou can apply from inside Canada if one of these applies:\nYou have a valid study or work permit.\nYour spouse, common-law partner or parent has a valid study or work permit.\nYou’re eligible for a post-graduation work permit and your study permit is still valid.\nYou or your spouse, common-law partner or parent has a temporary resident permit that\nis valid for 6 months or more.\nYou’re in Canada and waiting on a decision on an application for permanent residence for\nthe\nspouse and common-law partner in Canada class OR overseas family class\ntemporary resident permit holder class\nYou made or will make a claim for refugee protection.\nYou’ve been recognized as a Convention refugee or protected person by the Immigration\nand Refugee Board of Canada.\nYou’re allowed to work in Canada without a work permit, but you need a work permit to\nwork in a different job (this does not apply to business visitors).\nYou’re a trader, investor, intra-company transferee or professional under the Canada–\nUnited States–Mexico Agreement (CUSMA).\nApply online from inside Canada\nStep 1: Make sure you have what you need\nTo apply online, you’ll need:\nYes\nNo\na scanner or camera to create electronic copies of your documents, and\na valid credit or debit card\nIf you have problems applying online\nYou can submit a paper application if either\nyou can’t apply online because of a disability\nthere’s a problem with the online application\nIn some cases, you may be able to apply online if you follow\nspecial instructions.\nWhat to do if you have problems applying online\nStep 2: Read the instruction guide\nEven if you apply online, you should read the instruction guide before you\ncomplete your application. The guide will explain how to complete each field\non the form.\nVenezuelan passport holders\nYou may need to complete extra steps when you fill out your\napplication.\n\nPriority processing for work permit applicants\nWe’re prioritizing the applications of people who perform or support\nessential services.\nWhen you fill out the work permit application form\nTo get priority processing, follow these steps:\n1. Get the National Occupational Classification (NOC) number your\nemployer entered on the\noffer of employment or\nlabour market impact assessment (LMIA)\n2. Enter that number in the Job title box.\nThis is box 4 in the Details of intended work in Canada section.\nYou must enter only the number.\nEligible occupations that perform or support essential services\nAgriculture and agri-food occupations\nNOC 2021 codes\nButchers – retail and wholesale (NOC 63201)\nMeat cutters and fishmongers – retail and wholesale (NOC 65202)\nAgricultural service contractors and farm supervisors (NOC 82030)\nLivestock labourers (NOC 85100)\nSpecialized livestock workers and farm machinery operators (NOC\n84120)\nHarvesting labourers (NOC 85101)\nNursery and greenhouse labourers (NOC 85103)\nFish and seafood plant workers (NOC 94142)\nLabourers in food and beverage processing (NOC 95106)\nLabourers in fish and seafood processing (NOC 95107)\nIndustrial butchers and meat cutters, poultry preparers and related\nworkers (NOC 94141)\nHealth-care occupations\nNOC 2021 codes\nNursing coordinators and supervisors (NOC 31300)\nRegistered nurses and registered psychiatric nurses (NOC 31301)\nSpecialists in clinical and laboratory medicine (NOC 31100)\nSpecialists in surgery (NOC 31101)\nPolice investigators and other investigative occupations (NOC\n41310)\nGeneral practitioners and family physicians (NOC 31102)\nNurse practitioners (NOC 31302)\nPhysician assistants, midwives and allied health professionals (NOC\n31303)\nRespiratory therapists, clinical perfusionists and cardiopulmonary\ntechnologists (NOC 32103)\nOther professional occupations in health diagnosing and treating\n(NOC 31209)\nPharmacists (NOC 31120)\nMedical laboratory technologists (NOC 32120)\nMedical laboratory assistants and related technical occupations\n(NOC 33101)\nMedical radiation technologists (NOC 32121)\nCardiology technologists and electrophysiological diagnostic\ntechnologists (NOC 32123)\nLicensed practical nurses (NOC 32101)\nParamedical occupations (NOC 32102)\nNurse aides, orderlies and patient service associates (NOC 33102)\nHome child care providers (LMIA-required in-Canada applicants)\n(NOC 44100)\nHome support workers, caregivers and related occupations (LMIA-\nrequired in-Canada applicants) (NOC 44101)\nStep 3: Prepare your answers for the online tool\nBefore you can upload your forms, you must answer some questions. We\nuse your answers to create a personalized document checklist for you.\nStep 4: Know the fees you have to pay\nIn most cases, your fees will include processing fees for you and anyone you\ninclude on your application\nWe’ll ask you to pay your fees at the end of your application.\nFees for open work permits\nIf you’re applying for an open work permit, make sure you pay all applicable\nfees:\nwork permit fee ($155)\nopen work permit holder fee ($100)\nBiometrics fee\nYou may need to give your biometrics for this permit. If you need to give\nbiometrics, pay the biometrics fee when you apply. The fee covers the cost\nof collecting fingerprints and a digital photo.\nFind out if you need to give your biometrics.\nExtend the validity of your biometrics\nWe can’t issue a visa or permit longer than 10 years from the last date you\ngave your biometrics. If you want a visa or permit for a longer period of\ntime, you can choose to give your biometrics again when you apply, even if\nthey’re still valid.\nFollow these steps when you apply for your visa or permit:\n1. Pay the biometrics fee when you apply.\n2. Wait for your biometric instruction letter (BIL). You must use the BIL\nthat was issued for this application.\n3. Book an appointment and visit an official biometric collection location to\ngive your biometrics again.\nStep 5: Create your online account or sign in\nYou need an account to apply online. You can use your account to:\npay your fees\nsubmit your application\ncheck your status\nCreate an account or sign in\nDate modified:\n2025-06-17\nAfter you apply "
}