{
  "type": "pdf",
  "source": "Work permit_ Who can apply - Canada.ca.pdf",
  "text": "Canada.ca\n \nImmigration and citizenship\n \nWork in Canada\n \nWork permit\nIRCC sign in\n\n\n\nWho can apply\nWork permit\nWho can apply\nHow to apply\nAfter you apply\nPrepare for arrival\nWhen you start working\nEligibility requirements for all applicants\nThere are specific requirements you need to meet depending on where you\nare when you apply for your work permit.\nBut regardless of where you apply or which type of work permit you apply\nfor, you must\nprove to an officer that you will leave Canada when your work permit\nexpires;\nshow that you have enough money to take care of yourself and your\nfamily members during your stay in Canada and to return home;\nobey the law and have no record of criminal activity (we may ask you to\ngive us a police clearance certificate);\nnot be a danger to Canada’s security;\nbe in good health and have a medical exam, if needed;\nnot plan to work for an employer listed with the status “ineligible” on\nthe list of employers who failed to comply with the conditions;\nnot plan to work for an employer who, on a regular basis, offers\nstriptease, erotic dance, escort services or erotic massages; and\ngive the officer any other documents they ask for to prove you can enter\nthe country.\nEligibility requirements if you apply from\noutside Canada\nAnyone can apply before they enter Canada. However, there may be visa\noffice requirements that you need to meet depending on what country or\nterritory you’re applying from. Make sure you follow the instructions for\nhow to apply.\nFind out if you can benefit from the Global Skills Strategy’s two-week\napplication processing.\nEligibility requirements if you apply from\ninside Canada\nYou can only apply for a work permit from inside Canada if\nyou have a valid study or work permit\nyour spouse or common-law partner, or parents have a valid study or\nwork permit\nyou’re eligible for a post-graduation work permit and your study permit\nis still valid\nyou have a temporary resident permit that is valid for 6 months or more\nyou’re waiting on a decision on an application for permanent residence\nfrom inside Canada\nyou made a claim for refugee protection\nyou’ve been recognized as a Convention refugee or protected person by\nthe Immigration and Refugee Board of Canada\nyou’re allowed to work in Canada without a work permit , but you need\na work permit to work in a different job (this does not apply to business\nvisitors), or\nyou’re a trader, investor, intra-company transferee or professional\nunder the Canada – United States – Mexico Agreement (CUSMA)\nVisitors to Canada are not eligible to apply for a work permit from\ninside Canada.\nEligibility requirements if you apply when\nyou enter Canada at a port of entry\nYou should apply for your work permit before you travel to Canada.\nHowever, you can apply for a work permit when you enter Canada if you’re\neligible.\nTo apply at a port of entry (POE), you must meet all of the following:\nbe from a visa-exempt country or be a visa-exempt traveller (for\nexample, a lawful permanent resident of the U.S.)\nbe eligible for an electronic travel authorization or to travel without a\nvisitor visa\nmeet other requirements depending on the type of work permit you’re\napplying for (see below)\nYou cannot apply at a POE if you\nneed a visitor visa\nare a citizen of one of the countries on this list\nare an International Experience Canada applicant who is not a citizen or\npermanent resident of the United States\nare applying under the Seasonal Agricultural Worker Program\nare applying for a post-graduation work permit\nAs of June 21, 2024, you can no longer apply for a PGWP at a port of\nentry (airport, land or marine border) when entering Canada.\nare in Canada and travel to the United States or Saint Pierre and\nMiquelon for the purpose of accessing immigration services on your\nreturn \nNew\nDate modified:\nHow to apply\nEmployer-specific work permit applicants\nYour employer must have completed all of the required steps for your\nemployer-specific work permit.\nOpen work permit applicants\nYou must be eligible to apply for an open work permit.\nYou may also need to take a medical exam before you come to Canada. Find\nout if you need one.\nBiometrics\nMost applicants aren’t eligible to give their biometrics at a POE.\nTo give your biometrics at a POE, you must meet 2 requirements:\nstart and finish your application at the same POE\nbe eligible to apply for a work permit at a POE\nEligible applicants can give their biometrics at these POE locations.\n\n\n2025-07-10"
}