{
  "type": "pdf",
  "source": "Work permit - Canada.ca.pdf",
  "text": "Canada.ca\n \nImmigration and citizenship\n \nWork in Canada\nIRCC sign in\n\n\nWork permit\nMost foreign nationals need a work permit to work in Canada.\nAnswer a few questions if you’re not sure if you need a work permit or\nwhich one you should get.\nThere are 2 types of work permits.\nEmployer-specific work permit\nAn employer-specific work permit lets you work in Canada according\nto the conditions on your work permit, such as\nthe name of the specific employer you can work for\nhow long you can work\nthe location where you can work (if applicable)\nBefore you apply for an employer-specific work permit, your employer\nmust give you\na copy of your employment contract\n1 of the following:\na copy of a labour market impact assessment (LMIA)\nan offer of employment number (for LMIA-exempt workers)\nTo get this number, your employer must use the Employer\nPortal.\nIf your employer doesn’t need to use the Employer\nPortal\nIf your employer does not need to use the Employer Portal to submit an\noffer of employment, they must give you a copy of the employment\ncontract.\nOpen work permit\nAn open work permit lets you work for any employer in Canada,\nexcept for one that\nis listed as ineligible on the list of employers who have failed to\ncomply with the conditions, or\nregularly offers striptease, erotic dance, escort services or erotic\nmassages\nYou can only get an open work permit in specific situations.\nSome jobs require a medical exam. If you don’t want medical\nconditions on your open work permit, you can get a medical exam from\na panel physician.\nIf you want to bring your family with you\nYour spouse or common-law partner and dependent children may be able to\nwork, study or live with you while you work in Canada.\nBringing your family to Canada with you\nFees\nFrom $155\nProcessing times\nVaries by country\nNext: Who can apply\nFeatures\nSections\nWho can apply\nRequirements you need to meet to get a work permit\nHow to apply\nGet the forms you need and apply for a work permit\nAfter you apply\nBiometrics, processing, and documents before you arrive\nPrepare for arrival\nWhat you should know before you arrive in Canada for work\nWhen you start working\nConditions, documents and rights for foreign workers in Canada\n\nDate modified:\n2025-06-17\nCheck if your representative is authorized\nIf you’re using a paid representative, find out if they’re licensed to represent\nyou or give advice."
}