{
  "type": "pdf",
  "source": "Work permit_ After you apply - Canada.ca.pdf",
  "text": "Canada.ca\n \nImmigration and citizenship\n \nWork in Canada\n \nWork permit\nIRCC sign in\n\n\n\nAfter you apply\nWork permit\nWho can apply\nHow to apply\nAfter you apply\nPrepare for arrival\nWhen you start working\nOn this page\nIf you’re outside Canada\nIf you’re in Canada\nIf you’re outside Canada\nYour fingerprints and photo (biometrics)\nBook your biometrics collection appointment as soon as you can to avoid\nprocessing delays. Find out how to give biometrics.\nHow we process your\napplication\nWe’ll check your application to make\nsure you have all the necessary\ndocuments, including biometrics.\nIf it’s incomplete, we’ll return your application without processing it.\nAn officer will also check\nProcessing time\nVaries by country\nthe list of employers who failed to comply with the conditions to make\nsure that the employer can hire you, and\nthat you qualify for a work permit\nWe may also ask you to\ngo to an interview with our officials in your country, or\nsend more information or documents\nOur online application system uses coordinated universal time (UTC). If we\nask you to upload documents in your account, you must submit them before\nmidnight UTC on the date the officer gives you. Make sure you know the\ndifference between your local time and UTC.\nYou might need a medical exam to enter Canada. If you do, an officer will tell\nyou and will send you instructions on what to do. A medical exam can add\nover 3 months to the time it takes us to process your application.\nThere’s a new way to check your application status\nUse the application status tracker \n to get updates about your\napplication. To create an account you need your\nunique client identifier (UCI)\napplication number\n\n\nIf your work permit application is approved\nYou’ll get an approval letter that says you’re allowed to work in Canada. This\nletter is called the port of entry letter of introduction.\nYou should bring this letter with you when you travel to Canada and present\nit at the port of entry. This letter is not your work permit.\nYou’ll only get your work permit at the port of entry the day you arrive in\nCanada.\nThe work permit will outline\nthe type of work you can do\nthe employer you can work for\nwhere you can work\nhow long you can work\nIf you’re in Canada\nHow we process your application\nWe’ll check your application to make sure you have provided all the\nnecessary documents, including biometrics if required.\nIf it’s incomplete, we’ll return your application without processing it.\nAn officer will also check\nthe list of employers who failed to comply with the conditions to make\nsure that the employer can hire you, and\nthat you qualify for a work permit\nDepending on the type of work you’ll be doing, you might need a medical\nexam. If you do, an officer will tell you and will send you instructions on\nwhat to do. A medical exam can add over 3 months to the time it takes us to\nprocess your application.\nWe may also ask you to send more information.\nIf you’re a visitor who applied for a work permit in\nCanada before August  28, 2024\nYou can ask to be allowed to work while we process your application.\nWho’s eligible\nYou must have\nbeen physically present in Canada when you applied\nYou must stay in Canada while we process your application. If\nyou leave while your application is being processed, you won’t\nbe eligible under this public policy.\nbeen a visitor with valid status when you applied for the work\npermit\napplied for an employer-specific work permit between August 24,\n2020, and August 28, 2024\nheld a work permit that was valid in the 12 months before you\napplied for a new work permit\nHow to get authorization to work while you wait\nFollow these steps.\nStep 1: Contact us\nAfter you apply, fill out the IRCC web form.\nWhen you fill out the Your enquiry section, you must copy the text\nbelow.\nMessage to request interim authorization to work\nPriority Code VISIT2WORK2020: I am requesting consideration\nunder the Temporary Public Policy to Exempt Certain Visitors in\nCanada from Immigration Requirements during the\nCoronavirus (COVID-19) Pandemic and ask that the applicable\nexemptions be granted until a decision is made on my work permit\napplication or it is withdrawn.\nMy previous work permit number [U#########] expired on\n[Date].\nI have submitted my application for a work permit online. OR I\nhave submitted my application on paper and the postal/courier\ntracking number is NUMBER.\nI intend to work for [employer NAME] / [occupation] as specified in\nthe aforementioned work permit application.\nI understand that providing false, misleading or incorrect\ninformation is a violation of the Immigration and Refugee\nProtection Act and may result in enforcement measures against\nme.\nMake sure you fill out the sections in square brackets, including the\ndates\nwork permit number (begins with a “U”)\nname of your employer\ntitle of your job\nIf you applied on paper and don’t know your application number,\ninclude your courier tracking number. This will ensure we can find your\napplication.\nIf you have other questions, you need to fill out an IRCC Web form.\nStep 2: Wait for us to contact you\nYou must wait for us to email you to let you know that you can start\nworking. This may take up to 30 business days (6 weeks).\nIf you’re in Canada and your application is approved\nIf you were eligible to apply for a work permit from\nwithin Canada\nIf you were eligible to apply from within Canada, you filled out the form\ncalled Application to Change Conditions, Extend My Stay or Remain in\nCanada as a Worker (IMM 5710). In that case, we’ll mail the work\npermit to the Canadian address you gave us.\nIf your mailing address changes before we send you our decision, you\nmust follow the instructions to tell us your new address.\nWorking while you wait for your work permit to arrive\nWe’ll send you a note in your online account letting you know your\nwork permit has been approved. You can start working as soon as\nyou receive this note.\nYou don’t have to wait until you get your work permit in the mail to\nstart working.\nYou should get your work permit in the mail within 6 weeks of getting\nyour decision letter. If you don’t, contact us.\nThe work permit will outline\nthe type of work you can do\nthe employer you can work for\nwhere you can work\nhow long you can work\nIf you followed the instructions to apply for a work permit from\noutside Canada\nIn Canada work permit applicants: new rules about\napplying at a port of entry\nMost foreign nationals already in Canada can no longer apply for\na work permit at a port of entry. You must apply online for\nyour initial work permit\nyour work permit extension\n\nIf you’re outside of Canada, you may still be eligible to apply for a\nwork permit when you arrive at a port of entry.\nIf you’re in Canada and leave as a worker on maintained status,\nyou’ll lose your ability to work when you return. This means you\ncan’t work until your application is approved.\nIn this case, you filled out the form called Application for Work Permit\nMade Outside of Canada [IMM 1295].\nIf your application is approved, you’ll get an approval letter that says\nyou’re allowed to work in Canada. This letter is called the port of entry\nletter of introduction. It is not a work permit.\nIf you’re in Canada when you get your POE letter of introduction, you\nmust leave the country to activate your work permit. You may not be\nable to activate your work permit if you re-enter from the U.S. or Saint-\nPierre-et-Miquelon.\nThe work permit you receive at the port of entry will outline\nthe type of work you can do\nthe employer you can work for\nwhere you can work\nhow long you can work\nDate modified:\n2025-06-17\nPrepare for arrival\nHelp us improve our services\nWe’re looking for people to try out our products. Find out how you can\nparticipate.\n"
}