{
  "type": "pdf",
  "source": "Work permit_ Prepare for arrival - Canada.ca.pdf",
  "text": "Canada.ca\n \nImmigration and citizenship\n \nWork in Canada\n \nWork permit\nIRCC sign in\n\n\n\nPrepare for arrival\nWork permit\nWho can apply\nHow to apply\nAfter you apply\nPrepare for arrival\nWhen you start working\nThere are a few things you should know before you arrive in Canada to\nwork.\nIf you’re an International Experience Canada participant, there are\nspecial instructions for you.\nOn this page\nPrepare your documents\nWhen you arrive in Canada\nMedical and health insurance, and workers’ compensation in Canada\nPrepare your documents\nWhen you arrive in Canada, you must have\nyour passport\nyour visitor visa (if you need one)\nany travel document(s) you’re carrying\nYou may also need to show proof that your work permit application was\napproved. One way to do this is to show the border services officer your port\nof entry letter of introduction. You’ll get this letter if you\napplied online or\n\ngave us an email address in the work permit application form for\ncommunicating with you \nYou can print this letter or bring an electronic version with you.\nYou should also bring supporting documents, such as\nproof that you meet the requirements of the job, such as proof of work\nexperience and education\na copy of your employer’s positive labour market impact assessment\n(LMIA), if required\nYou’ll also need a copy of your attestation of issuance of your\nQuebec Acceptance Certificate (CAQ), if your employer needed an\nLMIA and you’ll work in Quebec.\nthe offer of employment number your employer received when they\nsubmitted the offer of employment through the Employer Portal (if you\nare LMIA exempt and coming to work for a specific employer)\nWhen you arrive in Canada\nWe check your identity\nWe check your identity to make sure that you’re the same person who was\napproved to travel to Canada.\nIf you enter Canada at certain Canadian airports\nyour fingerprints will be checked automatically at a primary\ninspection kiosk\nthe system will check your identity against the information collected\nwhen your application was submitted\nIf you enter Canada at smaller airports and all land ports of entry\nyour fingerprints may be checked if we refer you to a secondary\ninspection, where a border services officer will use a fingerprint\nverification device to check your fingerprints\nYou talk to the border services officer\nTell the border services officer that you have come here to work and show\nthe documents you brought with you.\nYou won’t be allowed into Canada if you give false or incomplete\ninformation.\nYou must also\nconvince the officer that\nyou meet Canada’s entry requirements\nyou’ll leave Canada at the end of your approved stay\nhave valid immigration medical exam results (if you needed an exam)\nYour results must be valid the day you enter Canada.\nYou need to get another medical exam if your results will expire\nbefore you enter Canada. \nThe officer makes the final decision to issue you a work permit and allow\nyou to enter Canada.\nWe print your work permit\nOnce the border services officer has checked your documents and confirms\nthat you can enter Canada, the officer will print the actual work permit for\nyou. If you have questions, or there’s a mistake on your work permit, ask the\nofficer before you leave.\nYour passport must be valid for longer than the time you plan to be in\nCanada. Your work permit won’t be valid beyond your passport’s expiry\ndate. This does not apply to citizens of the United States who show a valid\nUnited States passport to the border services officer.\nMedical and health insurance, and\nworkers’ compensation in Canada\nThe eligibility rules for public health insurance vary by province and\nterritory. Make sure that you and any dependants coming with you to\nCanada either have enough\nhealth care insurance\nmoney in case you need medical attention\nYou can find more information from the ministry of health of the province or\nterritory where you plan to work.\nAlberta: Health care coverage for temporary residents\nBritish Columbia: Eligibility for the Medical Services Plan\nManitoba: Health care coverage\nNew Brunswick: Apply for a Medicare card\nNewfoundland and Labrador: Medical Care Plan eligibility\nNorthwest Territories: NWT Health Care Plan\nNova Scotia: Medical Service Insurance eligibility\nNunavut: Health care plan\nOntario: Temporary foreign workers and the Ontario Health Insurance\nPlan\nPrince Edward Island: Apply for PEI Health Card – new residents\nQuebec: Health insurance card\nSaskatchewan: Eligibility for Health Benefits\nYukon: Apply for a health care card\nDate modified:\n2025-06-17\nWhen you start working\nYour employer should make sure you’re covered by workers’ compensation,\nwhen you arrive in Canada.\n"
}