{
  "type": "pdf",
  "source": "Work permit_ when you start working - Canada.ca.pdf",
  "text": "Canada.ca\n \nImmigration and citizenship\n \nWork in Canada\n \nWork permit\nIRCC sign in\n\n\n\nWhen you start working\nWork permit\nWho can apply\nHow to apply\nAfter you apply\nPrepare for arrival\nWhen you start working\nOn this page\nUnderstand the conditions of your permit\nGet a social insurance number\nUnderstand your rights as a foreign worker\nLabour standards in Canada\nUnderstand the conditions on your\npermit\nRead your work permit carefully. It sets out all the conditions for working in\nCanada. If you don’t meet those conditions, you could be asked to leave\nCanada.\nYou can also apply to change the conditions of your work permit or apply to\nextend the permit.\nIf you choose to study while you work\nYou may be eligible to study without a study permit while you work.\nTo be eligible, you must\nbe authorized to work in Canada with either\na valid work permit that you applied for on or before June 7, 2023,\nor\na letter authorizing you to work while we process your work permit\nextension application that was submitted on or before June 7, 2023\nsatisfy the terms and conditions of your work permit—except any\nconditions related to studying\nFind out if you’re eligible for this measure.\nGet a social insurance number\nThe social insurance number (SIN) is a 9-digit number that you'll need to\nwork in Canada\naccess government programs and benefits\nApply for a SIN as soon as possible after you arrive in Canada.\nHow to get a SIN\nYou should apply online to either\nsubmit a SIN application for the first time, or\nupdate your existing SIN\nYou can update the expiry date listed on your SIN or update your\nstatus in Canada.\nYou can also apply in person at a Service Canada Centre or by mail, but it\nmay take longer than applying online.\n Find out how to apply for or renew your SIN\nUnderstand your rights as a foreign\nworker\nCanada’s labour laws\nAs a temporary foreign worker, you\nare protected by Canada’s labour\nlaws.\nYour employer\nmust pay you for your work\nmust make sure that your\nworkplace is safe\ncan’t take your passport or work\npermit away from you\nLearn about your rights under\nthe\nInternational Mobility\nProgram (if you’re exempt\nfrom a labour market impact\nassessment)\nTemporary Foreign Worker\nProgram (if you need a\nlabour market impact\nassessment)\nGet to know your rights\nEach province and territory has an employment or labour standards office\nthat deals with labour and employment laws. They can talk to you about fair\npay, hours of work, rest periods and working conditions, and provide other\nservices as well.\nYou don’t need your employer’s permission to contact these offices\nor go to their websites. You also can’t be punished or deported for\ncontacting them.\nMost occupations are covered under provincial and territorial laws.\nHowever, federal labour and employment laws may apply if you work for\nthe federal government\na bank\na company that transports goods between provinces\na telecommunications company\nmost businesses owned and run by the federal government\nEmployment agreements\nIf you have an employer-specific work permit, your employer must give you\nan employment agreement. You and your employer must sign the\nagreement, which should include\n\nthe details of your job\nthe conditions of your employment\nthe highest number of hours you will work in a week\nhow much you will be paid for your work\nThe laws on hours of work and overtime (extra time or time worked after\nregular hours) depend on the province or territory you are working in.\nYour agreement may also have details about any money coming out of your\npay for programs like the Canada Pension Plan and Employment Insurance.\nAlways keep a copy of your agreement for your records. You and your\nemployer must always follow the agreement. If you disagree about work\ndetails in the future, having a copy may help you.\nContact your local employment or labour standards office to learn more\nabout employment contracts.\nIf you lose your job\nIn most cases, your employer needs to give you written notice before your\nlast day of work or pay you for that time instead. This is called termination\npay.\nYour employer does not have to warn you when you are being let go for a\n“just cause.” For example, you can be let go for serious misconduct or\nmissing work without a good reason.\nIf you have a contract for a specific period or a specific job, your employer\ndoes not have to give you notice when your contract ends.\nThe rules about notice of termination are also set by each province and\nterritory.\nIf your employer does not follow the law when they dismiss you, you can\ncomplain to the local employment or labour standards office. If you are\ncovered by a union contract, you may have to make a formal complaint\nthrough the union instead.\nHousing\nYour employer does not have to give you a place to live unless you are a\ntemporary farm worker in the Seasonal Agricultural Worker Program.\nIf you are given room and board, your employer may take part of the cost\nfrom your pay. In most provinces, the amount they can charge for meals\nand board is limited. All pay deductions must be noted in your contract.\nHealth and safety\nAll workers in Canada have the right to a safe and healthy workplace. There\nare laws to protect workers from danger.\nProvincial, territorial and federal governments each have their own laws and\nways of looking into health and safety matters.\nIs your work safe?\nTo help you decide if your workplace is safe, ask yourself:\nHave I been properly trained for the job I am doing?\nHave I been given the right safety equipment to do the job?\nDo I feel unsafe when doing my job?\nDo I work close to dangerous materials?\nTo report an unsafe workplace, contact your local employment or labour\nstandards office.\nRefusing dangerous work\nYour employer cannot force you to do work that’s dangerous. Your\nemployer must look into any danger that’s reported in the workplace. You\nhave the right to refuse to do the work until\nyou and your employer agree that the danger is removed\nyou feel the problem no longer exists\na government official tells you that it is safe to do the work\nIf you get sick or hurt at work\nTell your supervisor as soon as possible and get medical attention. Your\nemployer must give you access to a health care provider (like a doctor, nurse\nor pharmacist) by, for example\ngiving you time off to seek medical attention\nmaking a phone available to call emergency services (ambulance)\ngiving you information on how to get health care\nhelping you get to the health care provider\nYou can speak privately with a health care provider, without your employer.\nMost provinces and territories provide workers’ compensation benefits.\nWorkers’ compensation plans give you help (medical or wage benefits) if\nyou are hurt on the job or if your job causes you to get sick. Your employer is\nnot allowed to take any money from your pay for these plans.\nIn some provinces and territories, employers don’t need to offer you\nworkers’ compensation benefits. If so, this must be clearly written in your\nemployment contract.\nContact your local employment or labour standards office to learn more\nabout workers’ compensation benefits.\nFarm workers’ rights\nSome farm workers in Canada have special rights under the Seasonal\nAgricultural Worker Program.\nReport abuse\nIf you suspect that your employer has not been respecting your rights as a\ntemporary foreign worker or has been misusing the program, report it to us.\nIf you think you’re being abused or at risk of being abused, you may be able\nto apply for an open work permit for vulnerable workers to help you leave\nan abusive work situation.\nEmployment standards in Canada\nContact the employment standards branch in the province or territory\nwhere you work unless you work for a federally regulated businesses or\nindustry. In that case, you should contact the Federal Labour Program.\nFederal Labour Program\nEmployment and Social Development Canada\nFederal Labour Standards\nToll Free: 1-800-641-4049\nIf you do not work for a federally regulated business or industry, the\nemployment standards that regulate your conditions of work are likely\ncovered by a provincial or territorial employment standards office\nfound below.\nAlberta\nMinistry of Jobs, Economy and Trade\nEmployment Standards Branch\nPhone: 780-427-3731\nToll free: 1-877-427-3731\nFax: 780-427-9999\nTDD/TDY: 1-800-232-7215\nBritish Columbia\nMinistry of Jobs, Tourism and Skills Training and Minister Responsible\nfor Labour\nEmployment Standards Branch\nToll free: 1-833-236-3700\nOutside British Columbia: (250) 612-4100\nManitoba\nManitoba Labour and Immigration\nEmployment Standards\nTelephone: (204) 945-3352 (Winnipeg)\nToll free: 1-800-821-4307 (outside Winnipeg)\nFax: (204) 948-3046\nNew Brunswick\nDepartment of Post-Secondary Education, Training and Labour\nEmployment Standards Branch\nTelephone: (506) 453-2725 (Fredericton or outside New Brunswick)\nToll free: 1-888-452-2687\nNewfoundland and Labrador\nAdvanced Education, Skills and Labour\nLabour Standards Division\nTelephone: (709) 729-2743/729-2742\nToll free: 1-877-563-1063\nNorthwest Territories\nEducation, Culture and Employment\nEmployment Standards\nTelephone: (867) 767-9351 option 3\nToll free: 1-888-700-5707\nFax: (867) 873-0483\nNova Scotia\nLabour and Advanced Education\nLabour Standards Division\nTelephone: (902) 424-4311\nToll free: 1-888-315-0110\nFax: (902) 424-0648\nNunavut\nDepartment of Justice\nLabour Standards Office\nTelephone: (867) 975-7293\nToll Free: 1-877-806-8402\nFax: (867) 975-7294\n(Note: minimal information on website)\nOntario\nMinistry of Labour\nEmployment Standards Branch\nTelephone: (416) 326-7160 (Greater Toronto Area)\nToll free: 1-800-531-5551\nTTY: 1-866-567-8893\nPrince Edward Island\nCommunities, Cultural Affairs and Labour\nEmployment Standards Branch\nTelephone: (902) 368-5552\nToll-free: 1-800-333-4360\nFax: (902) 368-5476\nQuebec\nCommission des normes, de l’équité, de la santé et de la sécurité du\ntravail (CNESST)\nToll free: 1-844-838-0808\nSaskatchewan\nDate modified:\n2024-08-12\nAdvanced Education, Employment and Labour\nLabour Standards\nTelephone: (306) 787-2438 (Regina)\nToll free: 1-800-667-1783\nFax: (306) 787-4780 (Regina)\nYukon\nDepartment of Community Services\nEmployment Standards Branch\nTelephone: (867) 667-5944\nToll free: 1-800-661-0408, extension 5944"
}